{
  "tickers": {
    "TSLA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.934816",
      "company": {
        "name": "Tesla Inc",
        "market_cap": "$1.42T",
        "market_cap_raw": 1418727916000.0,
        "last_q_revenue": 28095000000.0,
        "description": "Tesla, Inc. is a leading American electric vehicle and clean energy company headquartered in Palo Alto, California, renowned for its groundbreaking innovations in sustainable transportation and energy solutions. As the market leader, Tesla commanded a 16% share of the global plug-in vehicle market and 23% of the battery-electric vehicle sector as of 2020, reflecting its commitment to pushing the boundaries of electric mobility. The company's diverse portfolio includes electric vehicles, advanced battery technology, and solar energy solutions, with Tesla Energy focusing on battery storage and solar products that enhance renewable energy integration. With strategic investments in production capacity and continued technological advancements, Tesla is well-positioned to capitalize on the accelerating global transition towards sustainable energy.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "ADI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.472386",
      "company": {
        "name": "Analog Devices Inc",
        "market_cap": "$151.07B",
        "market_cap_raw": 151068082000.0,
        "last_q_revenue": 3076117000.0,
        "description": "Analog Devices, Inc. (ADI) is a prominent multinational semiconductor company based in Wilmington, Massachusetts, known for its expertise in high-performance analog, mixed-signal, and digital signal processing integrated circuits. Catering to a wide array of industries—including automotive, industrial, communications, and consumer electronics—ADI provides cutting-edge solutions in data conversion, signal processing, and power management. The company's relentless focus on innovation and its robust research and development initiatives enhance its reputation as a leader in the semiconductor space, driving advancements in product performance and energy efficiency. With a proven track record of growth and a strategic vision for future advancements, ADI is well-positioned to capitalize on emerging market opportunities.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PLTR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.821103",
      "company": {
        "name": "Palantir Technologies Inc.",
        "market_cap": "$307.77B",
        "market_cap_raw": 307773145000.0,
        "last_q_revenue": 1406802000.0,
        "description": "Palantir Technologies Inc. creates and implements software platforms for the intelligence community in the United States to assist in counterterrorism investigations and operations. The company is headquartered in Denver, Colorado.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "F": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.309802",
      "company": {
        "name": "Ford Motor Company",
        "market_cap": "$53.67B",
        "market_cap_raw": 53671199000.0,
        "last_q_revenue": 50534000000.0,
        "description": "Ford Motor Company, a pioneering force in the automotive industry since its inception in 1903, is based in Dearborn, Michigan, and offers a wide-ranging portfolio that includes trucks, SUVs, and an expanding array of electric vehicles. With a strong emphasis on electrification and digital integration, Ford is dedicated to sustainability and innovative mobility solutions. The company's established brand reputation, combined with its commitment to customer-centric design, positions it favorably for long-term growth and adaptability within the dynamic automotive landscape. Ford's strategic initiatives towards electrification and technological advancements underscore its potential to thrive in a competitive market as consumer preferences evolve.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "GOOG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.655047",
      "company": {
        "name": "Alphabet Inc Class C",
        "market_cap": "$3.89T",
        "market_cap_raw": 3888216801000.0,
        "last_q_revenue": 102346000000.0,
        "description": "Alphabet Inc. (GOOG) is a leading American multinational conglomerate, headquartered in Mountain View, California, that emerged from Google's corporate restructuring in October 2015. As the parent company of Google and a wide range of subsidiaries, Alphabet excels in technology sectors such as search services, digital advertising, cloud computing, consumer electronics, and artificial intelligence. With robust revenue generation, the company significantly contributes to the global digital economy's evolution. Under visionary leadership from its co-founders, Alphabet is strategically positioned to spearhead innovation and expand its footprint in rapidly growing technology markets.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "HIMS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.266957",
      "company": {
        "name": "Hims Hers Health Inc",
        "market_cap": "$8.74B",
        "market_cap_raw": 8741704000.0,
        "last_q_revenue": 598976000.0,
        "description": "Hims & Hers Health, Inc. is a leading multi-specialty telehealth platform headquartered in San Francisco, California, that revolutionizes healthcare access through its innovative technology connecting consumers with licensed healthcare professionals. The company boasts an extensive array of services, including prescription medications, mental health support, and personal care products, tailored to meet diverse health needs. As a frontrunner in the rapidly growing telemedicine sector, Hims & Hers is poised to capitalize on the increasing consumer demand for convenient and affordable healthcare solutions, solidifying its position as a key player in the digital health arena. With a focus on service expansion and consumer-centric care, Hims & Hers is well-equipped to navigate the evolving landscape of healthcare preferences.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "SMCI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.757956",
      "company": {
        "name": "Super Micro Computer Inc",
        "market_cap": "$19.60B",
        "market_cap_raw": 19598563000.0,
        "last_q_revenue": 5017790000.0,
        "description": "Super Micro Computer, Inc. (SMCI) is a prominent provider of high-performance server and storage solutions, recognized for its innovative, open, and modular architecture. Based in San Jose, California, the company develops advanced technologies that cater to the evolving needs of data centers, cloud computing, and enterprise applications. With a strong emphasis on sustainability and efficiency, SMCI is strategically positioned to leverage the increasing demand for cutting-edge computing solutions across critical sectors such as artificial intelligence and big data analytics, making it a compelling investment opportunity for institutional investors looking to capitalize on technological advancements.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "NVTS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.318985",
      "company": {
        "name": "Navitas Semiconductor Corp",
        "market_cap": "$1.71B",
        "market_cap_raw": 1705672000.0,
        "last_q_revenue": 10112000.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PANW": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.576333",
      "company": {
        "name": "Palo Alto Networks Inc",
        "market_cap": "$130.05B",
        "market_cap_raw": 130045641000.0,
        "last_q_revenue": 2474000000.0,
        "description": "Palo Alto Networks, Inc. (PANW) is a premier player in the cybersecurity sector, headquartered in Santa Clara, California, renowned for its cutting-edge platform that safeguards organizations from a diverse range of cyber threats through advanced firewall technologies, cloud security solutions, and AI-enhanced threat intelligence. The company serves a varied global clientele and maintains a strong commitment to enterprise security, risk management, and continuous innovation. As the cybersecurity landscape evolves and the demand for comprehensive protection intensifies, Palo Alto Networks is poised for growth, driving expansion of its product portfolio and reinforcing its status as an essential partner for organizations seeking to navigate today’s complex security challenges.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "CRWD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.511833",
      "company": {
        "name": "Crowdstrike Holdings Inc",
        "market_cap": "$121.31B",
        "market_cap_raw": 121307242000.0,
        "last_q_revenue": 1234244000.0,
        "description": "CrowdStrike Holdings, Inc. is a leading cybersecurity firm renowned for its innovative cloud-based solutions specializing in endpoint protection and cloud workload security. With a strong global presence across the United States, Europe, and Asia, CrowdStrike caters to a diverse clientele, including small businesses and Fortune 500 companies. By harnessing advanced artificial intelligence and machine learning, the company offers real-time defense against a wide range of cyber threats, serving as a critical ally for organizations in an increasingly complex digital environment. Headquartered in Sunnyvale, California, CrowdStrike stands out for its commitment to continuous innovation and its proactive approach in defending essential infrastructures against evolving cyber threats.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "KO": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.752712",
      "company": {
        "name": "The Coca-Cola Company",
        "market_cap": "$305.43B",
        "market_cap_raw": 305431282000.0,
        "last_q_revenue": 12455000000.0,
        "description": "The Coca-Cola Company (KO) is a premier global beverage leader headquartered in Atlanta, Georgia, with an extensive portfolio of over 500 brands, including the iconic Coca-Cola soft drink. Operating in over 200 countries, the company has developed a comprehensive distribution network that connects it with a diverse consumer base worldwide. Coca-Cola's strategic focus on innovation and sustainability enables it to swiftly respond to changing consumer preferences, thereby ensuring its long-term resilience and growth in the competitive beverage landscape. This strong positioning and consistent performance make Coca-Cola an attractive investment opportunity for institutional investors seeking stability and enduring value in their portfolio.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "BEVERAGES - NON-ALCOHOLIC"
      }
    },
    "MCD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.445180",
      "company": {
        "name": "McDonald’s Corporation",
        "market_cap": "$220.23B",
        "market_cap_raw": 220232598000.0,
        "last_q_revenue": 7078000000.0,
        "description": "McDonald’s Corporation (MCD) stands as a leading force in the global fast-food landscape, celebrated for its renowned Golden Arches and diverse menu options since 1940. Serving customers in over 100 countries, the company leverages a vast franchise network dedicated to quality, innovation, and exceptional customer experience. McDonald's is at the forefront of sustainability initiatives and digital transformation, adapting to shifting consumer preferences while optimizing operational efficiencies. With a strong brand presence and a proven business model, McDonald’s presents an attractive investment opportunity for institutional investors aiming for consistent growth in the evolving food service sector.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "RESTAURANTS"
      }
    },
    "SOUN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.007465",
      "company": {
        "name": "SoundHound AI Inc",
        "market_cap": "$4.97B",
        "market_cap_raw": 4965533000.0,
        "last_q_revenue": 42049000.0,
        "description": "SoundHound AI, Inc. is a premier provider of voice artificial intelligence solutions, enabling businesses to optimize customer engagement through intuitive conversational interfaces. Headquartered in Santa Clara, California, the company harnesses cutting-edge natural language processing and machine learning capabilities to ensure precise and context-aware interactions. As the demand for advanced voice AI technology escalates in a rapidly evolving digital marketplace, SoundHound is strategically positioned to expand its innovative product offerings and cement its leadership in the industry.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "LAC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.026850",
      "company": {
        "name": "Lithium Americas Corp",
        "market_cap": "$1.55B",
        "market_cap_raw": 1553860000.0,
        "last_q_revenue": 0.0,
        "description": "Lithium Americas Corp. (LAC) is a prominent player in the lithium mining sector, headquartered in Vancouver, Canada. With a focus on advancing key projects in North America, the company is well-positioned to meet the increasing demand for lithium, driven by the rapid growth of electric vehicles and renewable energy storage solutions. Leveraging strategic geographic advantages and innovative energy technologies, Lithium Americas is poised to play a vital role in the transition to a sustainable energy future, capitalizing on trends toward decarbonization and electrification in the global economy.",
        "sector": "BASIC MATERIALS",
        "industry": "OTHER INDUSTRIAL METALS & MINING"
      }
    },
    "SOFI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.966326",
      "company": {
        "name": "SoFi Technologies Inc.",
        "market_cap": "$34.36B",
        "market_cap_raw": 34356179000.0,
        "last_q_revenue": 1268047000.0,
        "description": "SoFi Technologies, Inc. is a prominent digital financial services provider based in San Francisco, California, focusing on a diverse range of offerings, including personal loans, student and home refinancing, investment management, and insurance solutions. By leveraging cutting-edge technology, SoFi aims to empower individuals on their journey to financial independence while enhancing the accessibility and efficiency of financial services. The company has established a comprehensive platform that integrates borrowing, investing, and community engagement, making it a holistic financial partner for its members and differentiating it in the competitive fintech landscape.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "AMZN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.049296",
      "company": {
        "name": "Amazon.com Inc",
        "market_cap": "$2.42T",
        "market_cap_raw": 2418019926000.0,
        "last_q_revenue": 180169000000.0,
        "description": "Amazon.com, Inc. is a leading American multinational technology company, widely recognized for its dominance in e-commerce, cloud computing via Amazon Web Services (AWS), and digital streaming. As a key player among the \"Big Five\" tech giants, Amazon's innovative approach and unwavering commitment to customer-centric solutions have established it as one of the world's most valuable brands. The company remains at the forefront of technological advancement, with strategic investments in artificial intelligence and logistics, positioning itself to leverage emerging market trends and further enhance its competitive edge in the rapidly evolving digital landscape.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "INTERNET RETAIL"
      }
    },
    "ORCL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.463281",
      "company": {
        "name": "Oracle Corporation",
        "market_cap": "$635.76B",
        "market_cap_raw": 635755233000.0,
        "last_q_revenue": 16057000000.0,
        "description": "Oracle Corporation is a leading multinational technology company based in Austin, Texas, specializing in a broad range of software products and cloud computing solutions. As a dominant force in the cloud infrastructure sector, Oracle is committed to driving digital transformation for enterprises by leveraging cutting-edge technologies, including artificial intelligence and machine learning. The company maintains a robust focus on research and development, consistently updating its portfolio to meet the evolving needs of global businesses, thereby solidifying its reputation for innovation and excellence in the technology space.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "APLD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.183607",
      "company": {
        "name": "Applied Digital Corporation",
        "market_cap": "$10.53B",
        "market_cap_raw": 10534794000.0,
        "last_q_revenue": 126589000.0,
        "description": "Applied Digital Corporation (APLD), headquartered in Dallas, Texas, is a leading player in the cryptocurrency mining and co-hosting sector, utilizing cutting-edge technologies to optimize the performance and scalability of its data centers. With the increasing adoption of blockchain technology and decentralized finance, APLD is well-positioned to seize growth opportunities in this dynamic market. The company's focus on innovation and high operational standards presents institutional investors with a unique chance to participate in the burgeoning digital asset ecosystem, making APLD a noteworthy investment consideration.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "MU": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.973345",
      "company": {
        "name": "Micron Technology Inc",
        "market_cap": "$266.96B",
        "market_cap_raw": 266955473000.0,
        "last_q_revenue": 11315000000.0,
        "description": "Micron Technology, Inc. is a premier American manufacturer of innovative memory and storage solutions, with a pivotal role in the global semiconductor landscape. Headquartered in Boise, Idaho, the company specializes in dynamic random-access memory (DRAM), NAND flash memory, and other advanced products that cater to a diverse array of sectors, including computing, mobile, and automotive. As demand surges from trends such as artificial intelligence, data centers, and the Internet of Things, Micron's robust commitment to research and development enables it to maintain its leadership position and drive significant technological advancements in memory solutions worldwide.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "ZS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:25.221850",
      "company": {
        "name": "Zscaler Inc",
        "market_cap": "$35.52B",
        "market_cap_raw": 35523805000.0,
        "last_q_revenue": 788112000.0,
        "description": "Zscaler, Inc. is a leading cloud security provider headquartered in San Jose, California, specializing in secure internet access for applications and data. The company's innovative Zero Trust Exchange platform enables enterprises to migrate from traditional network security frameworks to a modern, cloud-native architecture, offering comprehensive defense against an array of cyber threats. As organizations accelerate their digital transformations, Zscaler is well-positioned to meet the growing demand for scalable and secure cloud solutions, reinforcing its pivotal role in shaping the future of cybersecurity.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "WMT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.972873",
      "company": {
        "name": "Walmart Inc. Common Stock",
        "market_cap": "$930.43B",
        "market_cap_raw": 930431697000.0,
        "last_q_revenue": 179496000000.0,
        "description": "Walmart Inc. is a premier American multinational retail corporation headquartered in Bentonville, Arkansas, operating a comprehensive portfolio of hypermarkets, discount department stores, and grocery outlets, including Sam's Club. Renowned for its commitment to low prices and exceptional product diversity, Walmart effectively utilizes advanced supply chain solutions and innovative e-commerce strategies to sustain its competitive edge. The company emphasizes sustainability and digital transformation, driving operational efficiency and market expansion while significantly impacting the U.S. economy. With a focus on meeting the evolving needs of consumers, Walmart continues to lead the retail sector in both breadth and innovation.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "DISCOUNT STORES"
      }
    },
    "SNOW": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.888297",
      "company": {
        "name": "Snowflake Inc.",
        "market_cap": "$76.13B",
        "market_cap_raw": 76125815000.0,
        "last_q_revenue": 1212909000.0,
        "description": "Snowflake Inc. is a pioneering cloud-based data platform headquartered in San Mateo, California, transforming the way organizations manage and analyze data on a global scale. Its innovative architecture allows for seamless data sharing and collaboration, empowering businesses to leverage their data for advanced analytics and scalable data science solutions. Catering to a diverse client base, Snowflake leads the market in data warehousing and operational intelligence, making it a compelling investment opportunity within the dynamic technology sector. With a strong focus on agility and operational efficiency, the company is strategically positioned to capitalize on the burgeoning demand for data-driven decision-making in an evolving digital landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "PATH": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.625906",
      "company": {
        "name": "Uipath Inc",
        "market_cap": "$7.42B",
        "market_cap_raw": 7415638000.0,
        "last_q_revenue": 361728000.0,
        "description": "UiPath Inc. (PATH) is a leading force in the robotic process automation (RPA) industry, delivering a comprehensive automation platform that enhances operational efficiency and drives digital transformation across a variety of sectors. Leveraging cutting-edge artificial intelligence and machine learning capabilities, the company is ideally placed to capitalize on the rapidly growing demand for automation solutions. With a strategic presence in key markets, including the United States, Romania, and Japan, and headquartered in New York, UiPath is well-positioned to support organizations in navigating their automation journeys effectively.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "MRVL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.789148",
      "company": {
        "name": "Marvell Technology Group Ltd",
        "market_cap": "$85.27B",
        "market_cap_raw": 85270315000.0,
        "last_q_revenue": 2074500000.0,
        "description": "Marvell Technology Group Ltd is a leading provider of infrastructure semiconductor solutions, dedicated to advancing digital transformation across networks, data centers, and enterprise storage. Headquartered in Wilmington, Delaware, the company specializes in designing cutting-edge technologies, including analog, mixed-signal, and digital signal processing integrated circuits, which serve key sectors such as cloud computing, 5G, and automotive applications. With a robust commitment to high-performance innovation, Marvell is well-positioned to capitalize on the surging demand for improved connectivity and efficient data management in today’s data-centric landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "HPE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.510152",
      "company": {
        "name": "Hewlett Packard Enterprise Co",
        "market_cap": "$29.48B",
        "market_cap_raw": 29479838000.0,
        "last_q_revenue": 9696000000.0,
        "description": "Hewlett Packard Enterprise Co (HPE) is a prominent American multinational technology company headquartered in Houston, Texas, specializing in delivering robust IT solutions tailored for enterprises. The company is at the forefront of hybrid cloud services, data storage, and advanced IT infrastructure, providing innovative products that drive operational efficiency and enable seamless digital transformation. With a strong focus on edge computing and intelligent data solutions, HPE positions itself as a strategic partner for businesses aiming to effectively leverage technology in a fast-evolving digital landscape, ensuring they remain competitive and responsive to market demands.",
        "sector": "TECHNOLOGY",
        "industry": "COMMUNICATION EQUIPMENT"
      }
    },
    "DELL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.894425",
      "company": {
        "name": "Dell Technologies Inc",
        "market_cap": "$86.04B",
        "market_cap_raw": 86040306000.0,
        "last_q_revenue": 27005000000.0,
        "description": "Dell Technologies Inc. is a prominent global leader in information technology solutions, offering a diverse range of products including personal computers, servers, data storage, and cloud infrastructure. Based in Round Rock, Texas, the company is dedicated to empowering digital transformation for businesses of all sizes through innovative technologies and customer-centric services. With a strong emphasis on operational excellence and continuous innovation, Dell is well-equipped to adapt to the rapidly changing digital landscape, thereby solidifying its competitive position and expanding its market presence across multiple sectors.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "CSCO": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.645631",
      "company": {
        "name": "Cisco Systems Inc",
        "market_cap": "$309.84B",
        "market_cap_raw": 309844836000.0,
        "last_q_revenue": 14883000000.0,
        "description": "Cisco Systems, Inc. is a leading technology company based in San Jose, California, recognized for its expertise in networking hardware, software, and telecommunications solutions. With a strong emphasis on innovation in areas such as the Internet of Things (IoT) and cybersecurity, Cisco enhances enterprise communications and data security globally through its Webex platform. The company's continued focus on strategic acquisitions and significant investment in research and development solidifies its position as a key player in digital transformation and network security. By offering a comprehensive portfolio of advanced connectivity solutions, Cisco is dedicated to empowering organizations to navigate the complexities of an increasingly interconnected world.",
        "sector": "TECHNOLOGY",
        "industry": "COMMUNICATION EQUIPMENT"
      }
    },
    "AVGO": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.535454",
      "company": {
        "name": "Broadcom Inc",
        "market_cap": "$1.70T",
        "market_cap_raw": 1699720724000.0,
        "last_q_revenue": 18015000000.0,
        "description": "Broadcom Inc. is a premier American technology firm that excels in semiconductor and infrastructure software solutions, serving vital sectors including data centers, networking, broadband, wireless, and storage. The company is recognized for its cutting-edge products that enhance connectivity and data processing, thereby facilitating digital transformation across diverse industries. With a strategic focus on growth through acquisitions and substantial research and development investments, Broadcom is strategically positioned to leverage emerging technologies such as 5G, cloud computing, and the Internet of Things (IoT). As a dominant player in the global semiconductor market, Broadcom is poised for sustained growth in an increasingly interconnected landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "AMAT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.811610",
      "company": {
        "name": "Applied Materials Inc",
        "market_cap": "$208.14B",
        "market_cap_raw": 208138764000.0,
        "last_q_revenue": 6800000000.0,
        "description": "Applied Materials, Inc. (AMAT) is a leading global provider of equipment, services, and software essential for semiconductor manufacturing and advanced display technologies, headquartered in Santa Clara, California. The company plays a pivotal role in the electronics sector by enabling the production of integrated circuit chips and flat panel displays, while also making significant strides in solar energy solutions and flexible electronics. With a strong focus on innovation and technological advancement, Applied Materials is well-positioned to capitalize on the increasing demand for high-performance electronic devices and sustainable energy resources, solidifying its status as an industry leader in these critical markets.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "VZ": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.739056",
      "company": {
        "name": "Verizon Communications Inc",
        "market_cap": "$168.57B",
        "market_cap_raw": 168572682000.0,
        "last_q_revenue": 33821000000.0,
        "description": "Verizon Communications Inc. is a premier telecommunications provider headquartered in New York City and is a notable component of the Dow Jones Industrial Average. The company delivers a wide array of services, encompassing wireless and wireline voice, data, and video solutions tailored for both consumer and enterprise customers. As a leader in the deployment of 5G technology, Verizon is strategically positioned to enhance customer connectivity and drive innovation within the sector. Its ongoing investment in digital infrastructure and commitment to a customer-centric approach solidify Verizon’s status as a formidable player in the rapidly evolving telecommunications landscape, ensuring sustained growth and operational excellence.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "TELECOM SERVICES"
      }
    },
    "VRT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.555852",
      "company": {
        "name": "Vertiv Holdings Co",
        "market_cap": "$68.72B",
        "market_cap_raw": 68717662000.0,
        "last_q_revenue": 2675800000.0,
        "description": "Vertiv Holdings Co is a premier global provider of critical digital infrastructure technologies and lifecycle services, focusing on data centers, communication networks, and industrial environments. Based in Columbus, Ohio, the company serves a wide range of clients across the Americas, EMEA, and Asia Pacific, solidifying its role as a vital partner for organizations aimed at boosting operational resilience and efficiency. Vertiv’s comprehensive portfolio of innovative solutions addresses the complexities of today’s dynamic digital landscape, ensuring that clients can adapt and excel in an increasingly interconnected world.",
        "sector": "INDUSTRIALS",
        "industry": "ELECTRICAL EQUIPMENT & PARTS"
      }
    },
    "UNH": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.353200",
      "company": {
        "name": "UnitedHealth Group Incorporated",
        "market_cap": "$305.02B",
        "market_cap_raw": 305023025000.0,
        "last_q_revenue": 113161000000.0,
        "description": "UnitedHealth Group Incorporated is a premier American multinational managed healthcare and insurance company based in Minnetonka, Minnesota. As the largest insurance provider by net premiums and the second-largest healthcare entity by revenue, generating $257.1 billion as of 2020, UnitedHealth Group boasts a robust portfolio, with its UnitedHealthcare division contributing approximately 80% of total revenue. The company is strategically positioned to leverage the evolving healthcare landscape, demonstrating a commitment to innovation through investments in digital health, telemedicine, and data analytics, ultimately enhancing patient care while driving growth and operational efficiency.",
        "sector": "HEALTHCARE",
        "industry": "HEALTHCARE PLANS"
      }
    },
    "TTD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.095507",
      "company": {
        "name": "Trade Desk Inc",
        "market_cap": "$19.58B",
        "market_cap_raw": 19582163000.0,
        "last_q_revenue": 739433000.0,
        "description": "Trade Desk, Inc. is a premier technology company based in Ventura, California, specializing in digital advertising and programmatic marketing solutions. The company's advanced platform empowers advertisers to optimize campaigns across diverse channels and devices, capitalizing on data-driven insights to enhance targeting effectiveness. As a leader in the dynamic ad tech industry, Trade Desk is well-positioned for sustained growth, serving a broad clientele of global marketers and agencies. With a strategic emphasis on innovation and analytics, Trade Desk continues to redefine the advertising landscape, making it a compelling opportunity for institutional investors.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "ADVERTISING AGENCIES"
      }
    },
    "TSM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.033432",
      "company": {
        "name": "Taiwan Semiconductor Manufacturing",
        "market_cap": "$1.53T",
        "market_cap_raw": 1532352922000.0,
        "last_q_revenue": 989918000000.0,
        "description": "Taiwan Semiconductor Manufacturing Company, Limited (TSMC) is the world's premier pure-play semiconductor foundry, recognized for its advanced manufacturing and design capabilities in integrated circuits. With its headquarters in Hsinchu, Taiwan, TSMC serves a diverse clientele, including industry leaders in smartphones, high-performance computing, and automotive sectors, underscoring its pivotal role in the global technology supply chain. The company's commitment to innovation is evidenced by substantial investments in state-of-the-art technologies, positioning it as a leader in semiconductor fabrication and facilitating critical advancements across consumer and enterprise landscapes. TSMC's strong international presence is further reflected in its predominantly foreign investor ownership, highlighting its strategic partnerships and influence in the global market.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "OSCR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.516374",
      "company": {
        "name": "Oscar Health Inc",
        "market_cap": "$5.17B",
        "market_cap_raw": 5174590000.0,
        "last_q_revenue": 2985984000.0,
        "description": "Oscar Health, Inc. is a technology-driven health insurance provider headquartered in New York, distinguished for its innovative approach to healthcare solutions for individuals, families, and businesses across the United States. By leveraging a proprietary platform, Oscar enhances member engagement through personalized care management and streamlined access to medical services, which fosters improved health outcomes while effectively managing costs. As a leader in the intersection of technology and health insurance, Oscar Health is poised to reshape the industry dynamics, appealing to a broad base of health-conscious consumers and positioning itself as a key player in the rapidly evolving healthcare landscape.",
        "sector": "HEALTHCARE",
        "industry": "HEALTHCARE PLANS"
      }
    },
    "LHX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.144500",
      "company": {
        "name": "L3Harris Technologies Inc",
        "market_cap": "$63.84B",
        "market_cap_raw": 63844229000.0,
        "last_q_revenue": 5659000000.0,
        "description": "L3Harris Technologies Inc. (LHX) stands at the forefront of the defense and aerospace industries, delivering cutting-edge communication and electronic systems that bolster national security and enhance operational effectiveness. With a robust portfolio encompassing advanced capabilities in C6ISR, tactical communications, and next-generation avionics, L3Harris is adept at addressing the intricate challenges of modern warfare and diverse commercial applications. The company's unwavering dedication to innovation and operational excellence positions it as a key player in the dynamic geopolitical landscape, providing tailored solutions that safeguard national interests while streamlining operations for government and commercial clients alike.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "IONQ": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.117073",
      "company": {
        "name": "IONQ Inc",
        "market_cap": "$16.08B",
        "market_cap_raw": 16084294000.0,
        "last_q_revenue": 39866000.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "INTC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.067099",
      "company": {
        "name": "Intel Corporation",
        "market_cap": "$217.27B",
        "market_cap_raw": 217273483000.0,
        "last_q_revenue": 13653000000.0,
        "description": "Intel Corporation, headquartered in Santa Clara, California, stands as the foremost semiconductor manufacturer globally, recognized for its innovative x86 microprocessors. As a critical player in the technology landscape, Intel is evolving its strategy to prioritize data-centric technologies, artificial intelligence, and cloud computing, reflecting the burgeoning demands of modern digital infrastructure. With substantial investments in research and development, the company is strategically positioned to harness emerging technologies and maintain its leadership edge in an ever-evolving market, reinforcing its pivotal role in shaping the future of computing and connectivity.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "IBM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.898273",
      "company": {
        "name": "International Business Machines",
        "market_cap": "$282.87B",
        "market_cap_raw": 282869563000.0,
        "last_q_revenue": 16331000000.0,
        "description": "International Business Machines Corporation (IBM) is a prominent American multinational technology company headquartered in Armonk, New York, with operations spanning over 170 countries. Established in 1911, IBM has established itself as a leader in innovation through its diverse offerings in hardware, software, and consulting services, with an increasing emphasis on artificial intelligence, quantum computing, and cloud solutions. The company is recognized for its strong research capabilities, having achieved the distinction of securing the most annual U.S. patents for 28 consecutive years, reflecting its dedication to pioneering technology. With a legacy that includes groundbreaking inventions like the ATM and relational database, IBM continues to evolve and play a critical role in advancing technological solutions across various sectors, adapting to the ever-changing digital landscape.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "HOOD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.456905",
      "company": {
        "name": "Robinhood Markets Inc",
        "market_cap": "$115.54B",
        "market_cap_raw": 115536781000.0,
        "last_q_revenue": 1274000000.0,
        "description": "None",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "HII": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.213292",
      "company": {
        "name": "Huntington Ingalls Industries Inc",
        "market_cap": "$16.15B",
        "market_cap_raw": 16154128000.0,
        "last_q_revenue": 3192000000.0,
        "description": "Huntington Ingalls Industries Inc. (HII) is the leading military shipbuilding firm in the United States, specializing in the design, construction, and maintenance of surface combatants, submarines, and amphibious assault ships. As a key player in the defense sector, HII supports national security and maritime operations while also providing diverse professional services to government and commercial clients. The company’s emphasis on advanced engineering, innovation, and sustainability positions it favorably in a robust defense market, making HII an attractive investment option for institutional investors looking for stability and long-term growth potential.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "GM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.574804",
      "company": {
        "name": "General Motors Company",
        "market_cap": "$78.40B",
        "market_cap_raw": 78403609000.0,
        "last_q_revenue": 45049000000.0,
        "description": "General Motors Company (NYSE: GM) is a premier American automotive manufacturer headquartered in Detroit, recognized for its diverse portfolio of renowned brands, including Chevrolet, Cadillac, GMC, and Buick. Embracing a transformative shift towards electric and autonomous vehicles, GM is steadfast in its commitment to sustainability and innovation, effectively positioning itself for the future of mobility. The company strategically invests in advanced technologies and continues to enhance its mobility solutions, ensuring its market leadership amidst evolving consumer demands and global trends towards greener transportation. With a robust global presence and a dynamic financial services division, GM is poised to capitalize on emerging market opportunities and maintain its competitive edge in the automotive industry.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "CRWV": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.552436",
      "company": {
        "name": "CoreWeave, Inc. Class A Common Stock",
        "market_cap": "$60.14B",
        "market_cap_raw": 60139672000.0,
        "last_q_revenue": 1364676000.0,
        "description": "CoreWeave, Inc. (Ticker: CRWV) is a leading cloud infrastructure provider based in Livingston, New Jersey, specializing in high-performance computing solutions designed for generative AI applications. The company offers scalable and efficient computational resources that enable developers and enterprises to fully leverage the transformative capabilities of artificial intelligence. By prioritizing innovation and exceptional customer support, CoreWeave is well-positioned to capitalize on the surging demand for advanced computing power in the rapidly evolving AI landscape, driving substantial growth and value for its investors.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "DDOG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.832051",
      "company": {
        "name": "Datadog Inc",
        "market_cap": "$46.86B",
        "market_cap_raw": 46863639000.0,
        "last_q_revenue": 885651000.0,
        "description": "Datadog, Inc. is a premier provider of cloud-based observability solutions that enhance application performance and operational efficiency for developers and IT teams. With its robust platform offering real-time insights across extensive technology stacks, Datadog enables organizations to effectively monitor their cloud environments and improve infrastructure visibility. Headquartered in New York, the company is strategically positioned in the burgeoning observability market and caters to a diverse global clientele. By emphasizing scalability and innovation, Datadog remains a vital partner for enterprises undertaking digital transformation initiatives, solidifying its role in the evolving digital landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "CEG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.182736",
      "company": {
        "name": "Constellation Energy Corp",
        "market_cap": "$113.83B",
        "market_cap_raw": 113828086000.0,
        "last_q_revenue": 7184000000.0,
        "description": "Constellation Energy Corporation (CEG), headquartered in Baltimore, Maryland, stands as a prominent leader in the U.S. energy sector, primarily focusing on clean and reliable energy solutions through its extensive investments in nuclear and renewable sources. The company is dedicated to sustainability and innovation, adeptly positioning itself to address the increasing demand for environmentally responsible energy as the market evolves. With a diverse portfolio that spans generation and retail services, Constellation Energy is strategically poised to leverage emerging opportunities and navigate the dynamic landscape of the energy industry.",
        "sector": "UTILITIES",
        "industry": "UTILITIES - INDEPENDENT POWER PRODUCERS"
      }
    },
    "CDNS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.117039",
      "company": {
        "name": "Cadence Design Systems Inc",
        "market_cap": "$84.97B",
        "market_cap_raw": 84973273000.0,
        "last_q_revenue": 1338838000.0,
        "description": "Cadence Design Systems, Inc. (CDNS), based in San Jose, California, is a leading provider of electronic design automation (EDA) software and engineering services that drive advancements in semiconductor innovation. The company offers a wide range of solutions tailored for integrated circuit design, system on chip (SoC) development, and printed circuit board (PCB) design, enabling clients to significantly increase productivity and reduce time-to-market. By leveraging advanced technologies, including artificial intelligence and machine learning, Cadence enhances design processes and performance, positioning itself as an essential partner for organizations navigating the complexities of modern electronic design challenges.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "ASML": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.346500",
      "company": {
        "name": "ASML Holding NV ADR",
        "market_cap": "$422.23B",
        "market_cap_raw": 422234784000.0,
        "last_q_revenue": 7516000000.0,
        "description": "ASML Holding NV is a leading supplier of advanced semiconductor manufacturing equipment, specializing in cutting-edge lithography systems essential for the production of memory and logic chips. Headquartered in Veldhoven, Netherlands, the company is instrumental in the semiconductor supply chain, particularly through its pioneering extreme ultraviolet (EUV) lithography technology that enhances chip performance and efficiency. With a steadfast commitment to innovation and strategic partnerships with major semiconductor manufacturers, ASML is ideally positioned to benefit from the growing demand for high-performance computing solutions and the ongoing digital transformation across various industries.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "ARM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.219744",
      "company": {
        "name": "Arm Holdings plc American Depositary Shares",
        "market_cap": "$119.98B",
        "market_cap_raw": 119977722000.0,
        "last_q_revenue": 1135000000.0,
        "description": "Arm Holdings plc is a leading technology company recognized for its innovative design and licensing of CPU architecture, crucial for semiconductor and OEMs across various electronic devices. With a robust portfolio of advanced designs, Arm enables its partners to create energy-efficient, high-performance processors that are pivotal in accelerating advancements in smartphones, servers, and other electronics. As a key contributor to the semiconductor ecosystem, Arm's intellectual property is vital for progressing technologies such as artificial intelligence, the Internet of Things (IoT), and automotive applications, positioning the company for significant growth amidst increasing global connectivity.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "ANET": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.119433",
      "company": {
        "name": "Arista Networks",
        "market_cap": "$161.93B",
        "market_cap_raw": 161931477000.0,
        "last_q_revenue": 2308300000.0,
        "description": "Arista Networks, headquartered in Santa Clara, California, is a leading provider of software-defined networking (SDN) solutions, renowned for its high-performance, multilayer network switches tailored for large data centers, cloud environments, and high-frequency trading. The company's innovative approach and strong emphasis on technological advancement position it to effectively meet the growing demand for sophisticated networking infrastructure in an increasingly digital world. Arista's dedication to exceptional performance, scalability, and reliability underscores its strategic importance in the networking sector, making it an attractive investment for institutional investors aiming to capitalize on the digital transformation trend.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "META": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.572668",
      "company": {
        "name": "Meta Platforms Inc.",
        "market_cap": "$1.62T",
        "market_cap_raw": 1623799497000.0,
        "last_q_revenue": 51242000000.0,
        "description": "Meta Platforms, Inc. is a leading technology firm based in Menlo Park, California, renowned for transforming social connectivity through its flagship platforms, including Facebook, Instagram, and WhatsApp. Pioneering developments in virtual and augmented reality via its Reality Labs division, Meta is at the forefront of the metaverse, exploring innovative consumer engagement avenues. By significantly investing in immersive technologies, the company not only attracts a large, diverse user base but also enhances its advertising revenue, thereby reinforcing its position as a dominant force in the rapidly evolving digital landscape.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "NVDA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.275033",
      "company": {
        "name": "NVIDIA Corporation",
        "market_cap": "$4.32T",
        "market_cap_raw": 4316597584000.0,
        "last_q_revenue": 57006000000.0,
        "description": "NVIDIA Corporation is a prominent American multinational technology firm based in Santa Clara, California, recognized for its leadership in the design and manufacturing of advanced graphics processing units (GPUs) for gaming and professional markets. The company is at the cutting edge of AI and visual computing technologies, developing critical solutions such as System on a Chip (SoC) products that enhance mobile computing and automotive applications, particularly in the expanding field of autonomous driving. With a diverse portfolio that encompasses gaming, data centers, and AI infrastructure, NVIDIA is committed to delivering innovative products and services that meet the demands of a dynamic technology landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "MSFT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.862288",
      "company": {
        "name": "Microsoft Corporation",
        "market_cap": "$3.66T",
        "market_cap_raw": 3657192178000.0,
        "last_q_revenue": 77673000000.0,
        "description": "Microsoft Corporation is a leading American multinational technology firm, celebrated for its diverse portfolio that encompasses operating systems, productivity software, and hardware solutions. Renowned for its Windows OS and Office suite, Microsoft also maintains a strong footprint in the gaming sector with the Xbox brand and in hardware through its Surface devices. A key player in digital transformation, the company capitalizes on its Azure cloud computing services to boost productivity and foster innovation across various industries. With a solid market position and a steadfast commitment to research and development, Microsoft continues to play a crucial role in advancing the global technology landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "AAPL": {
      "presets": {
        "Revenue": {
          "updated": "Mar 01, 2026 11:39 PM"
        },
        "Costs": {
          "updated": "Mar 01, 2026 11:39 PM"
        },
        "Cash": {
          "updated": "Mar 01, 2026 11:39 PM"
        },
        "FCF": {
          "updated": "Mar 01, 2026 11:39 PM"
        },
        "Assets": {
          "updated": "Mar 01, 2026 11:39 PM"
        },
        "Buffet": {
          "updated": "Mar 01, 2026 11:39 PM"
        }
      },
      "last_updated": "2026-03-01T23:39:59.817560",
      "company": {
        "name": "Apple Inc",
        "market_cap": "$4.06T",
        "market_cap_raw": 4063829426000.0,
        "last_q_revenue": 143756000000.0,
        "description": "Apple Inc. is a preeminent American multinational technology company renowned for its innovative consumer electronics, software, and online services. With a staggering revenue of $274.5 billion in 2020, it stands as the world's most valuable publicly traded company, significantly influencing the global technology sector. Its flagship products—iPhone, iPad, and Mac—continue to define consumer expectations and set industry benchmarks, securing its position as a leader in both the smartphone and personal computer markets. As a key player among the \"Big Five\" technology firms, Apple remains at the forefront of technological advancements and consumer engagement strategies.",
        "sector": "TECHNOLOGY",
        "industry": "CONSUMER ELECTRONICS"
      }
    },
    "RGTI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.222489",
      "company": {
        "name": "Rigetti Computing Inc",
        "market_cap": "$8.44B",
        "market_cap_raw": 8438767000.0,
        "last_q_revenue": 1947000.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "QUBT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.187662",
      "company": {
        "name": "Quantum Computing Inc",
        "market_cap": "$2.57B",
        "market_cap_raw": 2568453000.0,
        "last_q_revenue": 384000.0,
        "description": "Quantum Computing, Inc. is an innovative technology firm based in Leesburg, Virginia, focused on advancing the field of quantum computing through the development of sophisticated software applications and tools. The company aims to facilitate the widespread adoption of quantum technologies across diverse sectors such as finance, pharmaceuticals, and cybersecurity, addressing complex computational challenges with greater efficiency. With a robust commitment to research and development, Quantum Computing, Inc. is strategically positioned to emerge as a leader in delivering practical quantum solutions, thereby unlocking the transformative potential inherent in quantum systems.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "SERV": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.625337",
      "company": {
        "name": "Serve Robotics Inc. Common Stock",
        "market_cap": "$910.19M",
        "market_cap_raw": 910188000.0,
        "last_q_revenue": 686535.0,
        "description": "Serve Robotics Inc. (SERV) is a pioneering technology firm specializing in low-emission delivery robots aimed at transforming food delivery logistics in urban settings across the United States. Headquartered in Redwood City, California, the company leverages cutting-edge automation to deliver efficient and sustainable services, addressing the growing consumer demand for environmentally friendly solutions. With a strategic focus on the intersection of robotics and sustainability, Serve Robotics represents a compelling investment opportunity for institutional investors looking to capitalize on the future of eco-conscious logistics and urban mobility.",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "STLA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.211897",
      "company": {
        "name": "Stellantis NV",
        "market_cap": "$31.92B",
        "market_cap_raw": 31920400000.0,
        "last_q_revenue": 74261000000.0,
        "description": "Stellantis NV, headquartered in Lijnden, Netherlands, is a prominent global automotive manufacturer formed by the merger of Fiat Chrysler Automobiles and PSA Group. The company features a diversified portfolio of well-known brands, offering a range of passenger cars, trucks, SUVs, and light commercial vehicles, while prioritizing innovation and sustainability. Stellantis is proactively advancing its electric and connected vehicle initiatives, aligning with market trends and consumer demands. As the automotive industry faces transformative changes, Stellantis is dedicated to enhancing mobility through advanced technologies and optimizing operational efficiencies, positioning itself for sustainable long-term growth.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "MO": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.685786",
      "company": {
        "name": "Altria Group",
        "market_cap": "$98.59B",
        "market_cap_raw": 98592801000.0,
        "last_q_revenue": 5251000000.0,
        "description": "Altria Group, Inc. is a leading American tobacco company based in Henrico County, Virginia, renowned for its portfolio of iconic brands such as Marlboro, and its significant presence in the smokeless tobacco segment. As a major player in the global tobacco market, Altria is actively pivoting towards reduced-risk alternatives by investing in e-vapor and heated tobacco technologies. The company's robust focus on innovation, regulatory adherence, and sustainable practices positions it advantageously to navigate the evolving tobacco landscape and meet the increasing consumer demand for safer product options. Through these strategic initiatives, Altria aims to redefine its role in the tobacco industry while prioritizing public health and shareholder value.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "TOBACCO"
      }
    },
    "EBAY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.112338",
      "company": {
        "name": "eBay Inc",
        "market_cap": "$43.90B",
        "market_cap_raw": 43903992000.0,
        "last_q_revenue": 2820000000.0,
        "description": "eBay Inc. is a leading American e-commerce platform headquartered in San Jose, California, established in 1995. Renowned for its innovative marketplace, eBay facilitates seamless transactions between consumers and businesses through various selling formats, including auctions and fixed-price listings. With millions of active users worldwide, the platform fosters a vibrant community and prioritizes user experience and security. As eBay adapts to shifting market dynamics and technological advancements, it remains well-positioned for sustained growth in the competitive e-commerce sector, driving value for institutional investors.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "INTERNET RETAIL"
      }
    },
    "ADBE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.389277",
      "company": {
        "name": "Adobe Systems Incorporated",
        "market_cap": "$151.20B",
        "market_cap_raw": 151197598000.0,
        "last_q_revenue": 6194000000.0,
        "description": "Adobe Systems Incorporated is a leading American multinational software company headquartered in San Jose, California, distinguished for its pioneering role in digital media and marketing solutions. Renowned for its flagship products such as Adobe Photoshop, Illustrator, and Acrobat, Adobe serves as an indispensable ally to creative professionals and businesses worldwide. The company has strategically expanded its offerings with Adobe Experience Cloud, which provides a robust suite of tools designed to enhance customer engagement and optimize marketing strategies. Leveraging advancements in artificial intelligence and cloud technology, Adobe is positioned to maintain its competitive edge in a rapidly evolving digital landscape, supported by a substantial and diverse global user base.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "CRM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.401244",
      "company": {
        "name": "Salesforce.com Inc",
        "market_cap": "$247.43B",
        "market_cap_raw": 247434330000.0,
        "last_q_revenue": 10259000000.0,
        "description": "Salesforce.com, Inc. (CRM) is a leading provider of cloud-based Customer Relationship Management (CRM) solutions, headquartered in San Francisco. The company offers a comprehensive suite of enterprise applications designed to enhance customer engagement through customer service, marketing automation, and advanced analytics. Renowned for its innovative integration of artificial intelligence and data analytics, Salesforce stands at the forefront of the cloud computing industry, consistently delivering sustainable growth for its clients. Its strategic acquisitions and continuous platform enhancements reinforce its commanding position in the enterprise software market, positioning Salesforce as an essential partner for organizations pursuing success in the digital era.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "JNJ": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.580309",
      "company": {
        "name": "Johnson & Johnson",
        "market_cap": "$526.82B",
        "market_cap_raw": 526816477000.0,
        "last_q_revenue": 23993000000.0,
        "description": "Johnson & Johnson (JNJ), founded in 1886, is a premier American multinational corporation at the forefront of the global healthcare sector, acclaimed for its diversified product offerings in pharmaceuticals, medical devices, and consumer health products. With an unwavering commitment to innovation and quality, JNJ has established a robust financial profile, highlighted by its AAA credit rating and consistent presence on the Dow Jones Industrial Average. Ranked 36th on the Fortune 500 list, the company is strategically positioned to leverage emerging opportunities in the dynamic healthcare landscape while focusing on sustainable growth and long-term value creation for its stakeholders.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - GENERAL"
      }
    },
    "BE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.750150",
      "company": {
        "name": "Bloom Energy Corp",
        "market_cap": "$31.56B",
        "market_cap_raw": 31564726000.0,
        "last_q_revenue": 519048000.0,
        "description": "Bloom Energy Corporation, based in San Jose, California, is a leader in solid oxide fuel cell technology, providing innovative on-site clean power generation solutions across multiple global markets including the U.S., Japan, China, India, and South Korea. The company plays a crucial role in the transition to sustainable energy, aiming to reduce reliance on fossil fuels and enhance operational efficiencies through its advanced energy systems. With a strong focus on innovation and sustainability, Bloom Energy is well-positioned to capitalize on the rising demand for renewable energy technologies, presenting a compelling investment opportunity for institutional investors committed to energy diversification and environmental responsibility.",
        "sector": "INDUSTRIALS",
        "industry": "ELECTRICAL EQUIPMENT & PARTS"
      }
    },
    "SYM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.422420",
      "company": {
        "name": "Symbotic Inc",
        "market_cap": "$41.30B",
        "market_cap_raw": 41299845000.0,
        "last_q_revenue": 618457000.0,
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "ROK": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.462226",
      "company": {
        "name": "Rockwell Automation Inc",
        "market_cap": "$46.87B",
        "market_cap_raw": 46871146000.0,
        "last_q_revenue": 2316000000.0,
        "description": "Rockwell Automation, Inc. (Ticker: ROK) is a premier global provider of industrial automation and information technology solutions, dedicated to enhancing operational efficiency and productivity across diverse sectors including manufacturing, infrastructure, and logistics. Renowned for its innovative offerings, such as the Allen-Bradley line of programmable automation controllers and FactoryTalk software, the company empowers organizations to harness data for operational excellence. Rockwell's strategic emphasis on the Internet of Things (IoT) and smart manufacturing places it at the vanguard of digital transformation, positioning the company for sustainable growth while delivering significant value to its shareholders.",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "UPST": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.403686",
      "company": {
        "name": "Upstart Holdings Inc",
        "market_cap": "$4.68B",
        "market_cap_raw": 4681425000.0,
        "last_q_revenue": 285899000.0,
        "description": "Upstart Holdings, Inc. is an innovative fintech company based in San Mateo, California, revolutionizing the personal lending industry through its cutting-edge cloud-based artificial intelligence platform. By leveraging sophisticated machine learning algorithms, Upstart significantly optimizes the credit decision-making process, leading to higher loan approval rates, lower consumer borrowing costs, and enhanced risk assessment for lenders. This disruptive model not only redefines traditional lending norms but also establishes Upstart as a frontrunner in the rapidly growing AI-powered financial services sector, adeptly addressing the dynamic requirements of both borrowers and financial institutions.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "ACHR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.256727",
      "company": {
        "name": "Archer Aviation Inc",
        "market_cap": "$6.50B",
        "market_cap_raw": 6504207000.0,
        "last_q_revenue": 0.0,
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "CYBN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.705456",
      "company": {
        "name": "Cybin Inc",
        "market_cap": "$413.12M",
        "market_cap_raw": 413123000.0,
        "last_q_revenue": 0.0,
        "description": "None",
        "sector": "HEALTHCARE",
        "industry": "BIOTECHNOLOGY"
      }
    },
    "MP": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.729160",
      "company": {
        "name": "MP Materials Corp",
        "market_cap": "$12.23B",
        "market_cap_raw": 12225359000.0,
        "last_q_revenue": 53553000.0,
        "description": "MP Materials Corp. is the leading domestic producer of rare earth materials in North America, headquartered in Las Vegas, Nevada. The company plays a critical role in the supply chain for advanced technologies, particularly within the electric vehicle and renewable energy sectors, by providing high-purity rare earth oxides essential for the production of modern electronics and clean energy solutions. With a robust commitment to domestic supply chain enhancement and national security, MP Materials employs proprietary technologies that bolster its competitive advantages. As global demand for sustainable materials intensifies, MP Materials is strategically positioned to benefit from the shift towards a greener economy, making it a key player in the transition to renewable energy and electric mobility.",
        "sector": "BASIC MATERIALS",
        "industry": "OTHER INDUSTRIAL METALS & MINING"
      }
    },
    "AFRM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.530977",
      "company": {
        "name": "Affirm Holdings Inc",
        "market_cap": "$24.68B",
        "market_cap_raw": 24676305000.0,
        "last_q_revenue": 933337000.0,
        "description": "Affirm Holdings, Inc. is a prominent financial technology company headquartered in San Francisco, California, focused on providing innovative point-of-sale financing and buy now, pay later (BNPL) solutions across the U.S. and Canada. By enhancing consumer purchasing power and advocating for responsible spending practices, Affirm facilitates seamless integrations with merchants, thereby optimizing conversion rates and driving sales growth. As e-commerce continues to evolve, Affirm’s differentiated financing solutions are not only transforming consumer payment experiences but are also reinforcing transparency in credit access, cementing its role as a key player in the retail industry's digital transformation.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "AISP": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.696086",
      "company": {
        "name": "Airship AI Holdings Inc",
        "market_cap": "$147.64M",
        "market_cap_raw": 147638000.0,
        "last_q_revenue": 1177450.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "HUBC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.644176",
      "company": {
        "name": "Hub Cyber Security Ltd. Ordinary Shares",
        "market_cap": "$10.18M",
        "market_cap_raw": 10176200.0,
        "last_q_revenue": 15112000.0,
        "description": "Hub Cyber Security Ltd. (HUBC), headquartered in Tel Aviv, is a leading provider of cutting-edge cybersecurity solutions, catering to enterprises, government agencies, and financial institutions worldwide. The company specializes in protecting sensitive data and critical infrastructure, leveraging its innovative technologies and extensive industry experience to navigate the complex and ever-changing cyber threat landscape. HUBC's commitment to enhancing cyber resilience positions it as an indispensable ally for organizations seeking to safeguard their digital assets in an increasingly interconnected world. With its strategic focus and expertise, HUBC is well-positioned to play a pivotal role in the global cybersecurity sector.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "MDB": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.505864",
      "company": {
        "name": "MongoDB",
        "market_cap": "$32.54B",
        "market_cap_raw": 32537170000.0,
        "last_q_revenue": 628309000.0,
        "description": "MongoDB, Inc. is a leading provider of modern, document-oriented database solutions, headquartered in New York, NY. The company’s platform excels in delivering real-time data access, scalability, and flexibility, making it indispensable for organizations facing the demands of the digital landscape. As cloud adoption continues to rise and the need for sophisticated data management solutions grows, MongoDB is strategically positioned to capitalize on significant market opportunities. Its commitment to innovation and its comprehensive suite of technology offerings enhance its appeal as a critical investment for institutional investors focused on the future of information management.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "STX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.294259",
      "company": {
        "name": "Seagate Technology PLC",
        "market_cap": "$71.09B",
        "market_cap_raw": 71087071000.0,
        "last_q_revenue": 2629000000.0,
        "description": "Seagate Technology PLC, headquartered in Ireland, stands as a premier global leader in data storage solutions, focusing on both hard disk drives (HDDs) and cutting-edge flash storage technologies. With a strategic foothold in rapidly expanding markets such as cloud computing, big data, and the Internet of Things (IoT), Seagate is well-positioned to meet the surging demand for data storage. The company emphasizes sustainability and innovation through ongoing research and development, complemented by strategic alliances that enhance its competitive edge. For institutional investors, Seagate presents a notable opportunity to engage with the burgeoning data economy, bolstered by its solid market positioning and a comprehensive portfolio of advanced storage solutions.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "QBTS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.122945",
      "company": {
        "name": "D-Wave Quantum Inc.",
        "market_cap": "$10.44B",
        "market_cap_raw": 10440635000.0,
        "last_q_revenue": 3739000.0,
        "description": "D-Wave Quantum Inc. is a trailblazer in the quantum computing landscape, dedicated to delivering advanced quantum systems, software, and robust support services tailored to solve intricate computational problems. Based in Burnaby, Canada, the company is committed to fostering the integration of quantum technology across diverse industries, including optimization, machine learning, and artificial intelligence. With a unique strategic vision and a diverse array of innovative solutions, D-Wave is well-positioned to reshape the future of computing, driving transformative advancements while setting new benchmarks for the industry through its state-of-the-art quantum technologies.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "TEM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.535108",
      "company": {
        "name": "Tempus AI, Inc. Class A Common Stock",
        "market_cap": "$12.51B",
        "market_cap_raw": 12512218000.0,
        "last_q_revenue": 334206000.0,
        "description": "Tempus AI, Inc. (Ticker: TEM) is a pioneering healthcare technology firm headquartered in Chicago, Illinois, committed to enhancing medical decision-making through the integration of artificial intelligence and advanced data analytics. By combining genomic sequencing with extensive clinical data, Tempus is at the forefront of precision medicine, particularly in oncology, ultimately aiming to improve patient outcomes significantly. With the healthcare industry increasingly embracing technology-driven solutions, Tempus's innovative platform and strategic focus on transforming healthcare practices make it an attractive investment opportunity for institutional investors seeking to leverage growth in this dynamic sector.",
        "sector": "HEALTHCARE",
        "industry": "HEALTH INFORMATION SERVICES"
      }
    },
    "HYMC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.794646",
      "company": {
        "name": "Hycroft Mining Holding Corporation",
        "market_cap": "$2.88B",
        "market_cap_raw": 2875169000.0,
        "last_q_revenue": 0.0,
        "description": "Hycroft Mining Holding Corporation is a growing gold and silver producer headquartered in Denver, Colorado, primarily focused on its flagship Hycroft Mine located in Nevada. This strategically positioned asset is underpinned by substantial mineral resources and is poised to capitalize on the increasing global demand for precious metals. Committed to sustainable mining practices and operational efficiency, Hycroft aims to enhance its exploration and production capabilities, thereby delivering long-term value to shareholders while contributing positively to the mining sector.",
        "sector": "BASIC MATERIALS",
        "industry": "GOLD"
      }
    },
    "ZM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:25.160208",
      "company": {
        "name": "Zoom Video Communications Inc",
        "market_cap": "$24.34B",
        "market_cap_raw": 24338213000.0,
        "last_q_revenue": 1229835000.0,
        "description": "Zoom Video Communications, Inc. (ZM), headquartered in San Jose, California, is a prominent provider of advanced video communication solutions that cater to a diverse global clientele. Particularly renowned for its user-friendly platform that facilitates video conferencing, webinars, and collaborative tools, Zoom has solidified its position in the market during the accelerated shift towards remote work and digital collaboration. With a strong commitment to innovation and reliability, the company is well-positioned to capitalize on the increasing demand for seamless communication technologies, addressing the evolving needs of organizations across North America, Europe, and Asia Pacific. As enterprises prioritize efficient, scalable communication solutions, Zoom's expertise and strategic focus are set to drive continued growth and market leadership.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "ALH-SEC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.750718",
      "company": {
        "name": "ALLIANCE LAUNDRY HOLDINGS INC.",
        "market_cap": "N/A",
        "market_cap_raw": null,
        "last_q_revenue": 437606000.0,
        "description": "Financial data from SEC EDGAR for ALLIANCE LAUNDRY HOLDINGS INC.",
        "sector": "",
        "industry": ""
      }
    },
    "SRFM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.110397",
      "company": {
        "name": "Surf Air Mobility Inc.",
        "market_cap": "$164.38M",
        "market_cap_raw": 164381000.0,
        "last_q_revenue": 29172000.0,
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "AIRLINES"
      }
    },
    "BKE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.825358",
      "company": {
        "name": "Buckle Inc",
        "market_cap": "$2.70B",
        "market_cap_raw": 2703116000.0,
        "last_q_revenue": 320837000.0,
        "description": "Buckle, Inc. (BKE) is a leading specialty retailer in the U.S. focused on casual apparel, footwear, and accessories for the young adult demographic. Headquartered in Kearney, Nebraska, the company operates an extensive network of stores that enhance the shopping experience through a curated selection of both recognized brands and its own proprietary labels. Buckle's dedication to high-quality products and exceptional customer service cultivates strong brand loyalty, positioning the company for continued growth in a competitive retail environment as consumer preferences evolve.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "APPAREL RETAIL"
      }
    },
    "BBAI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.585706",
      "company": {
        "name": "BigBearai Holdings Inc",
        "market_cap": "$2.63B",
        "market_cap_raw": 2628038000.0,
        "last_q_revenue": 33143000.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "MARA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.375248",
      "company": {
        "name": "Marathon Digital Holdings Inc",
        "market_cap": "$4.47B",
        "market_cap_raw": 4466357000.0,
        "last_q_revenue": 252410000.0,
        "description": "Marathon Digital Holdings, Inc. is a leading cryptocurrency mining company headquartered in Las Vegas, Nevada, that plays a critical role in the blockchain ecosystem. Leveraging cutting-edge technology and operational efficiency, Marathon seeks to maximize its mining output while effectively managing costs in the volatile cryptocurrency market. The company's focus on strategic partnerships and sustainable practices positions it well to capitalize on the burgeoning demand for digital assets and decentralized finance solutions, solidifying its status as a pivotal player in the industry.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "AMD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.970880",
      "company": {
        "name": "Advanced Micro Devices Inc",
        "market_cap": "$354.15B",
        "market_cap_raw": 354147893000.0,
        "last_q_revenue": 9246000000.0,
        "description": "Advanced Micro Devices, Inc. (AMD) is a prominent American semiconductor company based in Santa Clara, California, renowned for its innovative microprocessors, graphics processors, and motherboard chipsets. Catering to diverse markets, including data centers, enterprise solutions, and consumer electronics, AMD's commitment to high-performance computing has positioned it as a significant force in the rapidly evolving semiconductor industry. The company's strategic focus on advancing technology to meet the dynamic needs of both businesses and consumers underscores its potential for continued growth and leadership in the sector.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "IREN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.236043",
      "company": {
        "name": "IREN Ltd",
        "market_cap": "$17.19B",
        "market_cap_raw": 17191971000.0,
        "last_q_revenue": 240295000.0,
        "description": "None",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "NBIS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.045767",
      "company": {
        "name": "Nebius Group N.V.",
        "market_cap": "$22.06B",
        "market_cap_raw": 22055793000.0,
        "last_q_revenue": 146100000.0,
        "description": "None",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "KTOS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.911919",
      "company": {
        "name": "Kratos Defense & Security Solutions",
        "market_cap": "$20.21B",
        "market_cap_raw": 20213608000.0,
        "last_q_revenue": 347600000.0,
        "description": "Kratos Defense & Security Solutions, Inc. (KTOS) is a leading defense contractor headquartered in San Diego, California, focused on cutting-edge technologies that enhance national security. Specializing in unmanned systems, satellite communications, and cybersecurity, Kratos plays a vital role in supporting the U.S. Department of Defense and various government agencies. Committed to innovation and operational excellence, the company actively seeks strategic partnerships and invests significantly in research and development, situating itself at the forefront of military technological advancements to meet evolving defense challenges.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "BRK-B": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.906467",
      "company": {
        "name": "Berkshire Hathaway Inc",
        "market_cap": "$1.02T",
        "market_cap_raw": 1021476405000.0,
        "last_q_revenue": 94972000000.0,
        "description": "Berkshire Hathaway Inc. is a leading multinational conglomerate holding company headquartered in Omaha, Nebraska, celebrated for its diverse investment portfolio and strong financial performance. With wholly owned subsidiaries like GEICO, Dairy Queen, and BNSF Railway, and substantial equity stakes in industry heavyweights such as Apple, Bank of America, and Coca-Cola, the company is well-positioned for continued success. Under the pragmatic leadership of Warren Buffett, Berkshire Hathaway has adopted a disciplined acquisition strategy that emphasizes long-term value creation, attracting institutional investors seeking stability and dependable returns in fluctuating markets. This strategic focus and diversified business model make Berkshire Hathaway an attractive investment opportunity.",
        "sector": "FINANCIAL SERVICES",
        "industry": "INSURANCE - DIVERSIFIED"
      }
    },
    "TZOO": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.173950",
      "company": {
        "name": "Travelzoo",
        "market_cap": "$65.01M",
        "market_cap_raw": 65007000.0,
        "last_q_revenue": 22199000.0,
        "description": "Travelzoo (Ticker: TZOO) is a prominent Internet media company headquartered in New York City, focused on aggregating premium travel, entertainment, and local deals from top providers worldwide, including Asia Pacific, Europe, and North America. With a robust subscriber base exceeding 30 million, Travelzoo utilizes advanced technology to enhance user experiences while driving substantial traffic and revenue to its partners. The company's strong brand reputation, commitment to high-quality content, and strategic positioning enable it to leverage the increasing demand for personalized and digital travel solutions in a dynamic marketplace.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "GAMB": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.500190",
      "company": {
        "name": "Gambling.com Group Ltd",
        "market_cap": "$169.99M",
        "market_cap_raw": 169992000.0,
        "last_q_revenue": 38982000.0,
        "description": "None",
        "sector": "CONSUMER CYCLICAL",
        "industry": "GAMBLING"
      }
    },
    "SIGA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.688673",
      "company": {
        "name": "SIGA Technologies Inc",
        "market_cap": "$479.80M",
        "market_cap_raw": 479796000.0,
        "last_q_revenue": 2620000.0,
        "description": "SIGA Technologies Inc. is a prominent biopharmaceutical company headquartered in New York, dedicated to the development and commercialization of innovative therapies for infectious diseases. The company's leading product, TPOXX, is an antiviral medication sanctioned for smallpox, underscoring SIGA's pivotal role in biodefense and public health. By fostering strategic partnerships with government agencies and focusing on both current and emerging health threats, SIGA is well-positioned to enhance public health response capabilities and address significant biothreats, ultimately contributing to global health security.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "STEX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.145030",
      "company": {
        "name": "Streamex Corp",
        "market_cap": "N/A",
        "market_cap_raw": null,
        "last_q_revenue": 0.0,
        "description": "Streamex Corp., headquartered in Winter Park, Florida, is an innovative technology firm focused on revolutionizing digital streaming solutions that enhance content delivery and user experience. The company is committed to advanced software development, aiming to transform how digital content is consumed and monetized in the rapidly evolving digital entertainment sector. With a strategic focus on scalability and high performance, Streamex is well-positioned for significant growth and is poised to become a key player in the digital landscape, empowering businesses and engaging consumers through its cutting-edge technology.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "WSM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:25.054465",
      "company": {
        "name": "Williams-Sonoma Inc",
        "market_cap": "$24.43B",
        "market_cap_raw": 24431262000.0,
        "last_q_revenue": 1882814000.0,
        "description": "Williams-Sonoma, Inc. is a premier omnichannel specialty retailer based in San Francisco, celebrated for its exceptional home goods and decor offerings, which encompass kitchenware and stylish furnishings. The company's diverse brand portfolio includes well-known names like Williams Sonoma, Pottery Barn, and West Elm, allowing it to appeal to a broad range of consumer preferences. With a strong emphasis on innovative design and sustainability, Williams-Sonoma has successfully integrated its extensive brick-and-mortar presence with a highly functional e-commerce platform, fostering enhanced customer engagement. Positioned as a key player in the home goods market, the company is strategically equipped to capitalize on evolving consumer trends, ensuring a sustained competitive edge in the industry.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "SPECIALTY RETAIL"
      }
    },
    "KHC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.665365",
      "company": {
        "name": "Kraft Heinz Co",
        "market_cap": "$28.10B",
        "market_cap_raw": 28099983000.0,
        "last_q_revenue": 6237000000.0,
        "description": "The Kraft Heinz Company (KHC) is a powerhouse in the global food and beverage industry, formed through the landmark merger of Kraft Foods and Heinz. With its dual headquarters in Chicago and Pittsburgh, KHC offers a robust portfolio of well-known brands, including Kraft, Heinz, Oscar Mayer, and Philadelphia, which resonate strongly with consumers. The company is dedicated to innovation and sustainability, aiming to adapt to evolving consumer preferences while fostering operational excellence. Kraft Heinz's strategic positioning and ability to capitalize on emerging market trends underscore its potential for sustainable growth and the creation of long-term shareholder value.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "PACKAGED FOODS"
      }
    },
    "HLT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.330861",
      "company": {
        "name": "Hilton Worldwide Holdings Inc",
        "market_cap": "$70.21B",
        "market_cap_raw": 70207693000.0,
        "last_q_revenue": 3120000000.0,
        "description": "Hilton Worldwide Holdings Inc. is a leading global hospitality company renowned for its diverse portfolio of prestigious brands, including Hilton, DoubleTree, and Waldorf Astoria, which cater to a wide range of market segments. With a commitment to delivering exceptional customer experiences and operational excellence, Hilton is strategically positioned for growth through global expansion and innovation. The company’s strong loyalty program and significant presence in key travel markets enhance its competitive edge, making it an attractive investment opportunity for institutional investors looking to capitalize on the recovery and growth potential within the dynamic tourism and travel industries.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "LODGING"
      }
    },
    "BBY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.653937",
      "company": {
        "name": "Best Buy Co. Inc",
        "market_cap": "$13.68B",
        "market_cap_raw": 13677592000.0,
        "last_q_revenue": 9672000000.0,
        "description": "Best Buy Co., Inc. (BBY) is a premier American retailer headquartered in Richfield, Minnesota, specializing in consumer electronics, appliances, and technology services. The company employs a dual-channel strategy that effectively integrates its vast network of physical locations with a robust e-commerce platform, enabling it to adapt to the changing preferences of consumers. Best Buy's dedication to sustainability, coupled with its consistent financial performance and strategic investments in digital innovation, make it an attractive prospect for institutional investors looking for growth opportunities within the technology retail space.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "SPECIALTY RETAIL"
      }
    },
    "COLL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.327213",
      "company": {
        "name": "Collegium Pharmaceutical Inc",
        "market_cap": "$1.45B",
        "market_cap_raw": 1451576000.0,
        "last_q_revenue": 209361000.0,
        "description": "Collegium Pharmaceutical, Inc. is a specialized pharmaceutical firm based in Stoughton, Massachusetts, focused on developing and commercializing innovative pain management solutions. The company offers proprietary drug formulations aimed at effectively addressing a spectrum of pain-related conditions, reflecting its dedication to improving patient outcomes and overall quality of care. With a strategic emphasis on advancing specialty pharmaceuticals, Collegium is well-positioned for sustained growth, presenting an attractive investment opportunity for institutional investors seeking exposure to a leader in the healthcare sector dedicated to pain management innovations.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "SOAR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.925767",
      "company": {
        "name": "Volato Group Inc.",
        "market_cap": "$10.42M",
        "market_cap_raw": 10418200.0,
        "last_q_revenue": 381000.0,
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "AIRPORTS & AIR SERVICES"
      }
    },
    "PYPL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.074984",
      "company": {
        "name": "PayPal Holdings Inc",
        "market_cap": "$49.99B",
        "market_cap_raw": 49994957000.0,
        "last_q_revenue": 8417000000.0,
        "description": "PayPal Holdings, Inc. is a leading global technology platform transforming digital and mobile payment solutions for both consumers and merchants. Recognized for its robust security measures and innovative approach, PayPal offers a comprehensive suite of services, from peer-to-peer transfers to advanced e-commerce payment processing. With a substantial and expanding user base, the company is strategically positioned to leverage the increasing demand for fintech innovations, while continuously enhancing its products and maintaining a strong focus on customer security. This solidifies PayPal's pivotal role in the ever-evolving financial technology landscape.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "ONCY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.388355",
      "company": {
        "name": "Oncolytics Biotech Inc",
        "market_cap": "$104.19M",
        "market_cap_raw": 104195000.0,
        "last_q_revenue": 0.0,
        "description": "Oncolytics Biotech Inc. (ONCY) is a clinical-stage biopharmaceutical company headquartered in Calgary, focusing on the development of advanced oncolytic virus therapies for cancer treatment. Its flagship product, pelareorep, works by selectively targeting cancer cells and enhancing the immune system's response, positioning it as a potential game-changer in oncologic care. The company boasts a strong pipeline supported by active clinical trials, showcasing its commitment to innovation and improved patient outcomes. With significant research capabilities and strategic partnerships, Oncolytics Biotech is well-positioned to capitalize on opportunities within the dynamic oncology landscape.",
        "sector": "HEALTHCARE",
        "industry": "BIOTECHNOLOGY"
      }
    },
    "GOOGL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.760908",
      "company": {
        "name": "Alphabet Inc Class A",
        "market_cap": "$4.16T",
        "market_cap_raw": 4162815263000.0,
        "last_q_revenue": 102346000000.0,
        "description": "Alphabet Inc. (GOOGL), headquartered in Mountain View, California, is a leading multinational conglomerate and the parent company of Google and its diverse subsidiaries. Founded in October 2015 by technology pioneers Larry Page and Sergey Brin, Alphabet stands at the forefront of innovation in sectors such as online advertising, cloud computing, consumer electronics, and artificial intelligence. The company's robust operational portfolio and commitment to technological advancement position it as a key player in the digital economy, offering substantial growth prospects and value creation opportunities for institutional investors.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "TEAM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.485309",
      "company": {
        "name": "Atlassian Corp Plc",
        "market_cap": "$27.64B",
        "market_cap_raw": 27639292000.0,
        "last_q_revenue": 1432553000.0,
        "description": "Atlassian Corporation Plc is a premier provider of collaboration and productivity software, known for its flagship products, including Jira, Confluence, and Trello, which enhance project management and team collaboration across various sectors. Headquartered in Sydney, Australia, Atlassian is a key player in the technology industry, focusing on enabling teams to streamline organization and communication through its agile software solutions. With a robust commitment to innovation and a strategic emphasis on software developers and project managers, the company is well-positioned to leverage ongoing digital transformation trends, ensuring sustained growth and a substantial footprint in the enterprise software market.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "DOCU": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.031330",
      "company": {
        "name": "DocuSign Inc",
        "market_cap": "$9.23B",
        "market_cap_raw": 9226565000.0,
        "last_q_revenue": 818350000.0,
        "description": "DocuSign, Inc. is a leading provider of e-signature and digital transaction management solutions, empowering organizations to manage agreements securely and efficiently. Headquartered in San Francisco, the company leverages its comprehensive cloud-based platform to enhance productivity and streamline workflows across various sectors, from finance to healthcare. With a robust commitment to innovation, DocuSign actively develops advanced features, including workflow automation and compliance tools, positioning itself as a crucial partner in the digital transformation initiatives of enterprises worldwide.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "ACI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.306441",
      "company": {
        "name": "Albertsons Companies",
        "market_cap": "$9.76B",
        "market_cap_raw": 9755701000.0,
        "last_q_revenue": 19123700000.0,
        "description": "Albertsons Companies, Inc. (ACI) is a prominent grocery retailer in the United States, operating an extensive portfolio of supermarkets and pharmacies that cater to a diverse customer base through well-known local brands. With a strong focus on quality, customer service, and innovation, the company is actively enhancing its supply chain efficiencies and expanding its e-commerce capabilities to meet the demands of a rapidly changing retail environment. Committed to sustainability and adapting to evolving consumer preferences, Albertsons is strategically positioned to drive growth and maintain a resilient presence in the competitive grocery market.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "GROCERY STORES"
      }
    },
    "KVUE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.953771",
      "company": {
        "name": "Kenvue Inc.",
        "market_cap": "$34.62B",
        "market_cap_raw": 34621837000.0,
        "last_q_revenue": 3764000000.0,
        "description": "Kenvue Inc. is a leading player in the consumer health industry, providing a diverse range of over-the-counter medications and personal care products that promote well-being. Renowned for its portfolio of trusted brands, the company emphasizes innovation and sustainability to meet the evolving needs of health-conscious consumers. Leveraging its extensive global presence and deep market insights, Kenvue is strategically positioned to capitalize on emerging health trends, presenting a compelling investment opportunity for institutional investors seeking exposure in the dynamic healthcare sector.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "HOUSEHOLD & PERSONAL PRODUCTS"
      }
    },
    "RIG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.295147",
      "company": {
        "name": "Transocean Ltd",
        "market_cap": "$5.44B",
        "market_cap_raw": 5441119000.0,
        "last_q_revenue": 1028000000.0,
        "description": "Transocean Ltd. (RIG) is a leading provider of offshore contract drilling services, renowned for its cutting-edge fleet and commitment to safety and efficiency in the oil and gas industry. Headquartered in Steinhausen, Switzerland, the company operates strategically across key oil-producing regions worldwide, serving a wide range of clients, including major international oil corporations. With a strong focus on innovation and sustainability, Transocean is well-positioned to adapt to the evolving energy landscape, delivering exceptional value to its stakeholders while reinforcing its leadership in offshore drilling.",
        "sector": "ENERGY",
        "industry": "OIL & GAS DRILLING"
      }
    },
    "JILL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.504152",
      "company": {
        "name": "J.Jill Inc",
        "market_cap": "$255.83M",
        "market_cap_raw": 255826000.0,
        "last_q_revenue": 150528000.0,
        "description": "J.Jill, Inc. is a leading omnichannel retailer based in Quincy, Massachusetts, dedicated to providing stylish and comfortable women's apparel. By combining a well-established network of physical stores with a dynamic e-commerce platform, the company effectively meets the diverse needs of the modern woman. Renowned for its commitment to quality craftsmanship and exceptional customer service, J.Jill is strategically positioned for sustainable growth in the competitive womenswear market. With a keen focus on enhancing brand reputation and adapting to shifting consumer preferences, J.Jill aims to solidify its presence and drive long-term success in the fashion industry.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "APPAREL RETAIL"
      }
    },
    "AMCX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.891192",
      "company": {
        "name": "AMC Networks Inc",
        "market_cap": "$332.11M",
        "market_cap_raw": 332109000.0,
        "last_q_revenue": 561741000.0,
        "description": "AMC Networks Inc. is a leading entertainment company known for its production and distribution of critically acclaimed original programming on prominent television networks including AMC, BBC America, IFC, and SundanceTV. Based in New York, the company seamlessly integrates traditional and digital platforms to engage a diverse global audience, demonstrating its commitment to high-quality storytelling and innovation. With a strategic focus on adapting to the dynamic media landscape, AMC Networks is well-positioned to capture growth opportunities, making it an attractive investment for institutional investors looking to gain exposure in the evolving entertainment sector.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "ENTERTAINMENT"
      }
    },
    "FMST": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.454550",
      "company": {
        "name": "Foremost Lithium Resource & Technology Ltd. Common stock aka Foremost Clean Energy",
        "market_cap": "$31.63M",
        "market_cap_raw": 31632600.0,
        "last_q_revenue": 0.0,
        "description": "Foremost Clean Energy, an exploration stage company, explores and develops uranium and lithium assets in North America. It has an option agreement of approximately 70% interest in 10 properties encompassing over 330,000 acres in Saskatchewan's Athabasca Basin. The company also has an exploration permit for the Turkey Lake Uranium Project situated along the eastern edge of the Athabasca Basin. The company was formerly known as Foremost Lithium Resource & Technology Ltd. and changed its name to Foremost Clean Energy Ltd. in September 2024. Foremost Clean Energy Ltd. was incorporated in 2005 and is headquartered in Vancouver, Canada.",
        "sector": "BASIC MATERIALS",
        "industry": "OTHER INDUSTRIAL METALS & MINING"
      }
    },
    "GRVY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.843791",
      "company": {
        "name": "Gravity Co Ltd",
        "market_cap": "$494.48M",
        "market_cap_raw": 494484000.0,
        "last_q_revenue": 138894000000.0,
        "description": "Gravity Co., Ltd. is a leading developer and publisher of online games, renowned for its innovative flagship titles and dedication to providing engaging gameplay experiences. Headquartered in Seoul, South Korea, the company has established a strong foothold in key Asian markets such as Taiwan, Thailand, and the Philippines, while actively pursuing international expansion opportunities. With a diversified portfolio that encompasses both mobile and PC gaming, Gravity is strategically positioned to leverage the growing global demand for interactive entertainment, presenting a compelling investment opportunity for institutional investors looking to engage with the dynamic and expanding gaming industry.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "ELECTRONIC GAMING & MULTIMEDIA"
      }
    },
    "ISRG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.362643",
      "company": {
        "name": "Intuitive Surgical Inc",
        "market_cap": "$173.36B",
        "market_cap_raw": 173356827000.0,
        "last_q_revenue": 2866200000.0,
        "description": "Intuitive Surgical, Inc. is a premier American medical technology firm, recognized for pioneering robotic-assisted surgical systems, notably the da Vinci Surgical System. The company is dedicated to enhancing patient outcomes through the innovation of minimally invasive surgical technologies, complemented by a diverse range of instruments and extensive training initiatives for healthcare practitioners. Boasting a strong pipeline of technological advancements, Intuitive Surgical is strategically positioned to leverage growth opportunities in the rapidly evolving robotic surgery sector, promoting improved surgical precision and expedited patient recovery.",
        "sector": "HEALTHCARE",
        "industry": "MEDICAL INSTRUMENTS & SUPPLIES"
      }
    },
    "FCX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.390963",
      "company": {
        "name": "Freeport-McMoran Copper & Gold Inc",
        "market_cap": "$87.12B",
        "market_cap_raw": 87117906000.0,
        "last_q_revenue": 5633000000.0,
        "description": "Freeport-McMoRan Copper & Gold Inc. (FCX) is a premier mining company headquartered in Phoenix, Arizona, with extensive operations spanning the Americas and Indonesia. A significant player in the global copper and gold markets, FCX is well-positioned to capitalize on the surging demand for copper, particularly as it underpins key green technologies and infrastructural advancements. The company's commitment to sustainable mining practices, combined with its robust operational capabilities, ensures resilience amid market fluctuations. With a strong balance sheet and a focus on operational excellence, Freeport-McMoRan represents a compelling investment opportunity for institutional investors seeking exposure to essential commodities critical for future economic growth.",
        "sector": "BASIC MATERIALS",
        "industry": "COPPER"
      }
    },
    "MNDY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.627061",
      "company": {
        "name": "Monday.Com Ltd",
        "market_cap": "$4.00B",
        "market_cap_raw": 4001940000.0,
        "last_q_revenue": 316855000.0,
        "description": "monday.com Ltd. is a leading software company headquartered in Tel Aviv-Yafo, Israel, specializing in a versatile work operating system that promotes collaboration and productivity across various industries. With a strong international presence, including offices in major cities such as New York and London, the company offers customizable workflows that empower organizations to optimize project management and enhance operational efficiency. Committed to continuous innovation and customer satisfaction, monday.com is strategically positioned to capitalize on the robust growth opportunities within the burgeoning collaborative software market.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "WDAY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.813944",
      "company": {
        "name": "Workday Inc",
        "market_cap": "$41.27B",
        "market_cap_raw": 41267519000.0,
        "last_q_revenue": 2432000000.0,
        "description": "Workday, Inc. is a premier provider of cloud-based enterprise applications, specializing in finance and human resources management. Headquartered in Pleasanton, California, the company utilizes advanced, data-driven solutions to enhance organizational effectiveness and maximize workforce productivity. With a strong commitment to innovation and superior customer service, Workday has established itself as a leader in the enterprise software sector, making it an attractive investment opportunity for institutional investors aiming to benefit from the increasing demand for scalable cloud solutions.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "UFG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.287407",
      "company": {
        "name": "Uni-Fuels Holdings Limited Class A Ordinary Shares",
        "market_cap": "$41.17M",
        "market_cap_raw": 41167000.0,
        "last_q_revenue": 86586677.0,
        "description": "Uni-Fuels Holdings Limited (UFG) is a leading player in the marine fuels sector, specializing in the marketing, reselling, and brokerage of marine fuel products, with a strong emphasis on high-traffic ports such as Singapore. Leveraging its extensive industry expertise and operational efficiency, UFG provides tailored fuel solutions that cater to the diverse requirements of maritime customers. The company's commitment to operational excellence and ethical practices significantly bolsters its standing in the market while driving sustainable growth and optimizing shareholder value in a competitive environment.",
        "sector": "INDUSTRIALS",
        "industry": "MARINE SHIPPING"
      }
    },
    "RKLB": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.384804",
      "company": {
        "name": "Rocket Lab USA Inc.",
        "market_cap": "$38.48B",
        "market_cap_raw": 38475280000.0,
        "last_q_revenue": 155080000.0,
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "JBL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.444222",
      "company": {
        "name": "Jabil Circuit Inc",
        "market_cap": "$27.66B",
        "market_cap_raw": 27659667000.0,
        "last_q_revenue": 8305000000.0,
        "description": "Jabil Inc. provides global manufacturing solutions and services. The company is headquartered in Saint Petersburg, Florida.",
        "sector": "TECHNOLOGY",
        "industry": "ELECTRONIC COMPONENTS"
      }
    },
    "IRWD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.294807",
      "company": {
        "name": "Ironwood Pharmaceuticals Inc",
        "market_cap": "$746.70M",
        "market_cap_raw": 746695000.0,
        "last_q_revenue": 122060000.0,
        "description": "Ironwood Pharmaceuticals, Inc., a healthcare company, focuses on the development and commercialization of gastrointestinal (GI) products. The company is headquartered in Boston, Massachusetts.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "CCSI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.038589",
      "company": {
        "name": "Consensus Cloud Solutions Inc",
        "market_cap": "$460.70M",
        "market_cap_raw": 460700000.0,
        "last_q_revenue": 87767000.0,
        "description": "Consensus Cloud Solutions, Inc. provides information delivery services with a worldwide software-as-a-service platform. The company is headquartered in Los Angeles, California.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "KSCP": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.820313",
      "company": {
        "name": "Knightscope Inc",
        "market_cap": "$40.97M",
        "market_cap_raw": 40971500.0,
        "last_q_revenue": 3131000.0,
        "description": "Knightscope, Inc. designs, develops, builds, deploys and supports physical security technologies in the United States. The company is headquartered in Mountain View, California.",
        "sector": "INDUSTRIALS",
        "industry": "SECURITY & PROTECTION SERVICES"
      }
    },
    "WDC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.892909",
      "company": {
        "name": "Western Digital Corporation",
        "market_cap": "$93.59B",
        "market_cap_raw": 93591511000.0,
        "last_q_revenue": 3017000000.0,
        "description": "Western Digital Corporation (WDC, commonly known as Western Digital or WD) is an American computer hard disk drive manufacturer and data storage company, headquartered in San Jose, California. It designs, manufactures and sells data technology products, including storage devices, data center systems and cloud storage services.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "SNDK": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.846081",
      "company": {
        "name": "Sandisk Corp",
        "market_cap": "$88.44B",
        "market_cap_raw": 88442962000.0,
        "last_q_revenue": 3025000000.0,
        "description": "Sandisk Corporation (Ticker: SNDK) is a U.S.-based technology company that develops, manufactures, and sells data storage products and solutions built on NAND flash memory technology, including solid-state drives (SSDs), embedded storage, memory cards, and USB flash drives for consumer, enterprise, and cloud computing markets.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "TER": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.606761",
      "company": {
        "name": "Teradyne Inc",
        "market_cap": "$32.45B",
        "market_cap_raw": 32452592000.0,
        "last_q_revenue": 769210000.0,
        "description": "Teradyne, Inc. is a prominent American provider of automated test equipment (ATE) and connectivity solutions, based in North Reading, Massachusetts. The company focuses on delivering innovative testing solutions for key sectors including semiconductor, electronics, and automotive industries, thereby ensuring the performance and reliability of a diverse range of electronic devices. With a robust emphasis on technological advancement and quality assurance, Teradyne has established itself as a leader in the global testing solutions market, catering to a growing demand for sophisticated and reliable electronic testing systems. Its strong commitment to customer satisfaction and ongoing innovation underpins its competitive advantage in a rapidly changing technological landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "RIVN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.343584",
      "company": {
        "name": "Rivian Automotive Inc",
        "market_cap": "$23.94B",
        "market_cap_raw": 23942083000.0,
        "last_q_revenue": 1558000000.0,
        "description": "None",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "HD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.138747",
      "company": {
        "name": "The Home Depot Inc",
        "market_cap": "$343.42B",
        "market_cap_raw": 343421583000.0,
        "last_q_revenue": 41352000000.0,
        "description": "The Home Depot, Inc. (HD) stands as the premier home improvement retailer in the U.S., operating over 2,200 stores across North America. Based in Cobb County, Georgia, the company caters to a varied clientele, from professional contractors to DIY enthusiasts, offering an extensive selection of tools, construction products, and services. With a commitment to operational excellence, Home Depot leverages its strong supply chain and rapidly growing e-commerce platform to enhance customer accessibility and engagement. The company prioritizes innovation and exceptional customer service, positioning itself for sustainable growth while aiming to deliver long-term value to its shareholders.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "HOME IMPROVEMENT RETAIL"
      }
    },
    "AI": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.654938",
      "company": {
        "name": "C3 Ai Inc",
        "market_cap": "$2.03B",
        "market_cap_raw": 2032477000.0,
        "last_q_revenue": 75147000.0,
        "description": "C3.ai, Inc. (ticker: AI) stands at the forefront of the artificial intelligence sector, offering cutting-edge software solutions designed to facilitate digital transformation across various industries, including energy, manufacturing, and finance. The company's robust AI platform supports the creation and management of large-scale applications, harnessing advanced machine learning models to optimize efficiency and improve decision-making. C3.ai's innovative tools for predictive maintenance and data analytics are tailored to meet the growing demand for AI technologies, positioning the company as a key player in the enterprise landscape. With a focus on scalability and performance, C3.ai is poised to address the dynamic needs of organizations navigating an increasingly digital environment.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "AVAV": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.469066",
      "company": {
        "name": "AeroVironment Inc",
        "market_cap": "$18.17B",
        "market_cap_raw": 18168332000.0,
        "last_q_revenue": 472508000.0,
        "description": "AeroVironment Inc. is a leading innovator in unmanned aircraft systems (UAS) and related technologies, primarily serving government agencies, defense contractors, and commercial sectors. Headquartered in Arlington, Virginia, the company excels in designing and developing a diverse array of aerial and ground-based robotic systems that significantly improve data gathering and situational awareness across various applications. With a strong emphasis on research and development, AeroVironment is well-positioned to capitalize on the growing need for advanced surveillance and reconnaissance solutions in an increasingly complex security landscape.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "BRO": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:15.988503",
      "company": {
        "name": "Brown & Brown Inc",
        "market_cap": "$27.44B",
        "market_cap_raw": 27439991000.0,
        "last_q_revenue": 1606000000.0,
        "description": "Brown & Brown, Inc. is a prominent insurance brokerage firm headquartered in Daytona Beach, Florida, providing a wide array of insurance products and services across domestic and international markets, including Bermuda, Canada, and the UK. Leveraging a robust network of independent agents, the company prioritizes innovation to deliver tailored insurance solutions that address diverse client needs in a dynamic market landscape. With a strategic emphasis on growth through acquisitions and a track record of strong operational performance, Brown & Brown is well-positioned to maintain its leadership role and capitalize on opportunities within the competitive insurance sector.",
        "sector": "FINANCIAL SERVICES",
        "industry": "INSURANCE BROKERS"
      }
    },
    "COKE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.263367",
      "company": {
        "name": "Coca-Cola Consolidated Inc.",
        "market_cap": "$13.80B",
        "market_cap_raw": 13797521000.0,
        "last_q_revenue": 1888317000.0,
        "description": "Coca-Cola Consolidated, Inc. (COKE), headquartered in Charlotte, North Carolina, stands as the largest independent bottler of Coca-Cola products in the United States. The company excels in the production, marketing, and distribution of a diverse portfolio of non-alcoholic beverages, leveraging a robust distribution network that solidifies its competitive advantage. By prioritizing operational efficiency and customer-centric approaches, Coca-Cola Consolidated maintains a strategic partnership with The Coca-Cola Company, positioning itself as a critical player in the beverage industry and driving ongoing growth and innovation.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "BEVERAGES - NON-ALCOHOLIC"
      }
    },
    "CRNC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.459684",
      "company": {
        "name": "Cerence Inc",
        "market_cap": "$555.95M",
        "market_cap_raw": 555948000.0,
        "last_q_revenue": 60639000.0,
        "description": "Cerence Inc. is a premier innovator in AI-driven voice and navigation solutions for connected and autonomous vehicles, with its headquarters located in Burlington, Massachusetts. The company excels in delivering advanced software and cloud-based services complemented by intelligent virtual assistants, significantly enhancing user experiences within the automotive landscape. With a strong focus on safety, innovation, and seamless driver-vehicle interactions, Cerence is well-positioned to lead the transformation of mobility technology as the automotive industry embraces smart solutions. Its expertise in artificial intelligence is pivotal in shaping the future of transportation dynamics, providing a competitive edge in an increasingly tech-centric market.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "DKNG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.941045",
      "company": {
        "name": "DraftKings Inc",
        "market_cap": "$16.51B",
        "market_cap_raw": 16506137000.0,
        "last_q_revenue": 1144019000.0,
        "description": "DraftKings Inc. is a leading digital sports entertainment and gaming company based in Boston, Massachusetts, recognized for its innovative online sports betting platform and daily fantasy sports offerings. The company leverages cutting-edge technology to engage a diverse audience of sports enthusiasts across various jurisdictions in the U.S., positioning itself at the forefront of the expanding regulated sports betting industry. As more states move towards legalizing sports wagering, DraftKings is strategically poised to capitalize on increasing consumer demand, aiming for sustained long-term growth and enhanced shareholder returns.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "GAMBLING"
      }
    },
    "DOCN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.981945",
      "company": {
        "name": "DigitalOcean Holdings Inc",
        "market_cap": "$4.42B",
        "market_cap_raw": 4419070000.0,
        "last_q_revenue": 229634000.0,
        "description": "DigitalOcean Holdings, Inc. is a prominent cloud infrastructure provider focused on serving developers, startups, and small to medium-sized enterprises (SMBs) globally. Based in New York City, the company offers a comprehensive portfolio of services, such as scalable compute resources, managed databases, and Kubernetes solutions, all designed to streamline cloud adoption and boost developer efficiency. By emphasizing user-friendly tools and cost-effective pricing, DigitalOcean enables its clientele to drive innovation and maintain a competitive edge in the dynamic digital economy.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "EDBL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.159043",
      "company": {
        "name": "Edible Garden AG Inc",
        "market_cap": "$1.98M",
        "market_cap_raw": 1984600.0,
        "last_q_revenue": 2817000.0,
        "description": "Edible Garden AG Inc. is a pioneering player in the controlled environment agriculture sector, based in Belvidere, New Jersey. The company focuses on the sustainable cultivation of fresh organic produce, employing cutting-edge farming techniques to enhance crop yields and quality while reducing environmental impact. With a strong emphasis on supply chain sustainability and consumer health, Edible Garden is well-positioned to meet the growing demand for organic products in a rapidly evolving market. Its commitment to innovative agricultural practices and adherence to stringent quality standards make it an attractive investment opportunity for institutional investors interested in the convergence of sustainability and food production innovation.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "FARM PRODUCTS"
      }
    },
    "ERIC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.233436",
      "company": {
        "name": "Telefonaktiebolaget LM Ericsson B ADR",
        "market_cap": "$32.27B",
        "market_cap_raw": 32266215000.0,
        "last_q_revenue": 55338681000.0,
        "description": "Telefonaktiebolaget LM Ericsson (ADR) is a leading global provider of telecommunications infrastructure, services, and software solutions, headquartered in Stockholm, Sweden. With a strong focus on innovation, Ericsson is a pioneer in the deployment of 5G networks and Internet of Things (IoT) technologies, positioning itself as a critical enabler of digital transformation across various industries. The company is dedicated to sustainable development and enhancing customer experiences, strategically capitalizing on the growing demand for advanced communication technologies. As a key player in the telecommunications sector, Ericsson is well-positioned to navigate and excel in the dynamic market landscape.",
        "sector": "TECHNOLOGY",
        "industry": "COMMUNICATION EQUIPMENT"
      }
    },
    "GS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:17.921410",
      "company": {
        "name": "Goldman Sachs Group Inc",
        "market_cap": "$270.08B",
        "market_cap_raw": 270081704000.0,
        "last_q_revenue": 32154000000.0,
        "description": "Goldman Sachs Group, Inc. is a leading global investment banking, securities, and investment management firm based in New York City, recognized for its profound influence in capital markets. Catering to a broad range of institutional investors and corporations, Goldman Sachs excels in providing strategic advisory services, securities underwriting, and comprehensive asset management. The firm’s commitment to risk management and its significant global presence enable it to navigate complex market environments effectively. Leveraging advanced technology and extensive industry expertise, Goldman Sachs continually delivers innovative financial solutions that drive superior client outcomes and facilitate strategic transactions.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "GTBP": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.000105",
      "company": {
        "name": "GT Biopharma Inc",
        "market_cap": "$7.02M",
        "market_cap_raw": 7019800.0,
        "last_q_revenue": 0.0,
        "description": "GT Biopharma Inc. (GTBP) is an innovative clinical-stage biopharmaceutical company based in Beverly Hills, California, dedicated to advancing immuno-oncology treatments through its proprietary Tri-specific Killer Engager (TriKE) technology. This cutting-edge platform is designed to enhance the immune system's ability to target and destroy cancer cells, positioning GT Biopharma at the forefront of one of the most dynamic sectors in oncology. With a strong pipeline of candidates aimed at addressing significant unmet medical needs, the company is well-equipped to impact treatment paradigms and improve patient outcomes in the fight against cancer. As it progresses through clinical trials, GT Biopharma demonstrates substantial promise for revolutionizing cancer therapy.",
        "sector": "HEALTHCARE",
        "industry": "BIOTECHNOLOGY"
      }
    },
    "HMC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.405696",
      "company": {
        "name": "Honda Motor Co Ltd ADR",
        "market_cap": "$39.08B",
        "market_cap_raw": 39081202000.0,
        "last_q_revenue": 5292412000000.0,
        "description": "Honda Motor Co., Ltd. (HMC) is a leading global automotive and motorcycle manufacturer based in Tokyo, Japan, well-known for its commitment to innovation and sustainability. The company is actively transitioning towards electrification, backed by a comprehensive portfolio that includes vehicles, power equipment, and advanced technologies. Honda's strategic global presence across North America, Europe, and Asia, combined with its rigorous quality standards and efficient supply chain, ensures its competitive edge in the dynamic automotive market. With a focus on environmental initiatives and cutting-edge mobility solutions, Honda continues to redefine the future of transportation.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "HWM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.716220",
      "company": {
        "name": "Howmet Aerospace Inc",
        "market_cap": "$88.41B",
        "market_cap_raw": 88405098000.0,
        "last_q_revenue": 2089000000.0,
        "description": "Howmet Aerospace Inc. is a prominent player in the aerospace and transportation sectors, headquartered in Pittsburgh, Pennsylvania. The company focuses on delivering advanced engineered solutions, specifically high-performance components for jet engines, including titanium structures and critical fasteners, alongside forged aluminum wheels for heavy-duty vehicles. With a strong emphasis on innovation and sustainability, Howmet Aerospace integrates state-of-the-art technology to improve operational efficiency and address the dynamic needs of its diverse global customer base. As a key industry leader, Howmet Aerospace is instrumental in shaping the future of aviation and transportation.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "INFY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.980836",
      "company": {
        "name": "Infosys Ltd ADR",
        "market_cap": "$70.88B",
        "market_cap_raw": 70878503000.0,
        "last_q_revenue": 5076000000.0,
        "description": "Infosys Ltd ADR, based in Bengaluru, India, is a premier global leader in digital consulting, technology, and outsourcing services, with a robust focus on artificial intelligence, automation, and digital transformation. Servicing a diverse client base spanning North America, Europe, and beyond, Infosys combines innovative solutions with deep industry expertise to drive business success. The company is also deeply committed to sustainability and corporate responsibility, continually investing in talent development and research initiatives. With a solid reputation for reliability and performance, Infosys stands as a trusted partner for enterprises navigating the complexities of the digital era.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "LCID": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.069341",
      "company": {
        "name": "Lucid Group Inc",
        "market_cap": "$3.70B",
        "market_cap_raw": 3698762000.0,
        "last_q_revenue": 336580000.0,
        "description": "None",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "MA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.224102",
      "company": {
        "name": "Mastercard Inc",
        "market_cap": "$522.43B",
        "market_cap_raw": 522428449000.0,
        "last_q_revenue": 8602000000.0,
        "description": "Mastercard Incorporated is a global leader in financial services, headquartered in Purchase, New York, with significant operational presence in O'Fallon, Missouri. The company excels in facilitating electronic payments, connecting merchants with card-issuing banks through a comprehensive suite of debit, credit, and prepaid card services. With a strong focus on innovation and digital transformation, Mastercard has achieved substantial growth since its IPO in 2006, adeptly adapting to shifting consumer behaviors and technological advancements. As a pivotal player in the global payment systems landscape, Mastercard continues to solidify its market leadership by expanding its service offerings and international footprint.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "NOC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.119879",
      "company": {
        "name": "Northrop Grumman Corporation",
        "market_cap": "$89.56B",
        "market_cap_raw": 89560949000.0,
        "last_q_revenue": 10423000000.0,
        "description": "Northrop Grumman Corporation (NYSE: NOC) is a leading aerospace and defense technology company that specializes in providing cutting-edge systems and solutions to the U.S. government and its allies. With expertise spanning autonomous systems, cybersecurity, C4ISR, and space solutions, Northrop Grumman plays a crucial role in bolstering national security and advancing technological innovations. The company's commitment to engineering excellence and sustainability underpins its ability to deliver mission-critical capabilities that address the complex challenges of an ever-changing global environment, making it a key player in the defense sector.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "NOK": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.200165",
      "company": {
        "name": "Nokia Corp ADR",
        "market_cap": "$36.84B",
        "market_cap_raw": 36837835000.0,
        "last_q_revenue": 4833000000.0,
        "description": "Nokia Corporation (ADR) is a prominent global telecommunications leader headquartered in Espoo, Finland, renowned for its cutting-edge solutions in fixed and mobile networks, particularly in 5G technology, software, and the Internet of Things (IoT). The company plays a crucial role in facilitating digital transformation for communication service providers and enterprises, enhancing both connectivity and operational efficiency through its extensive product portfolio. With a strong commitment to sustainability, Nokia is integral to advancing the telecommunications industry while driving innovation that supports global connectivity and sector-wide performance improvements.",
        "sector": "TECHNOLOGY",
        "industry": "COMMUNICATION EQUIPMENT"
      }
    },
    "PEP": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.712725",
      "company": {
        "name": "PepsiCo Inc",
        "market_cap": "$202.84B",
        "market_cap_raw": 202842489000.0,
        "last_q_revenue": 23937000000.0,
        "description": "PepsiCo, Inc. is a premier global food and beverage corporation based in Purchase, New York, with operations spanning over 200 countries. The company boasts an impressive portfolio of iconic brands such as Pepsi, Mountain Dew, Gatorade, and Frito-Lay, enabling it to effectively meet diverse consumer demands. With a strong focus on innovation, sustainability, and social responsibility, PepsiCo continuously adapts to changing market dynamics while leveraging strategic acquisitions and comprehensive marketing initiatives to enhance its competitive position and deliver long-term shareholder value.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "BEVERAGES - NON-ALCOHOLIC"
      }
    },
    "PLTK": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.770509",
      "company": {
        "name": "Playtika Holding Corp",
        "market_cap": "$1.37B",
        "market_cap_raw": 1365083000.0,
        "last_q_revenue": 674600000.0,
        "description": "Playtika Holding Corp. is a leading mobile gaming company headquartered in Herzliya Pituach, Israel, specializing in social and casino-style games since its establishment in 2010. With a robust portfolio of engaging titles, the company utilizes advanced data analytics to optimize player experiences and retention, ensuring strong engagement in the booming global gaming market. Through strategic acquisitions and a commitment to continuous innovation, Playtika aims to reinforce its industry leadership while delivering sustainable growth and maximizing value for its shareholders.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "ELECTRONIC GAMING & MULTIMEDIA"
      }
    },
    "PM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.889490",
      "company": {
        "name": "Philip Morris International Inc",
        "market_cap": "$233.14B",
        "market_cap_raw": 233137783000.0,
        "last_q_revenue": 10845000000.0,
        "description": "Philip Morris International Inc. (PM) is a leading global tobacco company based in Switzerland, famed for its extensive portfolio of iconic brands, particularly Marlboro. The company is actively transforming its business model by prioritizing smoke-free alternatives and investing heavily in research and development, with innovations such as IQOS, a cutting-edge heated tobacco product. Operating in over 180 markets, PMI is committed to sustainability and responsible growth while delivering robust financial performance, positioning itself as a forward-thinking leader within the industry.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "TOBACCO"
      }
    },
    "POET": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:21.968268",
      "company": {
        "name": "POET Technologies Inc",
        "market_cap": "$951.38M",
        "market_cap_raw": 951377000.0,
        "last_q_revenue": 298434.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PSNY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.015680",
      "company": {
        "name": "Polestar Automotive Holding UK PLC Class A ADS",
        "market_cap": "$1.33B",
        "market_cap_raw": 1327524000.0,
        "last_q_revenue": 711302500.0,
        "description": "None",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "RR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.510100",
      "company": {
        "name": "Richtech Robotics Inc. Class B Common Stock",
        "market_cap": "$666.41M",
        "market_cap_raw": 666413000.0,
        "last_q_revenue": 1177000.0,
        "description": "Richtech Robotics Inc. (Ticker: RR) is a pioneering player in the robotics industry, dedicated to delivering cutting-edge automation solutions specifically designed for the service sector. Headquartered in Las Vegas, Nevada, the company leverages its advanced robotic technologies to drive operational efficiency and elevate customer experiences. With a diverse product portfolio that addresses the unique challenges of various service industries, Richtech Robotics is strategically positioned to seize emerging opportunities in the expanding automation market, making it an attractive investment for institutions seeking growth in innovative technology.",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "SCHW": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.581202",
      "company": {
        "name": "Charles Schwab Corp",
        "market_cap": "$181.36B",
        "market_cap_raw": 181358576000.0,
        "last_q_revenue": 7041000000.0,
        "description": "The Charles Schwab Corporation is a leading American financial services firm that specializes in a broad range of offerings, including banking, electronic trading, and comprehensive wealth management services. Catering to both retail and institutional investors, Schwab stands out for its commitment to innovation, cost efficiency, and superior customer service, providing an extensive suite of financial products like brokerage accounts, investment advisory services, and tailored institutional trading solutions. With a focus on accessibility and empowering clients, Schwab is well-positioned to help investors successfully navigate the complexities of today's financial landscape.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "SMLR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:22.814765",
      "company": {
        "name": "Semler Scientific Inc",
        "market_cap": "$348.27M",
        "market_cap_raw": 348270000.0,
        "last_q_revenue": 7491000.0,
        "description": "Semler Scientific, Inc. is a pioneering healthcare company based in Santa Clara, California, specializing in the development and commercialization of proprietary solutions aimed at enhancing the evaluation and management of chronic conditions. By addressing the critical need for effective chronic disease management tools, Semler is well-positioned to leverage substantial market opportunities and drive innovation in patient care. With a strong commitment to improving clinical outcomes and a strategic vision tailored to meet the demands of an evolving healthcare landscape, Semler presents a compelling investment opportunity for institutional investors seeking growth in the healthcare sector.",
        "sector": "HEALTHCARE",
        "industry": "MEDICAL DEVICES"
      }
    },
    "SPOT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.056692",
      "company": {
        "name": "Spotify Technology SA",
        "market_cap": "$120.77B",
        "market_cap_raw": 120771256000.0,
        "last_q_revenue": 4272000000.0,
        "description": "Spotify Technology SA is a premier global audio streaming service based in Luxembourg, transforming the interaction between users and audio content with its vast library of music and podcasts. Renowned for its cutting-edge recommendation algorithms and robust creator partnerships, Spotify has established a dynamic ecosystem that appeals to both listeners and artists. As the company adapts to the rapidly changing digital media environment, its strategic focus on growth and monetization indicates substantial opportunities ahead, making it an attractive investment for institutional investors looking to capitalize on the expanding audio streaming sector.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "SURG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.377165",
      "company": {
        "name": "Surgepays Inc",
        "market_cap": "$29.06M",
        "market_cap_raw": 29057000.0,
        "last_q_revenue": 18680317.0,
        "description": "Surgepays Inc. is a forward-thinking telecommunications service provider based in Bartlett, Tennessee, specializing in enhancing connectivity solutions for underserved markets across the United States. Through its commitment to innovative technology and a diverse portfolio of services, SurgePays aims to deliver affordable and reliable communication options that meet the unique needs of its clientele. The company is strategically positioned to benefit from the increasing demand for accessible telecommunications, presenting a compelling investment opportunity for institutional investors looking for growth in this critical sector.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "TELECOM SERVICES"
      }
    },
    "TM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.769229",
      "company": {
        "name": "Toyota Motor Corporation ADR",
        "market_cap": "$285.93B",
        "market_cap_raw": 285926457000.0,
        "last_q_revenue": 12377427000000.0,
        "description": "Toyota Motor Corporation (ADR) is a leading global automotive manufacturer based in Toyota City, Japan, recognized for its diverse lineup that includes passenger cars, minivans, and commercial vehicles. A pioneer in hybrid technology and sustainable transportation solutions, Toyota is actively investing in innovations such as hydrogen fuel cell technology. With a strong emphasis on quality and customer-centric approaches, the company is well-positioned to adapt to the evolving global market while maintaining its reputation for reliability and excellence in the automotive sector. Toyota's commitment to advanced technologies and sustainable practices underscores its role as a key player in shaping the future of mobility.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "TRMB": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.855531",
      "company": {
        "name": "Trimble Inc",
        "market_cap": "$19.02B",
        "market_cap_raw": 19016110000.0,
        "last_q_revenue": 901200000.0,
        "description": "Trimble Inc. is a premier technology company headquartered in Sunnyvale, California, recognized for its innovative hardware, software, and services tailored for diverse sectors including Agriculture, Construction, Geospatial, and Transportation. With a strong emphasis on enhancing productivity and operational efficiency, Trimble offers cutting-edge solutions such as Global Navigation Satellite System (GNSS) receivers and unmanned aerial vehicles (UAVs). The company's strategic commitment to integrating advanced technology into industrial workflows positions Trimble as a leader in reshaping industry standards, making it an essential partner in the digital transformation of complex operations.",
        "sector": "TECHNOLOGY",
        "industry": "SCIENTIFIC & TECHNICAL INSTRUMENTS"
      }
    },
    "V": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.477246",
      "company": {
        "name": "Visa Inc. Class A",
        "market_cap": "$684.36B",
        "market_cap_raw": 684360794000.0,
        "last_q_revenue": 10724000000.0,
        "description": "Visa Inc. (NYSE: V), based in Foster City, California, stands at the forefront of the global financial services industry, recognized for its integral role in electronic funds transfers. Operating the largest retail electronic payments network worldwide, Visa provides a wide range of payment solutions through its extensive portfolio of branded credit, debit, and prepaid cards for consumers and businesses. With a strong emphasis on innovation in payment technology, the company is poised to take advantage of the ongoing shift toward digital transactions and e-commerce, reinforcing its leadership position and substantial market valuation in an increasingly cashless economy.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "VST": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.640218",
      "company": {
        "name": "Vistra Energy Corp",
        "market_cap": "$56.37B",
        "market_cap_raw": 56370397000.0,
        "last_q_revenue": 4971000000.0,
        "description": "Vistra Energy Corp (VST), based in Irving, Texas, stands as a prominent integrated energy provider with a substantial portfolio of generation assets spanning the United States. The company is at the forefront of the energy transition, making strategic investments in renewable energy and energy storage technologies that promote sustainability and innovation. With a strong operational foundation and a commitment to growth, Vistra is well-equipped to seize emerging market opportunities and deliver enhanced shareholder value in an increasingly competitive energy sector.",
        "sector": "UTILITIES",
        "industry": "UTILITIES - INDEPENDENT POWER PRODUCERS"
      }
    },
    "ZETA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:25.111733",
      "company": {
        "name": "Zeta Global Holdings Corp",
        "market_cap": "$5.09B",
        "market_cap_raw": 5090469000.0,
        "last_q_revenue": 337169000.0,
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "ZTS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:25.277564",
      "company": {
        "name": "Zoetis Inc",
        "market_cap": "$52.33B",
        "market_cap_raw": 52326674000.0,
        "last_q_revenue": 2400000000.0,
        "description": "Zoetis Inc. (ZTS) is a leading global animal health company dedicated to improving the health and well-being of livestock and companion animals. As the largest manufacturer of medicines and vaccines for animals, Zoetis leverages advanced research and development to offer a comprehensive range of innovative products that enhance productivity in animal agriculture and support the well-being of pets globally. Committed to sustainability and animal welfare, Zoetis is well-positioned to meet the increasing demand for premium animal health solutions in an expanding market, making it an attractive investment opportunity for institutional investors.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "TLSA": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:23.682884",
      "company": {
        "name": "Tiziana Life Sciences Ltd",
        "market_cap": "$174.30M",
        "market_cap_raw": 174301000.0,
        "last_q_revenue": null,
        "description": "Tiziana Life Sciences Ltd (TLSA) is an innovative clinical-stage biotechnology company based in the UK, dedicated to the discovery and development of transformative therapeutic molecules and diagnostics aimed at addressing significant unmet medical needs within oncology and immunology. The company boasts a promising pipeline that includes advanced candidates targeting various cancers and autoimmune disorders, underpinned by its proprietary technologies designed to optimize patient outcomes. With a strong emphasis on scientific rigor and a strategic focus on efficient clinical trial management and regulatory navigation, Tiziana is poised to make a meaningful impact in the biopharmaceutical sector, positioning itself for sustainable growth and development.",
        "sector": "HEALTHCARE",
        "industry": "BIOTECHNOLOGY"
      }
    },
    "HPQ": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.590955",
      "company": {
        "name": "HP Inc",
        "market_cap": "$18.47B",
        "market_cap_raw": 18469708000.0,
        "last_q_revenue": 14639000000.0,
        "description": "HP Inc. is an American multinational information technology company headquartered in Palo Alto, California, that develops personal computers (PCs), printers and related supplies, as well as 3D printing solutions.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "IPGP": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:19.186222",
      "company": {
        "name": "IPG Photonics Corporation",
        "market_cap": "$4.68B",
        "market_cap_raw": 4682189000.0,
        "last_q_revenue": 250792000.0,
        "description": "IPG Photonics is a manufacturer of fiber lasers.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "AAL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.078767",
      "company": {
        "name": "American Airlines Group",
        "market_cap": "$9.16B",
        "market_cap_raw": 9164979000.0,
        "last_q_revenue": 13999000000.0,
        "description": "American Airlines Group Inc. is an American publicly traded airline holding company headquartered in Fort Worth, Texas.",
        "sector": "INDUSTRIALS",
        "industry": "AIRLINES"
      }
    },
    "DAL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:16.776182",
      "company": {
        "name": "Delta Air Lines Inc",
        "market_cap": "$45.07B",
        "market_cap_raw": 45066019000.0,
        "last_q_revenue": 16003000000.0,
        "description": "Delta Air Lines, Inc., typically referred to as Delta, is one of the major airlines of the United States and a legacy carrier. It is headquartered in Atlanta, Georgia.",
        "sector": "INDUSTRIALS",
        "industry": "AIRLINES"
      }
    },
    "UAL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:24.248747",
      "company": {
        "name": "United Airlines Holdings Inc",
        "market_cap": "$35.38B",
        "market_cap_raw": 35381326000.0,
        "last_q_revenue": 15397000000.0,
        "description": "United Airlines Holdings, Inc. (formerly known as United Continental Holdings, Inc., UAL Corporation, Allegis Corporation and founded originally as UAL, Inc.) is a publicly traded airline holding company headquartered in the Willis Tower in Chicago. UAH owns and operates United Airlines, Inc.",
        "sector": "INDUSTRIALS",
        "industry": "AIRLINES"
      }
    },
    "ABNB": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:14.216982",
      "company": {
        "name": "Airbnb Inc",
        "market_cap": "$72.75B",
        "market_cap_raw": 72751022000.0,
        "last_q_revenue": 2778000000.0,
        "description": "Airbnb, Inc. is an American company that operates an online marketplace for lodging, primarily homestays for vacation rentals, and tourism activities, based in San Francisco, California.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "TRAVEL SERVICES"
      }
    },
    "H": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:18.068188",
      "company": {
        "name": "Hyatt Hotels Corporation",
        "market_cap": "$15.79B",
        "market_cap_raw": 15792263000.0,
        "last_q_revenue": 1789000000.0,
        "description": "Hyatt Hotels Corporation is a hotel company in the United States and internationally. The company is headquartered in Chicago, Illinois.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "LODGING"
      }
    },
    "MAR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 12:31 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 12:31 AM"
        }
      },
      "last_updated": "2026-02-16T00:31:20.305948",
      "company": {
        "name": "Marriott International Inc",
        "market_cap": "$93.78B",
        "market_cap_raw": 93775389000.0,
        "last_q_revenue": 6690000000.0,
        "description": "Marriott International, Inc. is an American multinational company that operates, franchises, and licenses lodging including hotel, residential, and timeshare properties. It is headquartered in Bethesda, Maryland.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "LODGING"
      }
    },
    "IHG": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 11:40 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 11:40 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 11:40 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 11:40 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 11:40 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 11:40 AM"
        }
      },
      "last_updated": "2026-02-16T11:40:08.567634",
      "company": {
        "name": "InterContinental Hotels Group PLC ADR",
        "market_cap": "$21.99B",
        "market_cap_raw": 21990240000.0,
        "last_q_revenue": 2540652000.0,
        "description": "InterContinental Hotels Group PLC owns, manages, franchises, and leases hotels in the Americas, Europe, Asia, the Middle East, Africa, and Greater China. The company is headquartered in Denham, the United Kingdom.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "LODGING"
      }
    },
    "T": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 11:44 AM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 11:44 AM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 11:44 AM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 11:44 AM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 11:44 AM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 11:44 AM"
        }
      },
      "last_updated": "2026-02-16T11:44:58.459744",
      "company": {
        "name": "AT&T Inc",
        "market_cap": "$203.40B",
        "market_cap_raw": 203396317000.0,
        "last_q_revenue": 33466000000.0,
        "description": "AT&T Inc. is an American multinational conglomerate holding company, Delaware-registered but headquartered at Whitacre Tower in Downtown Dallas, Texas. It is the world largest telecommunications company, and the second largest provider of mobile telephone services.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "TELECOM SERVICES"
      }
    },
    "WH": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 11:36 PM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 11:36 PM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 11:36 PM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 11:36 PM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 11:36 PM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 11:36 PM"
        }
      },
      "last_updated": "2026-02-16T23:36:21.601988",
      "company": {
        "name": "Wyndham Hotels & Resorts Inc",
        "market_cap": "$5.94B",
        "market_cap_raw": 5937462000.0,
        "last_q_revenue": 382000000.0,
        "description": "Wyndham Hotels & Resorts, Inc. is a global hotel franchisor. The company is headquartered in Parsippany, New Jersey.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "LODGING"
      }
    },
    "TMUS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 16, 2026 11:39 PM"
        },
        "Costs": {
          "updated": "Feb 16, 2026 11:39 PM"
        },
        "Cash": {
          "updated": "Feb 16, 2026 11:39 PM"
        },
        "FCF": {
          "updated": "Feb 16, 2026 11:39 PM"
        },
        "Assets": {
          "updated": "Feb 16, 2026 11:39 PM"
        },
        "Buffet": {
          "updated": "Feb 16, 2026 11:39 PM"
        }
      },
      "last_updated": "2026-02-16T23:39:39.957621",
      "company": {
        "name": "T-Mobile US Inc",
        "market_cap": "$245.51B",
        "market_cap_raw": 245512208000.0,
        "last_q_revenue": 24334000000.0,
        "description": "T-Mobile US, Inc., doing business under the global brand name T-Mobile, is an American wireless network operator. Its headquarters are located in Bellevue, Washington, in the Seattle metropolitan area and Overland Park, Kansas, in the Kansas City metropolitan area.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "TELECOM SERVICES"
      }
    },
    "VVPR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 17, 2026 01:05 AM"
        },
        "Costs": {
          "updated": "Feb 17, 2026 01:05 AM"
        },
        "Cash": {
          "updated": "Feb 17, 2026 01:05 AM"
        },
        "FCF": {
          "updated": "Feb 17, 2026 01:05 AM"
        },
        "Assets": {
          "updated": "Feb 17, 2026 01:05 AM"
        },
        "Buffet": {
          "updated": "Feb 17, 2026 01:05 AM"
        }
      },
      "last_updated": "2026-02-17T01:05:20.288664",
      "company": {
        "name": "VivoPower International PLC",
        "market_cap": "$35.43M",
        "market_cap_raw": 35427400.0,
        "last_q_revenue": -2000.0,
        "description": "VivoPower International PLC is a critical and solar energy services company in the United States, Australia, and the United Kingdom. The company is headquartered in London, the United Kingdom.",
        "sector": "TECHNOLOGY",
        "industry": "SOLAR"
      }
    },
    "WIT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 17, 2026 01:54 AM"
        },
        "Costs": {
          "updated": "Feb 17, 2026 01:54 AM"
        },
        "Cash": {
          "updated": "Feb 17, 2026 01:54 AM"
        },
        "FCF": {
          "updated": "Feb 17, 2026 01:54 AM"
        },
        "Assets": {
          "updated": "Feb 17, 2026 01:54 AM"
        },
        "Buffet": {
          "updated": "Feb 17, 2026 01:54 AM"
        }
      },
      "last_updated": "2026-02-17T01:54:48.995610",
      "company": {
        "name": "Wipro Limited ADR",
        "market_cap": "$24.95B",
        "market_cap_raw": 24947880000.0,
        "last_q_revenue": 237515261000.0,
        "description": "Wipro Limited is a global information technology (IT), consulting and business process services company. The company is headquartered in Bengaluru, India.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "FIGR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 17, 2026 02:52 PM"
        },
        "Costs": {
          "updated": "Feb 17, 2026 02:52 PM"
        },
        "Cash": {
          "updated": "Feb 17, 2026 02:52 PM"
        },
        "FCF": {
          "updated": "Feb 17, 2026 02:52 PM"
        },
        "Assets": {
          "updated": "Feb 17, 2026 02:52 PM"
        },
        "Buffet": {
          "updated": "Feb 17, 2026 02:52 PM"
        }
      },
      "last_updated": "2026-02-17T14:52:06.779188",
      "company": {
        "name": "Figure Technology Solutions, Inc. Class A Common Stock",
        "market_cap": "$8.05B",
        "market_cap_raw": 8046157000.0,
        "last_q_revenue": 156365000.0,
        "description": "Figure Technology Solutions, Inc. develops and operates a blockchain-based consumer lending platform. The company is headquartered in Reno, Nevada.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "GOVX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 17, 2026 10:51 PM"
        },
        "Costs": {
          "updated": "Feb 17, 2026 10:51 PM"
        },
        "Cash": {
          "updated": "Feb 17, 2026 10:51 PM"
        },
        "FCF": {
          "updated": "Feb 17, 2026 10:51 PM"
        },
        "Assets": {
          "updated": "Feb 17, 2026 10:51 PM"
        },
        "Buffet": {
          "updated": "Feb 17, 2026 10:51 PM"
        }
      },
      "last_updated": "2026-02-17T22:51:51.075482",
      "company": {
        "name": "GeoVax Labs Inc",
        "market_cap": "$2.91M",
        "market_cap_raw": 2910000.0,
        "last_q_revenue": 0.0,
        "description": "GeoVax Labs, Inc., a clinical-stage biotechnology company, develops human vaccines and immunotherapies against infectious diseases and cancers using a modified vaccinia ankara virus-like particle vaccine platform. The company is headquartered in Smyrna, Georgia.",
        "sector": "HEALTHCARE",
        "industry": "BIOTECHNOLOGY"
      }
    },
    "TGT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Costs": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Cash": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "FCF": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Assets": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Buffet": {
          "updated": "Feb 18, 2026 11:55 PM"
        }
      },
      "last_updated": "2026-02-18T23:55:03.891416",
      "company": {
        "name": "Target Corporation",
        "market_cap": "$52.96B",
        "market_cap_raw": 52955677000.0,
        "last_q_revenue": 25270000000.0,
        "description": "Target Corporation is an American retail corporation. Their retail formats include the discount store Target, the hypermarket SuperTarget, and small-format stores previously named CityTarget and TargetExpress before being consolidated under the Target branding.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "DISCOUNT STORES"
      }
    },
    "LOW": {
      "presets": {
        "Revenue": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Costs": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Cash": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "FCF": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Assets": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Buffet": {
          "updated": "Feb 18, 2026 11:55 PM"
        }
      },
      "last_updated": "2026-02-18T23:55:03.926662",
      "company": {
        "name": "Lowe's Companies Inc",
        "market_cap": "$157.72B",
        "market_cap_raw": 157717119000.0,
        "last_q_revenue": 20813000000.0,
        "description": "Lowe's Companies, Inc. is an American retail company specializing in home improvement. Headquartered in Mooresville, North Carolina, the company operates a chain of retail stores in the United States and Canada.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "HOME IMPROVEMENT RETAIL"
      }
    },
    "ETSY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Costs": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Cash": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "FCF": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Assets": {
          "updated": "Feb 18, 2026 11:55 PM"
        },
        "Buffet": {
          "updated": "Feb 18, 2026 11:55 PM"
        }
      },
      "last_updated": "2026-02-18T23:55:03.955154",
      "company": {
        "name": "Etsy, Inc.",
        "market_cap": "$4.40B",
        "market_cap_raw": 4396456000.0,
        "last_q_revenue": 678026000.0,
        "description": "Etsy, Inc. is an American e-commerce company focused on handmade or vintage items and craft supplies. These items fall under a wide range of categories, including jewelry, bags, clothing, home decor and furniture, toys, art, as well as craft supplies and tools.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "INTERNET RETAIL"
      }
    },
    "DVLT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 19, 2026 10:54 PM"
        },
        "Costs": {
          "updated": "Feb 19, 2026 10:54 PM"
        },
        "Cash": {
          "updated": "Feb 19, 2026 10:54 PM"
        },
        "FCF": {
          "updated": "Feb 19, 2026 10:54 PM"
        },
        "Assets": {
          "updated": "Feb 19, 2026 10:54 PM"
        },
        "Buffet": {
          "updated": "Feb 19, 2026 10:54 PM"
        }
      },
      "last_updated": "2026-02-19T22:54:42.497896",
      "company": {
        "name": "Datavault AI Inc.",
        "market_cap": "$65.00M",
        "market_cap_raw": 65004000.0,
        "last_q_revenue": 2904000.0,
        "description": "Datavault AI Inc., a data sciences technology company, owns and operates data management and supercomputer platforms. The company is headquartered in Beaverton, Oregon.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "RKT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 19, 2026 11:48 PM"
        },
        "Costs": {
          "updated": "Feb 19, 2026 11:48 PM"
        },
        "Cash": {
          "updated": "Feb 19, 2026 11:48 PM"
        },
        "FCF": {
          "updated": "Feb 19, 2026 11:48 PM"
        },
        "Assets": {
          "updated": "Feb 19, 2026 11:48 PM"
        },
        "Buffet": {
          "updated": "Feb 19, 2026 11:48 PM"
        }
      },
      "last_updated": "2026-02-19T23:48:58.217047",
      "company": {
        "name": "Rocket Companies Inc",
        "market_cap": "$51.95B",
        "market_cap_raw": 51953172000.0,
        "last_q_revenue": 1789972000.0,
        "description": "Rocket Companies, Inc. is engaged in the technology-driven real estate, mortgage and e-commerce businesses in the United States and Canada. The company is headquartered in Detroit, Michigan.",
        "sector": "FINANCIAL SERVICES",
        "industry": "MORTGAGE FINANCE"
      }
    },
    "LDOS": {
      "presets": {
        "Revenue": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Costs": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Cash": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "FCF": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Assets": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Buffet": {
          "updated": "Feb 20, 2026 11:48 PM"
        }
      },
      "last_updated": "2026-02-20T23:48:11.091479",
      "company": {
        "name": "Leidos Holdings Inc",
        "market_cap": "$22.61B",
        "market_cap_raw": 22614972000.0,
        "last_q_revenue": 4207000000.0,
        "description": "Leidos, formerly known as Science Applications International Corporation (SAIC), is an American defense, aviation, information technology (Lockheed Martin IS&GS), and biomedical research company headquartered in Reston, Virginia, that provides scientific, engineering, systems integration, and technical services.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "IBEX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Costs": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Cash": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "FCF": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Assets": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Buffet": {
          "updated": "Feb 20, 2026 11:48 PM"
        }
      },
      "last_updated": "2026-02-20T23:48:11.122182",
      "company": {
        "name": "IBEX Ltd",
        "market_cap": "$397.95M",
        "market_cap_raw": 397955000.0,
        "last_q_revenue": 164221000.0,
        "description": "IBEX Limited provides comprehensive technology-enabled customer lifecycle experience solutions in the United States and internationally. ",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "TENB": {
      "presets": {
        "Revenue": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Costs": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Cash": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "FCF": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Assets": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Buffet": {
          "updated": "Feb 20, 2026 11:48 PM"
        }
      },
      "last_updated": "2026-02-20T23:48:11.148840",
      "company": {
        "name": "Tenable Holdings Inc",
        "market_cap": "$2.64B",
        "market_cap_raw": 2642292000.0,
        "last_q_revenue": 260533000.0,
        "description": "Tenable Holdings, Inc. offers cyber exposure solutions in the Americas, Europe, the Middle East, Africa, Asia Pacific, and Japan. The company is headquartered in Columbia, Maryland.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "FIVN": {
      "presets": {
        "Revenue": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Costs": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Cash": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "FCF": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Assets": {
          "updated": "Feb 20, 2026 11:48 PM"
        },
        "Buffet": {
          "updated": "Feb 20, 2026 11:48 PM"
        }
      },
      "last_updated": "2026-02-20T23:48:11.175895",
      "company": {
        "name": "Five9 Inc",
        "market_cap": "$1.34B",
        "market_cap_raw": 1343752000.0,
        "last_q_revenue": 300282000.0,
        "description": "Five9, Inc. provides cloud software for contact centers in the United States and internationally. The company is headquartered in San Ramon, California.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "SMX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 22, 2026 10:38 PM"
        },
        "Costs": {
          "updated": "Feb 22, 2026 10:38 PM"
        },
        "Cash": {
          "updated": "Feb 22, 2026 10:38 PM"
        },
        "FCF": {
          "updated": "Feb 22, 2026 10:38 PM"
        },
        "Assets": {
          "updated": "Feb 22, 2026 10:38 PM"
        },
        "Buffet": {
          "updated": "Feb 22, 2026 10:38 PM"
        }
      },
      "last_updated": "2026-02-22T22:38:25.200820",
      "company": {
        "name": "SMX (Security Matters) Public Limited Company Class A Ordinary Shares",
        "market_cap": "$366.36M",
        "market_cap_raw": 366356000.0,
        "last_q_revenue": null,
        "description": "SMX (Security Matters) Public Limited Company engages in the development and commercialization of track and trace technologies for various industries in Australia. The company is headquartered in Melbourne, Australia.",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY BUSINESS SERVICES"
      }
    },
    "PLD": {
      "presets": {
        "Revenue": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Costs": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Cash": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "FCF": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Assets": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Buffet": {
          "updated": "Feb 22, 2026 10:52 PM"
        }
      },
      "last_updated": "2026-02-22T22:52:25.361743",
      "company": {
        "name": "Prologis Inc",
        "market_cap": "$131.44B",
        "market_cap_raw": 131443966000.0,
        "last_q_revenue": 2252712000.0,
        "description": "Prologis, Inc. is a real estate investment trust headquartered in San Francisco, California that invests in logistics facilities, with a focus on the consumption side of the global supply chain.",
        "sector": "REAL ESTATE",
        "industry": "REIT - INDUSTRIAL"
      }
    },
    "AMT": {
      "presets": {
        "Revenue": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Costs": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Cash": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "FCF": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Assets": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Buffet": {
          "updated": "Feb 22, 2026 10:52 PM"
        }
      },
      "last_updated": "2026-02-22T22:52:25.398316",
      "company": {
        "name": "American Tower Corp",
        "market_cap": "$87.71B",
        "market_cap_raw": 87708140000.0,
        "last_q_revenue": 2717400000.0,
        "description": "American Tower Corporation (also referred to as American Tower or ATC) is an American real estate investment trust and an owner and operator of wireless and broadcast communications infrastructure in several countries worldwide and is headquartered in Boston, Massachusetts.",
        "sector": "REAL ESTATE",
        "industry": "REIT - SPECIALTY"
      }
    },
    "WELL": {
      "presets": {
        "Revenue": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Costs": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Cash": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "FCF": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Assets": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Buffet": {
          "updated": "Feb 22, 2026 10:52 PM"
        }
      },
      "last_updated": "2026-02-22T22:52:25.434613",
      "company": {
        "name": "Welltower Inc",
        "market_cap": "$145.27B",
        "market_cap_raw": 145265099000.0,
        "last_q_revenue": 3134347000.0,
        "description": "Welltower Inc. is a real estate investment trust that invests in healthcare infrastructure.",
        "sector": "REAL ESTATE",
        "industry": "REIT - HEALTHCARE FACILITIES"
      }
    },
    "Z": {
      "presets": {
        "Revenue": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Costs": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Cash": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "FCF": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Assets": {
          "updated": "Feb 22, 2026 10:52 PM"
        },
        "Buffet": {
          "updated": "Feb 22, 2026 10:52 PM"
        }
      },
      "last_updated": "2026-02-22T22:52:25.462687",
      "company": {
        "name": "Zillow Group Inc Class C",
        "market_cap": "$11.00B",
        "market_cap_raw": 11003621000.0,
        "last_q_revenue": 654000000.0,
        "description": "Zillow Group, Inc., a digital real estate company, operates real estate brands on mobile apps and websites in the United States. The company is headquartered in Seattle, Washington.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "VNRX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 24, 2026 08:33 PM"
        },
        "Costs": {
          "updated": "Feb 24, 2026 08:33 PM"
        },
        "Cash": {
          "updated": "Feb 24, 2026 08:33 PM"
        },
        "FCF": {
          "updated": "Feb 24, 2026 08:33 PM"
        },
        "Assets": {
          "updated": "Feb 24, 2026 08:33 PM"
        },
        "Buffet": {
          "updated": "Feb 24, 2026 08:33 PM"
        }
      },
      "last_updated": "2026-02-24T20:33:00.393146",
      "company": {
        "name": "Volitionrx Ltd",
        "market_cap": "$26.23M",
        "market_cap_raw": 26231900.0,
        "last_q_revenue": 627277.0,
        "description": "VolitionRx Limited, a multinational epigenetics company, is dedicated to developing blood tests to help diagnose a variety of cancers and other diseases globally. The company is headquartered in Austin, Texas.",
        "sector": "HEALTHCARE",
        "industry": "MEDICAL DEVICES"
      }
    },
    "LTM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Costs": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Cash": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "FCF": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Assets": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Buffet": {
          "updated": "Feb 24, 2026 11:23 PM"
        }
      },
      "last_updated": "2026-02-24T23:23:35.976773",
      "company": {
        "name": "LATAM Airlines Group S.A.",
        "market_cap": "$16.34B",
        "market_cap_raw": 16335604000.0,
        "last_q_revenue": 3907635822.0,
        "description": "LATAM Airlines Group SA, provides passenger and cargo air transport services in Peru, Argentina, the United States, Europe, Colombia, Brazil, Ecuador, Chile, Asia Pacific and the rest of Latin America. ",
        "sector": "INDUSTRIALS",
        "industry": "AIRLINES"
      }
    },
    "EXPE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Costs": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Cash": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "FCF": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Assets": {
          "updated": "Feb 24, 2026 11:23 PM"
        },
        "Buffet": {
          "updated": "Feb 24, 2026 11:23 PM"
        }
      },
      "last_updated": "2026-02-24T23:23:36.005337",
      "company": {
        "name": "Expedia Group Inc.",
        "market_cap": "$23.10B",
        "market_cap_raw": 23099048000.0,
        "last_q_revenue": 3547000000.0,
        "description": "Expedia Group, Inc. is an American online travel shopping company for consumer and small business travel. Its websites, which are primarily travel fare aggregators and travel metasearch engines, include Expedia.com, Vrbo (previously HomeAway), Hotels.com, Hotwire.com, Orbitz, Travelocity, trivago and CarRentals.com.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "TRAVEL SERVICES"
      }
    },
    "BAC": {
      "presets": {
        "Revenue": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Costs": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Cash": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "FCF": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Assets": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Buffet": {
          "updated": "Feb 24, 2026 11:29 PM"
        }
      },
      "last_updated": "2026-02-24T23:29:50.957453",
      "company": {
        "name": "Bank of America Corp",
        "market_cap": "$372.94B",
        "market_cap_raw": 372938441000.0,
        "last_q_revenue": 46878000000.0,
        "description": "The Bank of America Corporation is an American multinational investment bank and financial services holding company headquartered in Charlotte, North Carolina. Founded in San Francisco, Bank of America was formed through NationsBank's acquisition of BankAmerica in 1998. It is the second largest banking institution in the United States, after JPMorgan Chase, and the eighth largest bank in the world. Bank of America is one of the Big Four banking institutions of the United States. It services approximately 10 percent of all American bank deposits, in direct competition with JPMorgan Chase, Citigroup and Wells Fargo. Its primary financial services revolve around commercial banking, wealth management, and investment banking.",
        "sector": "FINANCIAL SERVICES",
        "industry": "BANKS - DIVERSIFIED"
      }
    },
    "JPM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Costs": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Cash": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "FCF": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Assets": {
          "updated": "Feb 24, 2026 11:29 PM"
        },
        "Buffet": {
          "updated": "Feb 24, 2026 11:29 PM"
        }
      },
      "last_updated": "2026-02-24T23:29:51.066471",
      "company": {
        "name": "JPMorgan Chase & Co",
        "market_cap": "$802.83B",
        "market_cap_raw": 802825699000.0,
        "last_q_revenue": 69611000000.0,
        "description": "JPMorgan Chase & Co. is an American multinational investment bank and financial services holding company headquartered in New York City. JPMorgan Chase is incorporated in Delaware. As a Bulge Bracket bank, it is a major provider of various investment banking and financial services. It is one of America's Big Four banks, along with Bank of America, Citigroup, and Wells Fargo. JPMorgan Chase is considered to be a universal bank and a custodian bank. The J.P. Morgan brand is used by the investment banking, asset management, private banking, private wealth management, and treasury services divisions.",
        "sector": "FINANCIAL SERVICES",
        "industry": "BANKS - DIVERSIFIED"
      }
    },
    "BK": {
      "presets": {
        "Revenue": {
          "updated": "Feb 24, 2026 11:32 PM"
        },
        "Costs": {
          "updated": "Feb 24, 2026 11:32 PM"
        },
        "Cash": {
          "updated": "Feb 24, 2026 11:32 PM"
        },
        "FCF": {
          "updated": "Feb 24, 2026 11:32 PM"
        },
        "Assets": {
          "updated": "Feb 24, 2026 11:32 PM"
        },
        "Buffet": {
          "updated": "Feb 24, 2026 11:32 PM"
        }
      },
      "last_updated": "2026-02-24T23:32:28.234393",
      "company": {
        "name": "The Bank of New York Mellon Corporation",
        "market_cap": "$80.57B",
        "market_cap_raw": 80571720000.0,
        "last_q_revenue": 8869000000.0,
        "description": "The Bank of New York Mellon Corporation, commonly known as BNY Mellon, is a multinational American investment banking services holding company headquartered in New York City.",
        "sector": "FINANCIAL SERVICES",
        "industry": "BANKS - DIVERSIFIED"
      }
    },
    "C": {
      "presets": {
        "Revenue": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Costs": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Cash": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "FCF": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Assets": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Buffet": {
          "updated": "Feb 26, 2026 12:03 AM"
        }
      },
      "last_updated": "2026-02-26T00:03:22.833956",
      "company": {
        "name": "Citigroup Inc.",
        "market_cap": "$196.03B",
        "market_cap_raw": 196032004000.0,
        "last_q_revenue": 40855000000.0,
        "description": "Citigroup Inc. is an American multinational investment bank and financial services corporation headquartered in New York City. The company was formed by the merger of banking giant Citicorp and financial conglomerate Travelers Group in 1998; Travelers was subsequently spun off from the company in 2002. Citigroup owns Citicorp, the holding company for Citibank, as well as several international subsidiaries. Citigroup is incorporated in Delaware.",
        "sector": "FINANCIAL SERVICES",
        "industry": "BANKS - DIVERSIFIED"
      }
    },
    "COF": {
      "presets": {
        "Revenue": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Costs": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Cash": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "FCF": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Assets": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Buffet": {
          "updated": "Feb 26, 2026 12:03 AM"
        }
      },
      "last_updated": "2026-02-26T00:03:22.859839",
      "company": {
        "name": "Capital One Financial Corporation",
        "market_cap": "$124.96B",
        "market_cap_raw": 124959801000.0,
        "last_q_revenue": 19719000000.0,
        "description": "Capital One Financial Corporation is an American bank holding company specializing in credit cards, auto loans, banking, and savings accounts, headquartered in McLean, Virginia with operations primarily in the United States.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "PGR": {
      "presets": {
        "Revenue": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Costs": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Cash": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "FCF": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Assets": {
          "updated": "Feb 26, 2026 12:03 AM"
        },
        "Buffet": {
          "updated": "Feb 26, 2026 12:03 AM"
        }
      },
      "last_updated": "2026-02-26T00:03:22.885389",
      "company": {
        "name": "Progressive Corp",
        "market_cap": "$119.90B",
        "market_cap_raw": 119901348000.0,
        "last_q_revenue": 14999000000.0,
        "description": "The Progressive Corporation is an American insurance company, one of the largest providers of car insurance in the United States. The company insures motorcycles, boats, RVs, and commercial vehicles and provides home insurance through select companies.",
        "sector": "FINANCIAL SERVICES",
        "industry": "INSURANCE - PROPERTY & CASUALTY"
      }
    },
    "LMND": {
      "presets": {
        "Revenue": {
          "updated": "Feb 26, 2026 12:18 AM"
        },
        "Costs": {
          "updated": "Feb 26, 2026 12:18 AM"
        },
        "Cash": {
          "updated": "Feb 26, 2026 12:18 AM"
        },
        "FCF": {
          "updated": "Feb 26, 2026 12:18 AM"
        },
        "Assets": {
          "updated": "Feb 26, 2026 12:18 AM"
        },
        "Buffet": {
          "updated": "Feb 26, 2026 12:18 AM"
        }
      },
      "last_updated": "2026-02-26T00:18:06.820890",
      "company": {
        "name": "Lemonade Inc",
        "market_cap": "$3.90B",
        "market_cap_raw": 3902454000.0,
        "last_q_revenue": 194500000.0,
        "description": "Lemonade, Inc. offers various insurance products in the United States and Europe. The company is headquartered in New York, New York.",
        "sector": "FINANCIAL SERVICES",
        "industry": "INSURANCE - PROPERTY & CASUALTY"
      }
    },
    "USAU": {
      "presets": {
        "Revenue": {
          "updated": "Feb 26, 2026 11:55 PM"
        },
        "Costs": {
          "updated": "Feb 26, 2026 11:55 PM"
        },
        "Cash": {
          "updated": "Feb 26, 2026 11:55 PM"
        },
        "FCF": {
          "updated": "Feb 26, 2026 11:55 PM"
        },
        "Assets": {
          "updated": "Feb 26, 2026 11:55 PM"
        },
        "Buffet": {
          "updated": "Feb 26, 2026 11:55 PM"
        }
      },
      "last_updated": "2026-02-26T23:55:55.539213",
      "company": {
        "name": "US Gold Corp",
        "market_cap": "$304.58M",
        "market_cap_raw": 304584000.0,
        "last_q_revenue": 0.0,
        "description": "US Gold Corp. The company is headquartered in Elko, Nevada.",
        "sector": "BASIC MATERIALS",
        "industry": "GOLD"
      }
    },
    "LLY": {
      "presets": {
        "Revenue": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Costs": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Cash": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "FCF": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Assets": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Buffet": {
          "updated": "Feb 28, 2026 09:57 AM"
        }
      },
      "last_updated": "2026-02-28T09:57:13.081112",
      "company": {
        "name": "Eli Lilly and Company",
        "market_cap": "$992.40B",
        "market_cap_raw": 992402604000.0,
        "last_q_revenue": 19292000000.0,
        "description": "Eli Lilly and Company is an American pharmaceutical company headquartered in Indianapolis, Indiana, with offices in 18 countries. Its products are sold in approximately 125 countries.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - GENERAL"
      }
    },
    "XOM": {
      "presets": {
        "Revenue": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Costs": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Cash": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "FCF": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Assets": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Buffet": {
          "updated": "Feb 28, 2026 09:57 AM"
        }
      },
      "last_updated": "2026-02-28T09:57:13.103796",
      "company": {
        "name": "Exxon Mobil Corp",
        "market_cap": "$635.43B",
        "market_cap_raw": 635431420000.0,
        "last_q_revenue": 80039000000.0,
        "description": "Exxon Mobil Corporation, stylized as ExxonMobil, is an American multinational oil and gas corporation headquartered in Irving, Texas. It is the largest direct descendant of John D. Rockefeller's Standard Oil, and was formed on November 30, 1999 by the merger of Exxon (formerly the Standard Oil Company of New Jersey) and Mobil (formerly the Standard Oil Company of New York). ExxonMobil's primary brands are Exxon, Mobil, Esso, and ExxonMobil Chemical. ExxonMobil is incorporated in New Jersey.",
        "sector": "ENERGY",
        "industry": "OIL & GAS INTEGRATED"
      }
    },
    "CVX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Costs": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Cash": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "FCF": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Assets": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Buffet": {
          "updated": "Feb 28, 2026 09:57 AM"
        }
      },
      "last_updated": "2026-02-28T09:57:13.140718",
      "company": {
        "name": "Chevron Corp",
        "market_cap": "$373.40B",
        "market_cap_raw": 373399257000.0,
        "last_q_revenue": 45787000000.0,
        "description": "Chevron Corporation is an American multinational energy corporation. One of the successor companies of Standard Oil, it is headquartered in San Ramon, California, and active in more than 180 countries. Chevron is engaged in every aspect of the oil and natural gas industries, including hydrocarbon exploration and production; refining, marketing and transport; chemicals manufacturing and sales; and power generation.",
        "sector": "ENERGY",
        "industry": "OIL & GAS INTEGRATED"
      }
    },
    "LRCX": {
      "presets": {
        "Revenue": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Costs": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Cash": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "FCF": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Assets": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Buffet": {
          "updated": "Feb 28, 2026 09:57 AM"
        }
      },
      "last_updated": "2026-02-28T09:57:13.175390",
      "company": {
        "name": "Lam Research Corp",
        "market_cap": "$293.77B",
        "market_cap_raw": 293772853000.0,
        "last_q_revenue": 5344791000.0,
        "description": "Lam Research Corporation is an American corporation that engages in the design, manufacture, marketing, and service of semiconductor processing equipment used in the fabrication of integrated circuits. Its products are used primarily in front-end wafer processing, which involves the steps that create the active components of semiconductor devices (transistors, capacitors) and their wiring (interconnects). The company also builds equipment for back-end wafer-level packaging (WLP), and for related manufacturing markets such as for microelectromechanical systems (MEMS). The company is headquartered in Fremont, California, in the Silicon Valley.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "MRK": {
      "presets": {
        "Revenue": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Costs": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Cash": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "FCF": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Assets": {
          "updated": "Feb 28, 2026 09:57 AM"
        },
        "Buffet": {
          "updated": "Feb 28, 2026 09:57 AM"
        }
      },
      "last_updated": "2026-02-28T09:57:13.211440",
      "company": {
        "name": "Merck & Company Inc",
        "market_cap": "$306.13B",
        "market_cap_raw": 306131567000.0,
        "last_q_revenue": 16400000000.0,
        "description": "Merck & Co. is an American multinational pharmaceutical company headquartered in Kenilworth, New Jersey. It is named after the Merck family, which set up Merck Group in Germany in 1668.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - GENERAL"
      }
    },
    "GE": {
      "presets": {
        "Revenue": {
          "updated": "Feb 28, 2026 11:43 PM"
        },
        "Costs": {
          "updated": "Feb 28, 2026 11:43 PM"
        },
        "Cash": {
          "updated": "Feb 28, 2026 11:43 PM"
        },
        "FCF": {
          "updated": "Feb 28, 2026 11:43 PM"
        },
        "Assets": {
          "updated": "Feb 28, 2026 11:43 PM"
        },
        "Buffet": {
          "updated": "Feb 28, 2026 11:43 PM"
        }
      },
      "last_updated": "2026-02-28T23:43:33.175956",
      "company": {
        "name": "GE Aerospace",
        "market_cap": "$361.02B",
        "market_cap_raw": 361020621000.0,
        "last_q_revenue": 12717000000.0,
        "description": "General Electric Company (GE) is an American multinational conglomerate incorporated in New York City and headquartered in Boston. As of 2018, the company operates through the following segments: aviation, healthcare, power, renewable energy, digital industry, additive manufacturing and venture capital and finance.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "QCOM": {
      "presets": {
        "Revenue": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Costs": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Cash": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "FCF": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Assets": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Buffet": {
          "updated": "Mar 01, 2026 10:07 AM"
        }
      },
      "last_updated": "2026-03-01T10:07:54.408442",
      "company": {
        "name": "Qualcomm Incorporated",
        "market_cap": "$152.05B",
        "market_cap_raw": 152046911000.0,
        "last_q_revenue": 12252000000.0,
        "description": "Qualcomm is an American multinational corporation headquartered in San Diego, California, and incorporated in Delaware. It creates semiconductors, software, and services related to wireless technology. It owns patents critical to the 5G, 4G, CDMA2000, TD-SCDMA and WCDMA mobile communications standards.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "ALL": {
      "presets": {
        "Revenue": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Costs": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Cash": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "FCF": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Assets": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Buffet": {
          "updated": "Mar 01, 2026 10:07 AM"
        }
      },
      "last_updated": "2026-03-01T10:07:54.443516",
      "company": {
        "name": "The Allstate Corporation",
        "market_cap": "$56.14B",
        "market_cap_raw": 56135963000.0,
        "last_q_revenue": 16590000000.0,
        "description": "The Allstate Corporation is an American insurance company, headquartered in Northfield Township, Illinois.",
        "sector": "FINANCIAL SERVICES",
        "industry": "INSURANCE - PROPERTY & CASUALTY"
      }
    },
    "UBER": {
      "presets": {
        "Revenue": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Costs": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Cash": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "FCF": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Assets": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Buffet": {
          "updated": "Mar 01, 2026 10:07 AM"
        }
      },
      "last_updated": "2026-03-01T10:07:54.471597",
      "company": {
        "name": "Uber Technologies Inc",
        "market_cap": "$156.71B",
        "market_cap_raw": 156709962000.0,
        "last_q_revenue": 14366000000.0,
        "description": "Uber Technologies, Inc., commonly known as Uber, is an American technology company. Its services include ride-hailing, food delivery (Uber Eats), package delivery, couriers, freight transportation, and, through a partnership with Lime, electric bicycle and motorized scooter rental. The company is based in San Francisco, California.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "NOW": {
      "presets": {
        "Revenue": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Costs": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Cash": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "FCF": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Assets": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Buffet": {
          "updated": "Mar 01, 2026 10:07 AM"
        }
      },
      "last_updated": "2026-03-01T10:07:54.496910",
      "company": {
        "name": "ServiceNow Inc",
        "market_cap": "$113.97B",
        "market_cap_raw": 113965998000.0,
        "last_q_revenue": 3568000000.0,
        "description": "ServiceNow is an American software company based in Santa Clara, California that develops a cloud computing platform to help companies manage digital workflows for enterprise operations.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "INTU": {
      "presets": {
        "Revenue": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Costs": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Cash": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "FCF": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Assets": {
          "updated": "Mar 01, 2026 10:07 AM"
        },
        "Buffet": {
          "updated": "Mar 01, 2026 10:07 AM"
        }
      },
      "last_updated": "2026-03-01T10:07:54.527635",
      "company": {
        "name": "Intuit Inc",
        "market_cap": "$113.87B",
        "market_cap_raw": 113873953000.0,
        "last_q_revenue": 4651000000.0,
        "description": "Intuit Inc. is an American business that specializes in financial software. Intuit's products include the tax preparation application TurboTax, personal finance app Mint and the small business accounting program QuickBooks.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    }
  }
}