{
  "tickers": {
    "TSLA": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:24 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:24 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:24 PM"
        }
      },
      "last_updated": "2026-01-16T15:24:32.686915",
      "company": {
        "name": "Tesla Inc",
        "market_cap": "$1.42T",
        "description": "Tesla, Inc. is a leading American electric vehicle and clean energy company headquartered in Palo Alto, California, renowned for its groundbreaking innovations in sustainable transportation and energy solutions. As the market leader, Tesla commanded a 16% share of the global plug-in vehicle market and 23% of the battery-electric vehicle sector as of 2020, reflecting its commitment to pushing the boundaries of electric mobility. The company's diverse portfolio includes electric vehicles, advanced battery technology, and solar energy solutions, with Tesla Energy focusing on battery storage and solar products that enhance renewable energy integration. With strategic investments in production capacity and continued technological advancements, Tesla is well-positioned to capitalize on the accelerating global transition towards sustainable energy.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "ADI": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:09 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:09 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:09 PM"
        }
      },
      "last_updated": "2026-01-16T15:09:26.214650"
    },
    "PLTR": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:26 PM"
        }
      },
      "last_updated": "2026-01-16T15:26:38.061405",
      "company": {
        "name": "Palantir Technologies Inc.",
        "market_cap": "$395.10B",
        "description": "Palantir Technologies Inc. (PLTR) is a premier software provider specializing in data integration and analytics, serving a diverse range of clients across government and commercial sectors. Renowned for its platforms, Palantir Gotham and Palantir Foundry, the company enables organizations to efficiently aggregate, analyze, and visualize extensive datasets, driving critical decision-making and operational efficiency. Headquartered in Denver, Colorado, Palantir is recognized for its innovative use of advanced artificial intelligence and machine learning technologies, positioning itself as a key player in addressing complex challenges across global industries and presenting appealing investment opportunities for institutional investors.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "F": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:26 PM"
        }
      },
      "last_updated": "2026-01-16T15:26:44.979496",
      "company": {
        "name": "Ford Motor Company",
        "market_cap": "$53.67B",
        "description": "Ford Motor Company, a pioneering force in the automotive industry since its inception in 1903, is based in Dearborn, Michigan, and offers a wide-ranging portfolio that includes trucks, SUVs, and an expanding array of electric vehicles. With a strong emphasis on electrification and digital integration, Ford is dedicated to sustainability and innovative mobility solutions. The company's established brand reputation, combined with its commitment to customer-centric design, positions it favorably for long-term growth and adaptability within the dynamic automotive landscape. Ford's strategic initiatives towards electrification and technological advancements underscore its potential to thrive in a competitive market as consumer preferences evolve.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "GOOG": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:22 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:22 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:22 PM"
        }
      },
      "last_updated": "2026-01-16T15:22:39.056743",
      "company": {
        "name": "Alphabet Inc Class C",
        "market_cap": "$3.89T",
        "description": "Alphabet Inc. (GOOG) is a leading American multinational conglomerate, headquartered in Mountain View, California, that emerged from Google's corporate restructuring in October 2015. As the parent company of Google and a wide range of subsidiaries, Alphabet excels in technology sectors such as search services, digital advertising, cloud computing, consumer electronics, and artificial intelligence. With robust revenue generation, the company significantly contributes to the global digital economy's evolution. Under visionary leadership from its co-founders, Alphabet is strategically positioned to spearhead innovation and expand its footprint in rapidly growing technology markets.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    }
  }
}