{
  "tickers": {
    "TSLA": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:24 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:24 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:24 PM"
        }
      },
      "last_updated": "2026-01-16T15:24:32.686915",
      "company": {
        "name": "Tesla Inc",
        "market_cap": "$1.42T",
        "description": "Tesla, Inc. is a leading American electric vehicle and clean energy company headquartered in Palo Alto, California, renowned for its groundbreaking innovations in sustainable transportation and energy solutions. As the market leader, Tesla commanded a 16% share of the global plug-in vehicle market and 23% of the battery-electric vehicle sector as of 2020, reflecting its commitment to pushing the boundaries of electric mobility. The company's diverse portfolio includes electric vehicles, advanced battery technology, and solar energy solutions, with Tesla Energy focusing on battery storage and solar products that enhance renewable energy integration. With strategic investments in production capacity and continued technological advancements, Tesla is well-positioned to capitalize on the accelerating global transition towards sustainable energy.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "ADI": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:26 PM"
        }
      },
      "last_updated": "2026-01-16T15:26:52.765587",
      "company": {
        "name": "Analog Devices Inc",
        "market_cap": "$136.77B",
        "description": "Analog Devices, Inc. (ADI) is a prominent American multinational semiconductor firm headquartered in Wilmington, Massachusetts, recognized for its advanced solutions in data conversion, signal processing, and power management. Specializing in high-performance analog, mixed-signal, and digital signal processing integrated circuits, ADI caters to a variety of key sectors, including automotive, industrial, communications, and consumer electronics. With a steadfast commitment to innovation and precision technology, ADI has established itself as a vital contributor in the semiconductor industry, empowering its customers to enhance product performance and energy efficiency in an increasingly competitive market.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PLTR": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:26 PM"
        }
      },
      "last_updated": "2026-01-16T15:26:38.061405",
      "company": {
        "name": "Palantir Technologies Inc.",
        "market_cap": "$395.10B",
        "description": "Palantir Technologies Inc. (PLTR) is a premier software provider specializing in data integration and analytics, serving a diverse range of clients across government and commercial sectors. Renowned for its platforms, Palantir Gotham and Palantir Foundry, the company enables organizations to efficiently aggregate, analyze, and visualize extensive datasets, driving critical decision-making and operational efficiency. Headquartered in Denver, Colorado, Palantir is recognized for its innovative use of advanced artificial intelligence and machine learning technologies, positioning itself as a key player in addressing complex challenges across global industries and presenting appealing investment opportunities for institutional investors.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "F": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:26 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:26 PM"
        }
      },
      "last_updated": "2026-01-16T15:26:44.979496",
      "company": {
        "name": "Ford Motor Company",
        "market_cap": "$53.67B",
        "description": "Ford Motor Company, a pioneering force in the automotive industry since its inception in 1903, is based in Dearborn, Michigan, and offers a wide-ranging portfolio that includes trucks, SUVs, and an expanding array of electric vehicles. With a strong emphasis on electrification and digital integration, Ford is dedicated to sustainability and innovative mobility solutions. The company's established brand reputation, combined with its commitment to customer-centric design, positions it favorably for long-term growth and adaptability within the dynamic automotive landscape. Ford's strategic initiatives towards electrification and technological advancements underscore its potential to thrive in a competitive market as consumer preferences evolve.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "GOOG": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:22 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:22 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:22 PM"
        }
      },
      "last_updated": "2026-01-16T15:22:39.056743",
      "company": {
        "name": "Alphabet Inc Class C",
        "market_cap": "$3.89T",
        "description": "Alphabet Inc. (GOOG) is a leading American multinational conglomerate, headquartered in Mountain View, California, that emerged from Google's corporate restructuring in October 2015. As the parent company of Google and a wide range of subsidiaries, Alphabet excels in technology sectors such as search services, digital advertising, cloud computing, consumer electronics, and artificial intelligence. With robust revenue generation, the company significantly contributes to the global digital economy's evolution. Under visionary leadership from its co-founders, Alphabet is strategically positioned to spearhead innovation and expand its footprint in rapidly growing technology markets.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "HIMS": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:28 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:28 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:28 PM"
        }
      },
      "last_updated": "2026-01-16T15:28:46.216650",
      "company": {
        "name": "Hims Hers Health Inc",
        "market_cap": "$8.74B",
        "description": "Hims & Hers Health, Inc. is a leading multi-specialty telehealth platform headquartered in San Francisco, California, that revolutionizes healthcare access through its innovative technology connecting consumers with licensed healthcare professionals. The company boasts an extensive array of services, including prescription medications, mental health support, and personal care products, tailored to meet diverse health needs. As a frontrunner in the rapidly growing telemedicine sector, Hims & Hers is poised to capitalize on the increasing consumer demand for convenient and affordable healthcare solutions, solidifying its position as a key player in the digital health arena. With a focus on service expansion and consumer-centric care, Hims & Hers is well-equipped to navigate the evolving landscape of healthcare preferences.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "SMCI": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:29 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:29 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:29 PM"
        }
      },
      "last_updated": "2026-01-16T15:29:02.098072",
      "company": {
        "name": "Super Micro Computer Inc",
        "market_cap": "$19.60B",
        "description": "Super Micro Computer, Inc. (SMCI) is a prominent provider of high-performance server and storage solutions, recognized for its innovative, open, and modular architecture. Based in San Jose, California, the company develops advanced technologies that cater to the evolving needs of data centers, cloud computing, and enterprise applications. With a strong emphasis on sustainability and efficiency, SMCI is strategically positioned to leverage the increasing demand for cutting-edge computing solutions across critical sectors such as artificial intelligence and big data analytics, making it a compelling investment opportunity for institutional investors looking to capitalize on technological advancements.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "NVTS": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:29 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:29 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:29 PM"
        }
      },
      "last_updated": "2026-01-16T15:29:10.735416",
      "company": {
        "name": "Navitas Semiconductor Corp",
        "market_cap": "$1.71B",
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PANW": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 03:36 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 03:36 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 03:36 PM"
        }
      },
      "last_updated": "2026-01-16T15:36:34.452604",
      "company": {
        "name": "Palo Alto Networks Inc",
        "market_cap": "$130.05B",
        "description": "Palo Alto Networks, Inc. (PANW) is a premier player in the cybersecurity sector, headquartered in Santa Clara, California, renowned for its cutting-edge platform that safeguards organizations from a diverse range of cyber threats through advanced firewall technologies, cloud security solutions, and AI-enhanced threat intelligence. The company serves a varied global clientele and maintains a strong commitment to enterprise security, risk management, and continuous innovation. As the cybersecurity landscape evolves and the demand for comprehensive protection intensifies, Palo Alto Networks is poised for growth, driving expansion of its product portfolio and reinforcing its status as an essential partner for organizations seeking to navigate today’s complex security challenges.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    }
  }
}