{
  "tickers": {
    "TSLA": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:30 AM"
        }
      },
      "last_updated": "2026-01-18T01:30:56.042025",
      "company": {
        "name": "Tesla Inc",
        "market_cap": "$1.42T",
        "description": "Tesla, Inc. is a leading American electric vehicle and clean energy company headquartered in Palo Alto, California, renowned for its groundbreaking innovations in sustainable transportation and energy solutions. As the market leader, Tesla commanded a 16% share of the global plug-in vehicle market and 23% of the battery-electric vehicle sector as of 2020, reflecting its commitment to pushing the boundaries of electric mobility. The company's diverse portfolio includes electric vehicles, advanced battery technology, and solar energy solutions, with Tesla Energy focusing on battery storage and solar products that enhance renewable energy integration. With strategic investments in production capacity and continued technological advancements, Tesla is well-positioned to capitalize on the accelerating global transition towards sustainable energy.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "ADI": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "cash": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "assets": {
          "updated": "Jan 18, 2026 12:15 PM"
        }
      },
      "last_updated": "2026-01-18T12:15:14.270362",
      "company": {
        "name": "Analog Devices Inc",
        "market_cap": "$136.77B",
        "description": "Analog Devices, Inc. (ADI) is a prominent American multinational semiconductor firm headquartered in Wilmington, Massachusetts, recognized for its advanced solutions in data conversion, signal processing, and power management. Specializing in high-performance analog, mixed-signal, and digital signal processing integrated circuits, ADI caters to a variety of key sectors, including automotive, industrial, communications, and consumer electronics. With a steadfast commitment to innovation and precision technology, ADI has established itself as a vital contributor in the semiconductor industry, empowering its customers to enhance product performance and energy efficiency in an increasingly competitive market.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PLTR": {
      "presets": {
        "costs": {
          "updated": "Jan 29, 2026 12:10 AM"
        },
        "revenue": {
          "updated": "Jan 29, 2026 12:10 AM"
        },
        "cash": {
          "updated": "Jan 29, 2026 12:10 AM"
        },
        "assets": {
          "updated": "Jan 29, 2026 12:10 AM"
        },
        "FCF": {
          "updated": "Jan 29, 2026 12:10 AM"
        }
      },
      "last_updated": "2026-01-29T00:10:07.103267",
      "company": {
        "name": "Palantir Technologies Inc.",
        "market_cap": "$395.10B",
        "description": "Palantir Technologies Inc. (PLTR) is a premier software provider specializing in data integration and analytics, serving a diverse range of clients across government and commercial sectors. Renowned for its platforms, Palantir Gotham and Palantir Foundry, the company enables organizations to efficiently aggregate, analyze, and visualize extensive datasets, driving critical decision-making and operational efficiency. Headquartered in Denver, Colorado, Palantir is recognized for its innovative use of advanced artificial intelligence and machine learning technologies, positioning itself as a key player in addressing complex challenges across global industries and presenting appealing investment opportunities for institutional investors.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "F": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:55.707128",
      "company": {
        "name": "Ford Motor Company",
        "market_cap": "$53.67B",
        "description": "Ford Motor Company, a pioneering force in the automotive industry since its inception in 1903, is based in Dearborn, Michigan, and offers a wide-ranging portfolio that includes trucks, SUVs, and an expanding array of electric vehicles. With a strong emphasis on electrification and digital integration, Ford is dedicated to sustainability and innovative mobility solutions. The company's established brand reputation, combined with its commitment to customer-centric design, positions it favorably for long-term growth and adaptability within the dynamic automotive landscape. Ford's strategic initiatives towards electrification and technological advancements underscore its potential to thrive in a competitive market as consumer preferences evolve.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "GOOG": {
      "presets": {
        "costs": {
          "updated": "Jan 29, 2026 12:08 AM"
        },
        "revenue": {
          "updated": "Jan 29, 2026 12:08 AM"
        },
        "cash": {
          "updated": "Jan 29, 2026 12:08 AM"
        },
        "assets": {
          "updated": "Jan 29, 2026 12:08 AM"
        },
        "FCF": {
          "updated": "Jan 29, 2026 12:08 AM"
        }
      },
      "last_updated": "2026-01-29T00:08:51.619898",
      "company": {
        "name": "Alphabet Inc Class C",
        "market_cap": "$3.89T",
        "description": "Alphabet Inc. (GOOG) is a leading American multinational conglomerate, headquartered in Mountain View, California, that emerged from Google's corporate restructuring in October 2015. As the parent company of Google and a wide range of subsidiaries, Alphabet excels in technology sectors such as search services, digital advertising, cloud computing, consumer electronics, and artificial intelligence. With robust revenue generation, the company significantly contributes to the global digital economy's evolution. Under visionary leadership from its co-founders, Alphabet is strategically positioned to spearhead innovation and expand its footprint in rapidly growing technology markets.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "HIMS": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:35 AM"
        }
      },
      "last_updated": "2026-01-18T01:35:00.051678",
      "company": {
        "name": "Hims Hers Health Inc",
        "market_cap": "$8.74B",
        "description": "Hims & Hers Health, Inc. is a leading multi-specialty telehealth platform headquartered in San Francisco, California, that revolutionizes healthcare access through its innovative technology connecting consumers with licensed healthcare professionals. The company boasts an extensive array of services, including prescription medications, mental health support, and personal care products, tailored to meet diverse health needs. As a frontrunner in the rapidly growing telemedicine sector, Hims & Hers is poised to capitalize on the increasing consumer demand for convenient and affordable healthcare solutions, solidifying its position as a key player in the digital health arena. With a focus on service expansion and consumer-centric care, Hims & Hers is well-equipped to navigate the evolving landscape of healthcare preferences.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - SPECIALTY & GENERIC"
      }
    },
    "SMCI": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:37 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:37 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:37 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:37 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:37 AM"
        }
      },
      "last_updated": "2026-01-18T01:37:41.015417",
      "company": {
        "name": "Super Micro Computer Inc",
        "market_cap": "$19.60B",
        "description": "Super Micro Computer, Inc. (SMCI) is a prominent provider of high-performance server and storage solutions, recognized for its innovative, open, and modular architecture. Based in San Jose, California, the company develops advanced technologies that cater to the evolving needs of data centers, cloud computing, and enterprise applications. With a strong emphasis on sustainability and efficiency, SMCI is strategically positioned to leverage the increasing demand for cutting-edge computing solutions across critical sectors such as artificial intelligence and big data analytics, making it a compelling investment opportunity for institutional investors looking to capitalize on technological advancements.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "NVTS": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:44.925990",
      "company": {
        "name": "Navitas Semiconductor Corp",
        "market_cap": "$1.71B",
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "PANW": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:28.593281",
      "company": {
        "name": "Palo Alto Networks Inc",
        "market_cap": "$130.05B",
        "description": "Palo Alto Networks, Inc. (PANW) is a premier player in the cybersecurity sector, headquartered in Santa Clara, California, renowned for its cutting-edge platform that safeguards organizations from a diverse range of cyber threats through advanced firewall technologies, cloud security solutions, and AI-enhanced threat intelligence. The company serves a varied global clientele and maintains a strong commitment to enterprise security, risk management, and continuous innovation. As the cybersecurity landscape evolves and the demand for comprehensive protection intensifies, Palo Alto Networks is poised for growth, driving expansion of its product portfolio and reinforcing its status as an essential partner for organizations seeking to navigate today’s complex security challenges.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "CRWD": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:51.077196",
      "company": {
        "name": "Crowdstrike Holdings Inc",
        "market_cap": "$121.31B",
        "description": "CrowdStrike Holdings, Inc. is a leading cybersecurity firm renowned for its innovative cloud-based solutions specializing in endpoint protection and cloud workload security. With a strong global presence across the United States, Europe, and Asia, CrowdStrike caters to a diverse clientele, including small businesses and Fortune 500 companies. By harnessing advanced artificial intelligence and machine learning, the company offers real-time defense against a wide range of cyber threats, serving as a critical ally for organizations in an increasingly complex digital environment. Headquartered in Sunnyvale, California, CrowdStrike stands out for its commitment to continuous innovation and its proactive approach in defending essential infrastructures against evolving cyber threats.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "KO": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:23 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:23 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:23 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:23 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:23 AM"
        }
      },
      "last_updated": "2026-01-18T01:23:17.351286",
      "company": {
        "name": "The Coca-Cola Company",
        "market_cap": "$305.43B",
        "description": "The Coca-Cola Company (KO) is a premier global beverage leader headquartered in Atlanta, Georgia, with an extensive portfolio of over 500 brands, including the iconic Coca-Cola soft drink. Operating in over 200 countries, the company has developed a comprehensive distribution network that connects it with a diverse consumer base worldwide. Coca-Cola's strategic focus on innovation and sustainability enables it to swiftly respond to changing consumer preferences, thereby ensuring its long-term resilience and growth in the competitive beverage landscape. This strong positioning and consistent performance make Coca-Cola an attractive investment opportunity for institutional investors seeking stability and enduring value in their portfolio.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "BEVERAGES - NON-ALCOHOLIC"
      }
    },
    "MCD": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:59.445819",
      "company": {
        "name": "McDonald’s Corporation",
        "market_cap": "$220.23B",
        "description": "McDonald’s Corporation (MCD) stands as a leading force in the global fast-food landscape, celebrated for its renowned Golden Arches and diverse menu options since 1940. Serving customers in over 100 countries, the company leverages a vast franchise network dedicated to quality, innovation, and exceptional customer experience. McDonald's is at the forefront of sustainability initiatives and digital transformation, adapting to shifting consumer preferences while optimizing operational efficiencies. With a strong brand presence and a proven business model, McDonald’s presents an attractive investment opportunity for institutional investors aiming for consistent growth in the evolving food service sector.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "RESTAURANTS"
      }
    },
    "SOUN": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:48.799576",
      "company": {
        "name": "SoundHound AI Inc",
        "market_cap": "$4.97B",
        "description": "SoundHound AI, Inc. is a premier provider of voice artificial intelligence solutions, enabling businesses to optimize customer engagement through intuitive conversational interfaces. Headquartered in Santa Clara, California, the company harnesses cutting-edge natural language processing and machine learning capabilities to ensure precise and context-aware interactions. As the demand for advanced voice AI technology escalates in a rapidly evolving digital marketplace, SoundHound is strategically positioned to expand its innovative product offerings and cement its leadership in the industry.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "LAC": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:44.038272",
      "company": {
        "name": "Lithium Americas Corp",
        "market_cap": "$1.55B",
        "description": "Lithium Americas Corp. (LAC) is a prominent player in the lithium mining sector, headquartered in Vancouver, Canada. With a focus on advancing key projects in North America, the company is well-positioned to meet the increasing demand for lithium, driven by the rapid growth of electric vehicles and renewable energy storage solutions. Leveraging strategic geographic advantages and innovative energy technologies, Lithium Americas is poised to play a vital role in the transition to a sustainable energy future, capitalizing on trends toward decarbonization and electrification in the global economy.",
        "sector": "BASIC MATERIALS",
        "industry": "OTHER INDUSTRIAL METALS & MINING"
      }
    },
    "SOFI": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:35 AM"
        }
      },
      "last_updated": "2026-01-18T01:35:01.191019",
      "company": {
        "name": "SoFi Technologies Inc.",
        "market_cap": "$34.36B",
        "description": "SoFi Technologies, Inc. is a prominent digital financial services provider based in San Francisco, California, focusing on a diverse range of offerings, including personal loans, student and home refinancing, investment management, and insurance solutions. By leveraging cutting-edge technology, SoFi aims to empower individuals on their journey to financial independence while enhancing the accessibility and efficiency of financial services. The company has established a comprehensive platform that integrates borrowing, investing, and community engagement, making it a holistic financial partner for its members and differentiating it in the competitive fintech landscape.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "AMZN": {
      "presets": {
        "costs": {
          "updated": "Jan 28, 2026 11:57 PM"
        },
        "revenue": {
          "updated": "Jan 28, 2026 11:57 PM"
        },
        "cash": {
          "updated": "Jan 28, 2026 11:57 PM"
        },
        "assets": {
          "updated": "Jan 28, 2026 11:57 PM"
        },
        "FCF": {
          "updated": "Jan 28, 2026 11:57 PM"
        }
      },
      "last_updated": "2026-01-28T23:57:38.700870",
      "company": {
        "name": "Amazon.com Inc",
        "market_cap": "$2.42T",
        "description": "Amazon.com, Inc. is a leading American multinational technology company, widely recognized for its dominance in e-commerce, cloud computing via Amazon Web Services (AWS), and digital streaming. As a key player among the \"Big Five\" tech giants, Amazon's innovative approach and unwavering commitment to customer-centric solutions have established it as one of the world's most valuable brands. The company remains at the forefront of technological advancement, with strategic investments in artificial intelligence and logistics, positioning itself to leverage emerging market trends and further enhance its competitive edge in the rapidly evolving digital landscape.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "INTERNET RETAIL"
      }
    },
    "ORCL": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:32.742598",
      "company": {
        "name": "Oracle Corporation",
        "market_cap": "$635.76B",
        "description": "Oracle Corporation is a leading multinational technology company based in Austin, Texas, specializing in a broad range of software products and cloud computing solutions. As a dominant force in the cloud infrastructure sector, Oracle is committed to driving digital transformation for enterprises by leveraging cutting-edge technologies, including artificial intelligence and machine learning. The company maintains a robust focus on research and development, consistently updating its portfolio to meet the evolving needs of global businesses, thereby solidifying its reputation for innovation and excellence in the technology space.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "APLD": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "cash": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 12:15 PM"
        },
        "assets": {
          "updated": "Jan 18, 2026 12:15 PM"
        }
      },
      "last_updated": "2026-01-18T12:15:43.493187",
      "company": {
        "name": "Applied Digital Corporation",
        "market_cap": "$10.53B",
        "description": "Applied Digital Corporation (APLD), headquartered in Dallas, Texas, is a leading player in the cryptocurrency mining and co-hosting sector, utilizing cutting-edge technologies to optimize the performance and scalability of its data centers. With the increasing adoption of blockchain technology and decentralized finance, APLD is well-positioned to seize growth opportunities in this dynamic market. The company's focus on innovation and high operational standards presents institutional investors with a unique chance to participate in the burgeoning digital asset ecosystem, making APLD a noteworthy investment consideration.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "MU": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:01 AM"
        }
      },
      "last_updated": "2026-01-19T10:01:11.564029",
      "company": {
        "name": "Micron Technology Inc",
        "market_cap": "$266.96B",
        "description": "Micron Technology, Inc. is a premier American manufacturer of innovative memory and storage solutions, with a pivotal role in the global semiconductor landscape. Headquartered in Boise, Idaho, the company specializes in dynamic random-access memory (DRAM), NAND flash memory, and other advanced products that cater to a diverse array of sectors, including computing, mobile, and automotive. As demand surges from trends such as artificial intelligence, data centers, and the Internet of Things, Micron's robust commitment to research and development enables it to maintain its leadership position and drive significant technological advancements in memory solutions worldwide.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "ZS": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:12.295580",
      "company": {
        "name": "Zscaler Inc",
        "market_cap": "$35.52B",
        "description": "Zscaler, Inc. is a leading cloud security provider headquartered in San Jose, California, specializing in secure internet access for applications and data. The company's innovative Zero Trust Exchange platform enables enterprises to migrate from traditional network security frameworks to a modern, cloud-native architecture, offering comprehensive defense against an array of cyber threats. As organizations accelerate their digital transformations, Zscaler is well-positioned to meet the growing demand for scalable and secure cloud solutions, reinforcing its pivotal role in shaping the future of cybersecurity.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "WMT": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:22.661176",
      "company": {
        "name": "Walmart Inc. Common Stock",
        "market_cap": "$930.43B",
        "description": "Walmart Inc. is a premier American multinational retail corporation headquartered in Bentonville, Arkansas, operating a comprehensive portfolio of hypermarkets, discount department stores, and grocery outlets, including Sam's Club. Renowned for its commitment to low prices and exceptional product diversity, Walmart effectively utilizes advanced supply chain solutions and innovative e-commerce strategies to sustain its competitive edge. The company emphasizes sustainability and digital transformation, driving operational efficiency and market expansion while significantly impacting the U.S. economy. With a focus on meeting the evolving needs of consumers, Walmart continues to lead the retail sector in both breadth and innovation.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "DISCOUNT STORES"
      }
    },
    "SNOW": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:29.539582",
      "company": {
        "name": "Snowflake Inc.",
        "market_cap": "$76.13B",
        "description": "Snowflake Inc. is a pioneering cloud-based data platform headquartered in San Mateo, California, transforming the way organizations manage and analyze data on a global scale. Its innovative architecture allows for seamless data sharing and collaboration, empowering businesses to leverage their data for advanced analytics and scalable data science solutions. Catering to a diverse client base, Snowflake leads the market in data warehousing and operational intelligence, making it a compelling investment opportunity within the dynamic technology sector. With a strong focus on agility and operational efficiency, the company is strategically positioned to capitalize on the burgeoning demand for data-driven decision-making in an evolving digital landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "PATH": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:45.871322",
      "company": {
        "name": "Uipath Inc",
        "market_cap": "$7.42B",
        "description": "UiPath Inc. (PATH) is a leading force in the robotic process automation (RPA) industry, delivering a comprehensive automation platform that enhances operational efficiency and drives digital transformation across a variety of sectors. Leveraging cutting-edge artificial intelligence and machine learning capabilities, the company is ideally placed to capitalize on the rapidly growing demand for automation solutions. With a strategic presence in key markets, including the United States, Romania, and Japan, and headquartered in New York, UiPath is well-positioned to support organizations in navigating their automation journeys effectively.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "MRVL": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:01 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:01 AM"
        }
      },
      "last_updated": "2026-01-19T10:01:33.503124",
      "company": {
        "name": "Marvell Technology Group Ltd",
        "market_cap": "$85.27B",
        "description": "Marvell Technology Group Ltd is a leading provider of infrastructure semiconductor solutions, dedicated to advancing digital transformation across networks, data centers, and enterprise storage. Headquartered in Wilmington, Delaware, the company specializes in designing cutting-edge technologies, including analog, mixed-signal, and digital signal processing integrated circuits, which serve key sectors such as cloud computing, 5G, and automotive applications. With a robust commitment to high-performance innovation, Marvell is well-positioned to capitalize on the surging demand for improved connectivity and efficient data management in today’s data-centric landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "HPE": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 06:40 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 06:40 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 06:40 PM"
        }
      },
      "last_updated": "2026-01-16T18:40:45.717398",
      "company": {
        "name": "Hewlett Packard Enterprise Co",
        "market_cap": "$29.48B",
        "description": "Hewlett Packard Enterprise Co (HPE) is a prominent American multinational technology company headquartered in Houston, Texas, specializing in delivering robust IT solutions tailored for enterprises. The company is at the forefront of hybrid cloud services, data storage, and advanced IT infrastructure, providing innovative products that drive operational efficiency and enable seamless digital transformation. With a strong focus on edge computing and intelligent data solutions, HPE positions itself as a strategic partner for businesses aiming to effectively leverage technology in a fast-evolving digital landscape, ensuring they remain competitive and responsive to market demands.",
        "sector": "TECHNOLOGY",
        "industry": "COMMUNICATION EQUIPMENT"
      }
    },
    "DELL": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:53.795211",
      "company": {
        "name": "Dell Technologies Inc",
        "market_cap": "$86.04B",
        "description": "Dell Technologies Inc. is a prominent global leader in information technology solutions, offering a diverse range of products including personal computers, servers, data storage, and cloud infrastructure. Based in Round Rock, Texas, the company is dedicated to empowering digital transformation for businesses of all sizes through innovative technologies and customer-centric services. With a strong emphasis on operational excellence and continuous innovation, Dell is well-equipped to adapt to the rapidly changing digital landscape, thereby solidifying its competitive position and expanding its market presence across multiple sectors.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "CSCO": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:52.889480",
      "company": {
        "name": "Cisco Systems Inc",
        "market_cap": "$309.84B",
        "description": "Cisco Systems, Inc. is a leading technology company based in San Jose, California, recognized for its expertise in networking hardware, software, and telecommunications solutions. With a strong emphasis on innovation in areas such as the Internet of Things (IoT) and cybersecurity, Cisco enhances enterprise communications and data security globally through its Webex platform. The company's continued focus on strategic acquisitions and significant investment in research and development solidifies its position as a key player in digital transformation and network security. By offering a comprehensive portfolio of advanced connectivity solutions, Cisco is dedicated to empowering organizations to navigate the complexities of an increasingly interconnected world.",
        "sector": "TECHNOLOGY",
        "industry": "COMMUNICATION EQUIPMENT"
      }
    },
    "AVGO": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:49.202507",
      "company": {
        "name": "Broadcom Inc",
        "market_cap": "$1.70T",
        "description": "Broadcom Inc. is a premier American technology firm that excels in semiconductor and infrastructure software solutions, serving vital sectors including data centers, networking, broadband, wireless, and storage. The company is recognized for its cutting-edge products that enhance connectivity and data processing, thereby facilitating digital transformation across diverse industries. With a strategic focus on growth through acquisitions and substantial research and development investments, Broadcom is strategically positioned to leverage emerging technologies such as 5G, cloud computing, and the Internet of Things (IoT). As a dominant player in the global semiconductor market, Broadcom is poised for sustained growth in an increasingly interconnected landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "AMAT": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:48.223964",
      "company": {
        "name": "Applied Materials Inc",
        "market_cap": "$208.14B",
        "description": "Applied Materials, Inc. (AMAT) is a leading global provider of equipment, services, and software essential for semiconductor manufacturing and advanced display technologies, headquartered in Santa Clara, California. The company plays a pivotal role in the electronics sector by enabling the production of integrated circuit chips and flat panel displays, while also making significant strides in solar energy solutions and flexible electronics. With a strong focus on innovation and technological advancement, Applied Materials is well-positioned to capitalize on the increasing demand for high-performance electronic devices and sustainable energy resources, solidifying its status as an industry leader in these critical markets.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "VZ": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:25.452571",
      "company": {
        "name": "Verizon Communications Inc",
        "market_cap": "$168.57B",
        "description": "Verizon Communications Inc. is a premier telecommunications provider headquartered in New York City and is a notable component of the Dow Jones Industrial Average. The company delivers a wide array of services, encompassing wireless and wireline voice, data, and video solutions tailored for both consumer and enterprise customers. As a leader in the deployment of 5G technology, Verizon is strategically positioned to enhance customer connectivity and drive innovation within the sector. Its ongoing investment in digital infrastructure and commitment to a customer-centric approach solidify Verizon’s status as a formidable player in the rapidly evolving telecommunications landscape, ensuring sustained growth and operational excellence.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "TELECOM SERVICES"
      }
    },
    "VRT": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:14.176699",
      "company": {
        "name": "Vertiv Holdings Co",
        "market_cap": "$68.72B",
        "description": "Vertiv Holdings Co is a premier global provider of critical digital infrastructure technologies and lifecycle services, focusing on data centers, communication networks, and industrial environments. Based in Columbus, Ohio, the company serves a wide range of clients across the Americas, EMEA, and Asia Pacific, solidifying its role as a vital partner for organizations aimed at boosting operational resilience and efficiency. Vertiv’s comprehensive portfolio of innovative solutions addresses the complexities of today’s dynamic digital landscape, ensuring that clients can adapt and excel in an increasingly interconnected world.",
        "sector": "INDUSTRIALS",
        "industry": "ELECTRICAL EQUIPMENT & PARTS"
      }
    },
    "UNH": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 12:16 PM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 12:16 PM"
        },
        "cash": {
          "updated": "Jan 18, 2026 12:16 PM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 12:16 PM"
        },
        "assets": {
          "updated": "Jan 18, 2026 12:16 PM"
        }
      },
      "last_updated": "2026-01-18T12:16:10.332457",
      "company": {
        "name": "UnitedHealth Group Incorporated",
        "market_cap": "$305.02B",
        "description": "UnitedHealth Group Incorporated is a premier American multinational managed healthcare and insurance company based in Minnetonka, Minnesota. As the largest insurance provider by net premiums and the second-largest healthcare entity by revenue, generating $257.1 billion as of 2020, UnitedHealth Group boasts a robust portfolio, with its UnitedHealthcare division contributing approximately 80% of total revenue. The company is strategically positioned to leverage the evolving healthcare landscape, demonstrating a commitment to innovation through investments in digital health, telemedicine, and data analytics, ultimately enhancing patient care while driving growth and operational efficiency.",
        "sector": "HEALTHCARE",
        "industry": "HEALTHCARE PLANS"
      }
    },
    "TTD": {
      "presets": {
        "costs": {
          "updated": "Jan 24, 2026 10:43 AM"
        },
        "revenue": {
          "updated": "Jan 24, 2026 10:43 AM"
        },
        "cash": {
          "updated": "Jan 24, 2026 10:43 AM"
        },
        "FCF": {
          "updated": "Jan 24, 2026 10:43 AM"
        },
        "assets": {
          "updated": "Jan 24, 2026 10:43 AM"
        }
      },
      "last_updated": "2026-01-24T10:43:56.824193",
      "company": {
        "name": "Trade Desk Inc",
        "market_cap": "$19.58B",
        "description": "Trade Desk, Inc. is a premier technology company based in Ventura, California, specializing in digital advertising and programmatic marketing solutions. The company's advanced platform empowers advertisers to optimize campaigns across diverse channels and devices, capitalizing on data-driven insights to enhance targeting effectiveness. As a leader in the dynamic ad tech industry, Trade Desk is well-positioned for sustained growth, serving a broad clientele of global marketers and agencies. With a strategic emphasis on innovation and analytics, Trade Desk continues to redefine the advertising landscape, making it a compelling opportunity for institutional investors.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "ADVERTISING AGENCIES"
      }
    },
    "TSM": {
      "presets": {
        "costs": {
          "updated": "Jan 16, 2026 06:41 PM"
        },
        "revenue": {
          "updated": "Jan 16, 2026 06:41 PM"
        },
        "cash": {
          "updated": "Jan 16, 2026 06:41 PM"
        }
      },
      "last_updated": "2026-01-16T18:41:37.311620",
      "company": {
        "name": "Taiwan Semiconductor Manufacturing",
        "market_cap": "$1.53T",
        "description": "Taiwan Semiconductor Manufacturing Company, Limited (TSMC) is the world's premier pure-play semiconductor foundry, recognized for its advanced manufacturing and design capabilities in integrated circuits. With its headquarters in Hsinchu, Taiwan, TSMC serves a diverse clientele, including industry leaders in smartphones, high-performance computing, and automotive sectors, underscoring its pivotal role in the global technology supply chain. The company's commitment to innovation is evidenced by substantial investments in state-of-the-art technologies, positioning it as a leader in semiconductor fabrication and facilitating critical advancements across consumer and enterprise landscapes. TSMC's strong international presence is further reflected in its predominantly foreign investor ownership, highlighting its strategic partnerships and influence in the global market.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "OSCR": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:42.210989",
      "company": {
        "name": "Oscar Health Inc",
        "market_cap": "$5.17B",
        "description": "Oscar Health, Inc. is a technology-driven health insurance provider headquartered in New York, distinguished for its innovative approach to healthcare solutions for individuals, families, and businesses across the United States. By leveraging a proprietary platform, Oscar enhances member engagement through personalized care management and streamlined access to medical services, which fosters improved health outcomes while effectively managing costs. As a leader in the intersection of technology and health insurance, Oscar Health is poised to reshape the industry dynamics, appealing to a broad base of health-conscious consumers and positioning itself as a key player in the rapidly evolving healthcare landscape.",
        "sector": "HEALTHCARE",
        "industry": "HEALTHCARE PLANS"
      }
    },
    "LHX": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:21 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:21 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:21 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:21 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:21 PM"
        }
      },
      "last_updated": "2026-01-19T16:21:36.411733",
      "company": {
        "name": "L3Harris Technologies Inc",
        "market_cap": "$63.84B",
        "description": "L3Harris Technologies Inc. (LHX) stands at the forefront of the defense and aerospace industries, delivering cutting-edge communication and electronic systems that bolster national security and enhance operational effectiveness. With a robust portfolio encompassing advanced capabilities in C6ISR, tactical communications, and next-generation avionics, L3Harris is adept at addressing the intricate challenges of modern warfare and diverse commercial applications. The company's unwavering dedication to innovation and operational excellence positions it as a key player in the dynamic geopolitical landscape, providing tailored solutions that safeguard national interests while streamlining operations for government and commercial clients alike.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "IONQ": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:43.140524",
      "company": {
        "name": "IONQ Inc",
        "market_cap": "$16.08B",
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "INTC": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:57.533794",
      "company": {
        "name": "Intel Corporation",
        "market_cap": "$217.27B",
        "description": "Intel Corporation, headquartered in Santa Clara, California, stands as the foremost semiconductor manufacturer globally, recognized for its innovative x86 microprocessors. As a critical player in the technology landscape, Intel is evolving its strategy to prioritize data-centric technologies, artificial intelligence, and cloud computing, reflecting the burgeoning demands of modern digital infrastructure. With substantial investments in research and development, the company is strategically positioned to harness emerging technologies and maintain its leadership edge in an ever-evolving market, reinforcing its pivotal role in shaping the future of computing and connectivity.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "IBM": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 11:24 AM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 11:24 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 11:24 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 11:24 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 11:24 AM"
        }
      },
      "last_updated": "2026-01-19T11:24:40.988427",
      "company": {
        "name": "International Business Machines",
        "market_cap": "$282.87B",
        "description": "International Business Machines Corporation (IBM) is a prominent American multinational technology company headquartered in Armonk, New York, with operations spanning over 170 countries. Established in 1911, IBM has established itself as a leader in innovation through its diverse offerings in hardware, software, and consulting services, with an increasing emphasis on artificial intelligence, quantum computing, and cloud solutions. The company is recognized for its strong research capabilities, having achieved the distinction of securing the most annual U.S. patents for 28 consecutive years, reflecting its dedication to pioneering technology. With a legacy that includes groundbreaking inventions like the ATM and relational database, IBM continues to evolve and play a critical role in advancing technological solutions across various sectors, adapting to the ever-changing digital landscape.",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "HOOD": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:35 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:35 AM"
        }
      },
      "last_updated": "2026-01-18T01:35:02.176363",
      "company": {
        "name": "Robinhood Markets Inc",
        "market_cap": "$115.54B",
        "description": "None",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "HII": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:56.632333",
      "company": {
        "name": "Huntington Ingalls Industries Inc",
        "market_cap": "$16.15B",
        "description": "Huntington Ingalls Industries Inc. (HII) is the leading military shipbuilding firm in the United States, specializing in the design, construction, and maintenance of surface combatants, submarines, and amphibious assault ships. As a key player in the defense sector, HII supports national security and maritime operations while also providing diverse professional services to government and commercial clients. The company’s emphasis on advanced engineering, innovation, and sustainability positions it favorably in a robust defense market, making HII an attractive investment option for institutional investors looking for stability and long-term growth potential.",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "GM": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:16 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:16 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:16 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:16 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:16 PM"
        }
      },
      "last_updated": "2026-01-19T12:16:15.660727",
      "company": {
        "name": "General Motors Company",
        "market_cap": "$78.40B",
        "description": "General Motors Company (NYSE: GM) is a premier American automotive manufacturer headquartered in Detroit, recognized for its diverse portfolio of renowned brands, including Chevrolet, Cadillac, GMC, and Buick. Embracing a transformative shift towards electric and autonomous vehicles, GM is steadfast in its commitment to sustainability and innovation, effectively positioning itself for the future of mobility. The company strategically invests in advanced technologies and continues to enhance its mobility solutions, ensuring its market leadership amidst evolving consumer demands and global trends towards greener transportation. With a robust global presence and a dynamic financial services division, GM is poised to capitalize on emerging market opportunities and maintain its competitive edge in the automotive industry.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "CRWV": {
      "presets": {
        "costs": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "revenue": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "cash": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "FCF": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "assets": {
          "updated": "Jan 28, 2026 12:14 AM"
        }
      },
      "last_updated": "2026-01-28T00:14:16.006087",
      "company": {
        "name": "CoreWeave, Inc. Class A Common Stock",
        "market_cap": "$60.14B",
        "description": "CoreWeave, Inc. (Ticker: CRWV) is a leading cloud infrastructure provider based in Livingston, New Jersey, specializing in high-performance computing solutions designed for generative AI applications. The company offers scalable and efficient computational resources that enable developers and enterprises to fully leverage the transformative capabilities of artificial intelligence. By prioritizing innovation and exceptional customer support, CoreWeave is well-positioned to capitalize on the surging demand for advanced computing power in the rapidly evolving AI landscape, driving substantial growth and value for its investors.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "DDOG": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:11.279606",
      "company": {
        "name": "Datadog Inc",
        "market_cap": "$46.86B",
        "description": "Datadog, Inc. is a premier provider of cloud-based observability solutions that enhance application performance and operational efficiency for developers and IT teams. With its robust platform offering real-time insights across extensive technology stacks, Datadog enables organizations to effectively monitor their cloud environments and improve infrastructure visibility. Headquartered in New York, the company is strategically positioned in the burgeoning observability market and caters to a diverse global clientele. By emphasizing scalability and innovation, Datadog remains a vital partner for enterprises undertaking digital transformation initiatives, solidifying its role in the evolving digital landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "CEG": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:15.084922",
      "company": {
        "name": "Constellation Energy Corp",
        "market_cap": "$113.83B",
        "description": "Constellation Energy Corporation (CEG), headquartered in Baltimore, Maryland, stands as a prominent leader in the U.S. energy sector, primarily focusing on clean and reliable energy solutions through its extensive investments in nuclear and renewable sources. The company is dedicated to sustainability and innovation, adeptly positioning itself to address the increasing demand for environmentally responsible energy as the market evolves. With a diverse portfolio that spans generation and retail services, Constellation Energy is strategically poised to leverage emerging opportunities and navigate the dynamic landscape of the energy industry.",
        "sector": "UTILITIES",
        "industry": "UTILITIES - INDEPENDENT POWER PRODUCERS"
      }
    },
    "CDNS": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:49.788345",
      "company": {
        "name": "Cadence Design Systems Inc",
        "market_cap": "$84.97B",
        "description": "Cadence Design Systems, Inc. (CDNS), based in San Jose, California, is a leading provider of electronic design automation (EDA) software and engineering services that drive advancements in semiconductor innovation. The company offers a wide range of solutions tailored for integrated circuit design, system on chip (SoC) development, and printed circuit board (PCB) design, enabling clients to significantly increase productivity and reduce time-to-market. By leveraging advanced technologies, including artificial intelligence and machine learning, Cadence enhances design processes and performance, positioning itself as an essential partner for organizations navigating the complexities of modern electronic design challenges.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "ASML": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:17.008500",
      "company": {
        "name": "ASML Holding NV ADR",
        "market_cap": "$422.23B",
        "description": "ASML Holding NV is a leading supplier of advanced semiconductor manufacturing equipment, specializing in cutting-edge lithography systems essential for the production of memory and logic chips. Headquartered in Veldhoven, Netherlands, the company is instrumental in the semiconductor supply chain, particularly through its pioneering extreme ultraviolet (EUV) lithography technology that enhances chip performance and efficiency. With a steadfast commitment to innovation and strategic partnerships with major semiconductor manufacturers, ASML is ideally positioned to benefit from the growing demand for high-performance computing solutions and the ongoing digital transformation across various industries.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTOR EQUIPMENT & MATERIALS"
      }
    },
    "ARM": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:15.983143",
      "company": {
        "name": "Arm Holdings plc American Depositary Shares",
        "market_cap": "$119.98B",
        "description": "Arm Holdings plc is a leading technology company recognized for its innovative design and licensing of CPU architecture, crucial for semiconductor and OEMs across various electronic devices. With a robust portfolio of advanced designs, Arm enables its partners to create energy-efficient, high-performance processors that are pivotal in accelerating advancements in smartphones, servers, and other electronics. As a key contributor to the semiconductor ecosystem, Arm's intellectual property is vital for progressing technologies such as artificial intelligence, the Internet of Things (IoT), and automotive applications, positioning the company for significant growth amidst increasing global connectivity.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "ANET": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:13.228904",
      "company": {
        "name": "Arista Networks",
        "market_cap": "$161.93B",
        "description": "Arista Networks, headquartered in Santa Clara, California, is a leading provider of software-defined networking (SDN) solutions, renowned for its high-performance, multilayer network switches tailored for large data centers, cloud environments, and high-frequency trading. The company's innovative approach and strong emphasis on technological advancement position it to effectively meet the growing demand for sophisticated networking infrastructure in an increasingly digital world. Arista's dedication to exceptional performance, scalability, and reliability underscores its strategic importance in the networking sector, making it an attractive investment for institutional investors aiming to capitalize on the digital transformation trend.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "META": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:30 AM"
        }
      },
      "last_updated": "2026-01-18T01:30:59.796450",
      "company": {
        "name": "Meta Platforms Inc.",
        "market_cap": "$1.62T",
        "description": "Meta Platforms, Inc. is a leading technology firm based in Menlo Park, California, renowned for transforming social connectivity through its flagship platforms, including Facebook, Instagram, and WhatsApp. Pioneering developments in virtual and augmented reality via its Reality Labs division, Meta is at the forefront of the metaverse, exploring innovative consumer engagement avenues. By significantly investing in immersive technologies, the company not only attracts a large, diverse user base but also enhances its advertising revenue, thereby reinforcing its position as a dominant force in the rapidly evolving digital landscape.",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    },
    "NVDA": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:30 AM"
        }
      },
      "last_updated": "2026-01-18T01:30:57.961304",
      "company": {
        "name": "NVIDIA Corporation",
        "market_cap": "$4.32T",
        "description": "NVIDIA Corporation is a prominent American multinational technology firm based in Santa Clara, California, recognized for its leadership in the design and manufacturing of advanced graphics processing units (GPUs) for gaming and professional markets. The company is at the cutting edge of AI and visual computing technologies, developing critical solutions such as System on a Chip (SoC) products that enhance mobile computing and automotive applications, particularly in the expanding field of autonomous driving. With a diverse portfolio that encompasses gaming, data centers, and AI infrastructure, NVIDIA is committed to delivering innovative products and services that meet the demands of a dynamic technology landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "MSFT": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:31 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:31 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:31 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:31 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:31 AM"
        }
      },
      "last_updated": "2026-01-18T01:31:01.692712",
      "company": {
        "name": "Microsoft Corporation",
        "market_cap": "$3.66T",
        "description": "Microsoft Corporation is a leading American multinational technology firm, celebrated for its diverse portfolio that encompasses operating systems, productivity software, and hardware solutions. Renowned for its Windows OS and Office suite, Microsoft also maintains a strong footprint in the gaming sector with the Xbox brand and in hardware through its Surface devices. A key player in digital transformation, the company capitalizes on its Azure cloud computing services to boost productivity and foster innovation across various industries. With a solid market position and a steadfast commitment to research and development, Microsoft continues to play a crucial role in advancing the global technology landscape.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "AAPL": {
      "presets": {
        "costs": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "revenue": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 01:30 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 01:30 AM"
        }
      },
      "last_updated": "2026-01-18T01:30:58.886938",
      "company": {
        "name": "Apple Inc",
        "market_cap": "$4.12T",
        "description": "Apple Inc. is a leading American multinational technology company that specializes in innovative consumer electronics, software, and online services. With a record revenue of $274.5 billion in 2020, it holds the title of the world's most valuable publicly traded company and is a dominant force in the global technology landscape. Its flagship products, such as the iPhone, iPad, and Mac, have cemented its reputation as a trailblazer in the sector, positioning it as the fourth-largest PC vendor and smartphone manufacturer worldwide. As a cornerstone of the \"Big Five\" technology companies, Apple continues to set industry standards and drive advancements in technology and consumer engagement.",
        "sector": "TECHNOLOGY",
        "industry": "CONSUMER ELECTRONICS"
      }
    },
    "RGTI": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:26 PM"
        }
      },
      "last_updated": "2026-01-19T12:26:47.736132",
      "company": {
        "name": "Rigetti Computing Inc",
        "market_cap": "$8.44B",
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "QUBT": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:36 PM"
        }
      },
      "last_updated": "2026-01-19T12:36:27.367799",
      "company": {
        "name": "Quantum Computing Inc",
        "market_cap": "$2.57B",
        "description": "Quantum Computing, Inc. is an innovative technology firm based in Leesburg, Virginia, focused on advancing the field of quantum computing through the development of sophisticated software applications and tools. The company aims to facilitate the widespread adoption of quantum technologies across diverse sectors such as finance, pharmaceuticals, and cybersecurity, addressing complex computational challenges with greater efficiency. With a robust commitment to research and development, Quantum Computing, Inc. is strategically positioned to emerge as a leader in delivering practical quantum solutions, thereby unlocking the transformative potential inherent in quantum systems.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "SERV": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:31.855768",
      "company": {
        "name": "Serve Robotics Inc. Common Stock",
        "market_cap": "$910.19M",
        "description": "Serve Robotics Inc. (SERV) is a pioneering technology firm specializing in low-emission delivery robots aimed at transforming food delivery logistics in urban settings across the United States. Headquartered in Redwood City, California, the company leverages cutting-edge automation to deliver efficient and sustainable services, addressing the growing consumer demand for environmentally friendly solutions. With a strategic focus on the intersection of robotics and sustainability, Serve Robotics represents a compelling investment opportunity for institutional investors looking to capitalize on the future of eco-conscious logistics and urban mobility.",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "STLA": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:26.957938",
      "company": {
        "name": "Stellantis NV",
        "market_cap": "$31.92B",
        "description": "Stellantis NV, headquartered in Lijnden, Netherlands, is a prominent global automotive manufacturer formed by the merger of Fiat Chrysler Automobiles and PSA Group. The company features a diversified portfolio of well-known brands, offering a range of passenger cars, trucks, SUVs, and light commercial vehicles, while prioritizing innovation and sustainability. Stellantis is proactively advancing its electric and connected vehicle initiatives, aligning with market trends and consumer demands. As the automotive industry faces transformative changes, Stellantis is dedicated to enhancing mobility through advanced technologies and optimizing operational efficiencies, positioning itself for sustainable long-term growth.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "AUTO MANUFACTURERS"
      }
    },
    "MO": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:26 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:26 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:26 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:26 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:26 PM"
        }
      },
      "last_updated": "2026-01-19T16:26:00.420983",
      "company": {
        "name": "Altria Group",
        "market_cap": "$98.59B",
        "description": "Altria Group, Inc. is a leading American tobacco company based in Henrico County, Virginia, renowned for its portfolio of iconic brands such as Marlboro, and its significant presence in the smokeless tobacco segment. As a major player in the global tobacco market, Altria is actively pivoting towards reduced-risk alternatives by investing in e-vapor and heated tobacco technologies. The company's robust focus on innovation, regulatory adherence, and sustainable practices positions it advantageously to navigate the evolving tobacco landscape and meet the increasing consumer demand for safer product options. Through these strategic initiatives, Altria aims to redefine its role in the tobacco industry while prioritizing public health and shareholder value.",
        "sector": "CONSUMER DEFENSIVE",
        "industry": "TOBACCO"
      }
    },
    "EBAY": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:54.698356",
      "company": {
        "name": "eBay Inc",
        "market_cap": "$43.90B",
        "description": "eBay Inc. is a leading American e-commerce platform headquartered in San Jose, California, established in 1995. Renowned for its innovative marketplace, eBay facilitates seamless transactions between consumers and businesses through various selling formats, including auctions and fixed-price listings. With millions of active users worldwide, the platform fosters a vibrant community and prioritizes user experience and security. As eBay adapts to shifting market dynamics and technological advancements, it remains well-positioned for sustained growth in the competitive e-commerce sector, driving value for institutional investors.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "INTERNET RETAIL"
      }
    },
    "ADBE": {
      "presets": {
        "costs": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "revenue": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:26 AM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:26 AM"
        }
      },
      "last_updated": "2026-01-20T00:26:35.237181",
      "company": {
        "name": "Adobe Systems Incorporated",
        "market_cap": "$151.20B",
        "description": "Adobe Systems Incorporated is a leading American multinational software company headquartered in San Jose, California, distinguished for its pioneering role in digital media and marketing solutions. Renowned for its flagship products such as Adobe Photoshop, Illustrator, and Acrobat, Adobe serves as an indispensable ally to creative professionals and businesses worldwide. The company has strategically expanded its offerings with Adobe Experience Cloud, which provides a robust suite of tools designed to enhance customer engagement and optimize marketing strategies. Leveraging advancements in artificial intelligence and cloud technology, Adobe is positioned to maintain its competitive edge in a rapidly evolving digital landscape, supported by a substantial and diverse global user base.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "CRM": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:50.137916",
      "company": {
        "name": "Salesforce.com Inc",
        "market_cap": "$247.43B",
        "description": "Salesforce.com, Inc. (CRM) is a leading provider of cloud-based Customer Relationship Management (CRM) solutions, headquartered in San Francisco. The company offers a comprehensive suite of enterprise applications designed to enhance customer engagement through customer service, marketing automation, and advanced analytics. Renowned for its innovative integration of artificial intelligence and data analytics, Salesforce stands at the forefront of the cloud computing industry, consistently delivering sustainable growth for its clients. Its strategic acquisitions and continuous platform enhancements reinforce its commanding position in the enterprise software market, positioning Salesforce as an essential partner for organizations pursuing success in the digital era.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "JNJ": {
      "presets": {
        "costs": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "revenue": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 04:25 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 04:25 PM"
        }
      },
      "last_updated": "2026-01-19T16:25:58.478566",
      "company": {
        "name": "Johnson & Johnson",
        "market_cap": "$526.82B",
        "description": "Johnson & Johnson (JNJ), founded in 1886, is a premier American multinational corporation at the forefront of the global healthcare sector, acclaimed for its diversified product offerings in pharmaceuticals, medical devices, and consumer health products. With an unwavering commitment to innovation and quality, JNJ has established a robust financial profile, highlighted by its AAA credit rating and consistent presence on the Dow Jones Industrial Average. Ranked 36th on the Fortune 500 list, the company is strategically positioned to leverage emerging opportunities in the dynamic healthcare landscape while focusing on sustainable growth and long-term value creation for its stakeholders.",
        "sector": "HEALTHCARE",
        "industry": "DRUG MANUFACTURERS - GENERAL"
      }
    },
    "BE": {
      "presets": {
        "revenue": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "costs": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 10:50 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 10:50 AM"
        }
      },
      "last_updated": "2026-01-18T10:50:10.317076",
      "company": {
        "name": "Bloom Energy Corp",
        "market_cap": "$31.56B",
        "description": "Bloom Energy Corporation, based in San Jose, California, is a leader in solid oxide fuel cell technology, providing innovative on-site clean power generation solutions across multiple global markets including the U.S., Japan, China, India, and South Korea. The company plays a crucial role in the transition to sustainable energy, aiming to reduce reliance on fossil fuels and enhance operational efficiencies through its advanced energy systems. With a strong focus on innovation and sustainability, Bloom Energy is well-positioned to capitalize on the rising demand for renewable energy technologies, presenting a compelling investment opportunity for institutional investors committed to energy diversification and environmental responsibility.",
        "sector": "INDUSTRIALS",
        "industry": "ELECTRICAL EQUIPMENT & PARTS"
      }
    },
    "SYM": {
      "presets": {
        "revenue": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "costs": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "cash": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "FCF": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "assets": {
          "updated": "Jan 28, 2026 12:14 AM"
        }
      },
      "last_updated": "2026-01-28T00:14:15.082814",
      "company": {
        "name": "Symbotic Inc",
        "market_cap": "$41.30B",
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "ROK": {
      "presets": {
        "revenue": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "costs": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "cash": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "FCF": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "assets": {
          "updated": "Jan 28, 2026 12:14 AM"
        }
      },
      "last_updated": "2026-01-28T00:14:14.121155",
      "company": {
        "name": "Rockwell Automation Inc",
        "market_cap": "$46.87B",
        "description": "Rockwell Automation, Inc. (Ticker: ROK) is a premier global provider of industrial automation and information technology solutions, dedicated to enhancing operational efficiency and productivity across diverse sectors including manufacturing, infrastructure, and logistics. Renowned for its innovative offerings, such as the Allen-Bradley line of programmable automation controllers and FactoryTalk software, the company empowers organizations to harness data for operational excellence. Rockwell's strategic emphasis on the Internet of Things (IoT) and smart manufacturing places it at the vanguard of digital transformation, positioning the company for sustainable growth while delivering significant value to its shareholders.",
        "sector": "INDUSTRIALS",
        "industry": "SPECIALTY INDUSTRIAL MACHINERY"
      }
    },
    "UPST": {
      "presets": {
        "revenue": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "costs": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 11:08 AM"
        }
      },
      "last_updated": "2026-01-18T11:08:04.652163",
      "company": {
        "name": "Upstart Holdings Inc",
        "market_cap": "$4.68B",
        "description": "Upstart Holdings, Inc. is an innovative fintech company based in San Mateo, California, revolutionizing the personal lending industry through its cutting-edge cloud-based artificial intelligence platform. By leveraging sophisticated machine learning algorithms, Upstart significantly optimizes the credit decision-making process, leading to higher loan approval rates, lower consumer borrowing costs, and enhanced risk assessment for lenders. This disruptive model not only redefines traditional lending norms but also establishes Upstart as a frontrunner in the rapidly growing AI-powered financial services sector, adeptly addressing the dynamic requirements of both borrowers and financial institutions.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "ACHR": {
      "presets": {
        "revenue": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "costs": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 11:08 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 11:08 AM"
        }
      },
      "last_updated": "2026-01-18T11:08:05.541650",
      "company": {
        "name": "Archer Aviation Inc",
        "market_cap": "$6.50B",
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "AEROSPACE & DEFENSE"
      }
    },
    "CYBN": {
      "presets": {
        "revenue": {
          "updated": "Jan 18, 2026 11:16 AM"
        },
        "costs": {
          "updated": "Jan 18, 2026 11:16 AM"
        },
        "cash": {
          "updated": "Jan 18, 2026 11:16 AM"
        },
        "FCF": {
          "updated": "Jan 18, 2026 11:16 AM"
        },
        "assets": {
          "updated": "Jan 18, 2026 11:16 AM"
        }
      },
      "last_updated": "2026-01-18T11:16:05.038157",
      "company": {
        "name": "Cybin Inc",
        "market_cap": "$413.12M",
        "description": "None",
        "sector": "HEALTHCARE",
        "industry": "BIOTECHNOLOGY"
      }
    },
    "MP": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "costs": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:12 AM"
        }
      },
      "last_updated": "2026-01-19T10:12:06.077125",
      "company": {
        "name": "MP Materials Corp",
        "market_cap": "$12.23B",
        "description": "MP Materials Corp. is the leading domestic producer of rare earth materials in North America, headquartered in Las Vegas, Nevada. The company plays a critical role in the supply chain for advanced technologies, particularly within the electric vehicle and renewable energy sectors, by providing high-purity rare earth oxides essential for the production of modern electronics and clean energy solutions. With a robust commitment to domestic supply chain enhancement and national security, MP Materials employs proprietary technologies that bolster its competitive advantages. As global demand for sustainable materials intensifies, MP Materials is strategically positioned to benefit from the shift towards a greener economy, making it a key player in the transition to renewable energy and electric mobility.",
        "sector": "BASIC MATERIALS",
        "industry": "OTHER INDUSTRIAL METALS & MINING"
      }
    },
    "AFRM": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "costs": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:12 AM"
        }
      },
      "last_updated": "2026-01-19T10:12:07.145107",
      "company": {
        "name": "Affirm Holdings Inc",
        "market_cap": "$24.68B",
        "description": "Affirm Holdings, Inc. is a prominent financial technology company headquartered in San Francisco, California, focused on providing innovative point-of-sale financing and buy now, pay later (BNPL) solutions across the U.S. and Canada. By enhancing consumer purchasing power and advocating for responsible spending practices, Affirm facilitates seamless integrations with merchants, thereby optimizing conversion rates and driving sales growth. As e-commerce continues to evolve, Affirm’s differentiated financing solutions are not only transforming consumer payment experiences but are also reinforcing transparency in credit access, cementing its role as a key player in the retail industry's digital transformation.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CREDIT SERVICES"
      }
    },
    "AISP": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "costs": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:12 AM"
        }
      },
      "last_updated": "2026-01-19T10:12:08.070362",
      "company": {
        "name": "Airship AI Holdings Inc",
        "market_cap": "$147.64M",
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "HUBC": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "costs": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:12 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:12 AM"
        }
      },
      "last_updated": "2026-01-19T10:12:09.016050",
      "company": {
        "name": "Hub Cyber Security Ltd. Ordinary Shares",
        "market_cap": "$10.18M",
        "description": "Hub Cyber Security Ltd. (HUBC), headquartered in Tel Aviv, is a leading provider of cutting-edge cybersecurity solutions, catering to enterprises, government agencies, and financial institutions worldwide. The company specializes in protecting sensitive data and critical infrastructure, leveraging its innovative technologies and extensive industry experience to navigate the complex and ever-changing cyber threat landscape. HUBC's commitment to enhancing cyber resilience positions it as an indispensable ally for organizations seeking to safeguard their digital assets in an increasingly interconnected world. With its strategic focus and expertise, HUBC is well-positioned to play a pivotal role in the global cybersecurity sector.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "MDB": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 10:49 AM"
        },
        "costs": {
          "updated": "Jan 19, 2026 10:49 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:49 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:49 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:49 AM"
        }
      },
      "last_updated": "2026-01-19T10:49:01.510325",
      "company": {
        "name": "MongoDB",
        "market_cap": "$32.54B",
        "description": "MongoDB, Inc. is a leading provider of modern, document-oriented database solutions, headquartered in New York, NY. The company’s platform excels in delivering real-time data access, scalability, and flexibility, making it indispensable for organizations facing the demands of the digital landscape. As cloud adoption continues to rise and the need for sophisticated data management solutions grows, MongoDB is strategically positioned to capitalize on significant market opportunities. Its commitment to innovation and its comprehensive suite of technology offerings enhance its appeal as a critical investment for institutional investors focused on the future of information management.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - INFRASTRUCTURE"
      }
    },
    "STX": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 10:52 AM"
        },
        "costs": {
          "updated": "Jan 19, 2026 10:52 AM"
        },
        "cash": {
          "updated": "Jan 19, 2026 10:52 AM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 10:52 AM"
        },
        "assets": {
          "updated": "Jan 19, 2026 10:52 AM"
        }
      },
      "last_updated": "2026-01-19T10:52:39.064484",
      "company": {
        "name": "Seagate Technology PLC",
        "market_cap": "$71.09B",
        "description": "Seagate Technology PLC, headquartered in Ireland, stands as a premier global leader in data storage solutions, focusing on both hard disk drives (HDDs) and cutting-edge flash storage technologies. With a strategic foothold in rapidly expanding markets such as cloud computing, big data, and the Internet of Things (IoT), Seagate is well-positioned to meet the surging demand for data storage. The company emphasizes sustainability and innovation through ongoing research and development, complemented by strategic alliances that enhance its competitive edge. For institutional investors, Seagate presents a notable opportunity to engage with the burgeoning data economy, bolstered by its solid market positioning and a comprehensive portfolio of advanced storage solutions.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "KDFJ": {
      "presets": {
        "revenue": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "costs": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "cash": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "FCF": {
          "updated": "Jan 19, 2026 12:36 PM"
        },
        "assets": {
          "updated": "Jan 19, 2026 12:36 PM"
        }
      },
      "last_updated": "2026-01-19T12:36:54.489073"
    },
    "QBTS": {
      "presets": {
        "revenue": {
          "updated": "Jan 20, 2026 12:16 PM"
        },
        "costs": {
          "updated": "Jan 20, 2026 12:16 PM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:16 PM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:16 PM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:16 PM"
        }
      },
      "last_updated": "2026-01-20T12:16:44.748486",
      "company": {
        "name": "D-Wave Quantum Inc.",
        "market_cap": "$10.44B",
        "description": "D-Wave Quantum Inc. is a trailblazer in the quantum computing landscape, dedicated to delivering advanced quantum systems, software, and robust support services tailored to solve intricate computational problems. Based in Burnaby, Canada, the company is committed to fostering the integration of quantum technology across diverse industries, including optimization, machine learning, and artificial intelligence. With a unique strategic vision and a diverse array of innovative solutions, D-Wave is well-positioned to reshape the future of computing, driving transformative advancements while setting new benchmarks for the industry through its state-of-the-art quantum technologies.",
        "sector": "TECHNOLOGY",
        "industry": "COMPUTER HARDWARE"
      }
    },
    "TEM": {
      "presets": {
        "revenue": {
          "updated": "Jan 20, 2026 12:34 PM"
        },
        "costs": {
          "updated": "Jan 20, 2026 12:34 PM"
        },
        "cash": {
          "updated": "Jan 20, 2026 12:34 PM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 12:34 PM"
        },
        "assets": {
          "updated": "Jan 20, 2026 12:34 PM"
        }
      },
      "last_updated": "2026-01-20T12:34:02.953111",
      "company": {
        "name": "Tempus AI, Inc. Class A Common Stock",
        "market_cap": "$12.51B",
        "description": "Tempus AI, Inc. (Ticker: TEM) is a pioneering healthcare technology firm headquartered in Chicago, Illinois, committed to enhancing medical decision-making through the integration of artificial intelligence and advanced data analytics. By combining genomic sequencing with extensive clinical data, Tempus is at the forefront of precision medicine, particularly in oncology, ultimately aiming to improve patient outcomes significantly. With the healthcare industry increasingly embracing technology-driven solutions, Tempus's innovative platform and strategic focus on transforming healthcare practices make it an attractive investment opportunity for institutional investors seeking to leverage growth in this dynamic sector.",
        "sector": "HEALTHCARE",
        "industry": "HEALTH INFORMATION SERVICES"
      }
    },
    "HYMC": {
      "presets": {
        "revenue": {
          "updated": "Jan 20, 2026 03:14 PM"
        },
        "costs": {
          "updated": "Jan 20, 2026 03:14 PM"
        },
        "cash": {
          "updated": "Jan 20, 2026 03:14 PM"
        },
        "FCF": {
          "updated": "Jan 20, 2026 03:14 PM"
        },
        "assets": {
          "updated": "Jan 20, 2026 03:14 PM"
        }
      },
      "last_updated": "2026-01-20T15:14:44.140470",
      "company": {
        "name": "Hycroft Mining Holding Corporation",
        "market_cap": "$2.88B",
        "description": "Hycroft Mining Holding Corporation is a growing gold and silver producer headquartered in Denver, Colorado, primarily focused on its flagship Hycroft Mine located in Nevada. This strategically positioned asset is underpinned by substantial mineral resources and is poised to capitalize on the increasing global demand for precious metals. Committed to sustainable mining practices and operational efficiency, Hycroft aims to enhance its exploration and production capabilities, thereby delivering long-term value to shareholders while contributing positively to the mining sector.",
        "sector": "BASIC MATERIALS",
        "industry": "GOLD"
      }
    },
    "ZM": {
      "presets": {
        "revenue": {
          "updated": "Jan 21, 2026 02:37 PM"
        },
        "costs": {
          "updated": "Jan 21, 2026 02:37 PM"
        },
        "cash": {
          "updated": "Jan 21, 2026 02:37 PM"
        },
        "FCF": {
          "updated": "Jan 21, 2026 02:37 PM"
        },
        "assets": {
          "updated": "Jan 21, 2026 02:37 PM"
        }
      },
      "last_updated": "2026-01-21T14:37:02.178704",
      "company": {
        "name": "Zoom Video Communications Inc",
        "market_cap": "$24.34B",
        "description": "Zoom Video Communications, Inc. (ZM), headquartered in San Jose, California, is a prominent provider of advanced video communication solutions that cater to a diverse global clientele. Particularly renowned for its user-friendly platform that facilitates video conferencing, webinars, and collaborative tools, Zoom has solidified its position in the market during the accelerated shift towards remote work and digital collaboration. With a strong commitment to innovation and reliability, the company is well-positioned to capitalize on the increasing demand for seamless communication technologies, addressing the evolving needs of organizations across North America, Europe, and Asia Pacific. As enterprises prioritize efficient, scalable communication solutions, Zoom's expertise and strategic focus are set to drive continued growth and market leadership.",
        "sector": "TECHNOLOGY",
        "industry": "SOFTWARE - APPLICATION"
      }
    },
    "ALH-SEC": {
      "presets": {
        "revenue": {
          "updated": "Jan 21, 2026 05:16 PM"
        },
        "costs": {
          "updated": "Jan 21, 2026 05:16 PM"
        },
        "assets": {
          "updated": "Jan 21, 2026 05:16 PM"
        }
      },
      "last_updated": "2026-01-21T17:16:16.174477",
      "company": {
        "name": "ALLIANCE LAUNDRY HOLDINGS INC.",
        "market_cap": "N/A",
        "description": "Financial data from SEC EDGAR for ALLIANCE LAUNDRY HOLDINGS INC.",
        "sector": "",
        "industry": ""
      }
    },
    "SRFM": {
      "presets": {
        "revenue": {
          "updated": "Jan 21, 2026 11:00 PM"
        },
        "costs": {
          "updated": "Jan 21, 2026 11:00 PM"
        },
        "cash": {
          "updated": "Jan 21, 2026 11:00 PM"
        },
        "FCF": {
          "updated": "Jan 21, 2026 11:00 PM"
        },
        "assets": {
          "updated": "Jan 21, 2026 11:00 PM"
        }
      },
      "last_updated": "2026-01-21T23:00:22.142656",
      "company": {
        "name": "Surf Air Mobility Inc.",
        "market_cap": "$164.38M",
        "description": "None",
        "sector": "INDUSTRIALS",
        "industry": "AIRLINES"
      }
    },
    "BKE": {
      "presets": {
        "revenue": {
          "updated": "Jan 23, 2026 02:18 PM"
        },
        "costs": {
          "updated": "Jan 23, 2026 02:18 PM"
        },
        "cash": {
          "updated": "Jan 23, 2026 02:18 PM"
        },
        "FCF": {
          "updated": "Jan 23, 2026 02:18 PM"
        },
        "assets": {
          "updated": "Jan 23, 2026 02:18 PM"
        }
      },
      "last_updated": "2026-01-23T14:18:46.781084",
      "company": {
        "name": "Buckle Inc",
        "market_cap": "$2.70B",
        "description": "Buckle, Inc. (BKE) is a leading specialty retailer in the U.S. focused on casual apparel, footwear, and accessories for the young adult demographic. Headquartered in Kearney, Nebraska, the company operates an extensive network of stores that enhance the shopping experience through a curated selection of both recognized brands and its own proprietary labels. Buckle's dedication to high-quality products and exceptional customer service cultivates strong brand loyalty, positioning the company for continued growth in a competitive retail environment as consumer preferences evolve.",
        "sector": "CONSUMER CYCLICAL",
        "industry": "APPAREL RETAIL"
      }
    },
    "BBAI": {
      "presets": {
        "revenue": {
          "updated": "Jan 24, 2026 12:12 AM"
        },
        "costs": {
          "updated": "Jan 24, 2026 12:12 AM"
        },
        "cash": {
          "updated": "Jan 24, 2026 12:12 AM"
        },
        "FCF": {
          "updated": "Jan 24, 2026 12:12 AM"
        },
        "assets": {
          "updated": "Jan 24, 2026 12:12 AM"
        }
      },
      "last_updated": "2026-01-24T00:12:13.502444",
      "company": {
        "name": "BigBearai Holdings Inc",
        "market_cap": "$2.63B",
        "description": "None",
        "sector": "TECHNOLOGY",
        "industry": "INFORMATION TECHNOLOGY SERVICES"
      }
    },
    "MARA": {
      "presets": {
        "revenue": {
          "updated": "Jan 24, 2026 01:49 AM"
        },
        "costs": {
          "updated": "Jan 24, 2026 01:49 AM"
        },
        "cash": {
          "updated": "Jan 24, 2026 01:49 AM"
        },
        "FCF": {
          "updated": "Jan 24, 2026 01:49 AM"
        },
        "assets": {
          "updated": "Jan 24, 2026 01:49 AM"
        }
      },
      "last_updated": "2026-01-24T01:49:04.523170",
      "company": {
        "name": "Marathon Digital Holdings Inc",
        "market_cap": "$4.47B",
        "description": "Marathon Digital Holdings, Inc. is a leading cryptocurrency mining company headquartered in Las Vegas, Nevada, that plays a critical role in the blockchain ecosystem. Leveraging cutting-edge technology and operational efficiency, Marathon seeks to maximize its mining output while effectively managing costs in the volatile cryptocurrency market. The company's focus on strategic partnerships and sustainable practices positions it well to capitalize on the burgeoning demand for digital assets and decentralized finance solutions, solidifying its status as a pivotal player in the industry.",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "AMD": {
      "presets": {
        "revenue": {
          "updated": "Jan 24, 2026 01:43 AM"
        },
        "costs": {
          "updated": "Jan 24, 2026 01:43 AM"
        },
        "cash": {
          "updated": "Jan 24, 2026 01:43 AM"
        },
        "FCF": {
          "updated": "Jan 24, 2026 01:43 AM"
        },
        "assets": {
          "updated": "Jan 24, 2026 01:43 AM"
        }
      },
      "last_updated": "2026-01-24T01:43:15.681452",
      "company": {
        "name": "Advanced Micro Devices Inc",
        "market_cap": "$354.15B",
        "description": "Advanced Micro Devices, Inc. (AMD) is a prominent American semiconductor company based in Santa Clara, California, renowned for its innovative microprocessors, graphics processors, and motherboard chipsets. Catering to diverse markets, including data centers, enterprise solutions, and consumer electronics, AMD's commitment to high-performance computing has positioned it as a significant force in the rapidly evolving semiconductor industry. The company's strategic focus on advancing technology to meet the dynamic needs of both businesses and consumers underscores its potential for continued growth and leadership in the sector.",
        "sector": "TECHNOLOGY",
        "industry": "SEMICONDUCTORS"
      }
    },
    "IREN": {
      "presets": {
        "revenue": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "costs": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "cash": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "FCF": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "assets": {
          "updated": "Jan 28, 2026 12:14 AM"
        }
      },
      "last_updated": "2026-01-28T00:14:16.986178",
      "company": {
        "name": "IREN Ltd",
        "market_cap": "$17.19B",
        "description": "None",
        "sector": "FINANCIAL SERVICES",
        "industry": "CAPITAL MARKETS"
      }
    },
    "NBIS": {
      "presets": {
        "revenue": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "costs": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "cash": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "FCF": {
          "updated": "Jan 28, 2026 12:14 AM"
        },
        "assets": {
          "updated": "Jan 28, 2026 12:14 AM"
        }
      },
      "last_updated": "2026-01-28T00:14:17.897612",
      "company": {
        "name": "Nebius Group N.V.",
        "market_cap": "$22.06B",
        "description": "None",
        "sector": "COMMUNICATION SERVICES",
        "industry": "INTERNET CONTENT & INFORMATION"
      }
    }
  }
}